[
  {
    "Name": "The Sixth Atlas",
    "Hp": 5000,
    "maxHp": 5000,
    "Desc": "The Cloaked Figure stands as a haunting enigma, an apparition in black whose presence seems to consume light and leech warmth from the air. They move with unsettling fluidity, each step a silent echo in the void, as if the shadows themselves were their ally. The dark cloak, frayed and ancient, clings like a shroud, hiding any trace of humanity beneath. But beneath the hood, an elusive glint of eyes gleams with a predatory intelligence, scanning, judging, knowing. In their gaze lies a chilling coldness, a calculated malice—the mark of someone who was once trusted and betrayed that trust with relish. The figure’s aura is one of power and secrecy, an impenetrable shield that commands both awe and terror.",
    "Type": "Unknown",
    "Attacks": {
      "Name": [
        "Dreadbound Gaze",
        "Echoes of the Lost",
        "Oblivion Siphon",
        "Shadow's Refuge",
        "Veil of Shadows"
      ],
      "Power": [65, 70, 85, 90, 65]
    }
  },
  {
    "Name": "Game Host",
    "Hp": 300,
    "maxHp": 300,
    "Desc": "The Game Host, once an ordinary bandit, has risen to his own peculiar form of infamy. Dressed in mismatched pieces of stolen armor, he hides a ruthless mind behind a disarming grin. Cunning and sly, he’s mastered the art of deception and thrives on rigged games and stolen fortunes. His movements are a blend of practiced swagger and quick reflexes, every motion calculated to deceive. Known for luring his victims into 'friendly' wagers, the Game Host is feared by those who recognize the glint of malice in his eyes—a sharp warning to anyone who dares play his game.",
    "Type": "Bandit",
    "Attacks": {
      "Name": [
        "Deceptive Strike",
        "Calculated Gambit",
        "Cheap Shot",
        "Taunting Jab",
        "Hidden Blade"
      ],
      "Power": [55, 70, 60, 65, 50]
    }
  },

  {
    "Name": "Prismara",
    "Hp": 600,
    "maxHp": 600,
    "Desc": "Cloaked in shimmering scales, this dragon haunts the Bloodstone Mountains, striking terror into the hearts of those who dare to venture near. With eyes like burning coals and a roar that echoes the wails of the damned, it feeds on fear, leaving only silence and despair in its wake.",
    "Type": "Mythical",
    "Attacks": {
      "Name": [
        "Claw Strike",
        "Flash-render",
        "Mind Fog",
        "Sonic Roar",
        "Tail lash"
      ],
      "Power": [35, 80, 25, 50, 45]
    }
  },
  {
    "Name": "FrostFang",
    "Hp": 500,
    "maxHp": 500,
    "Desc": "An Eternal beast that moves with an otherworldly grace, appearing and disappearing within the snow. Its ethereal form gives it an almost ghostly quality, making it a haunting figure in the winter night.",
    "Type": "Ice",
    "Attacks": {
      "Name": [
        "Avalanche Howl",
        "Blizzard Breath",
        "Frostbite",
        "Subzero",
        "Winter's wake"
      ],
      "Power": [5, 55, 65, 50, 40]
    }
  }
]
