[
	{
		"chapterId": "chapter1",
		"Name": "The Awakening",
		"branches": [
			{
				"branchId": "branch1",
				"text": "",
				"character1": "none",
				"character2": "none",
				"event": "playMusic",
				"music": "BattleSong",
				"choices": []
			},
			{
				"branchId": "branch2",
				"text": "You awaken on a desolate battlefield, surrounded by a thick fog. The air feels heavy and cold, filled with echoes of distant voices. Shadows stretch across the ground, where remnants of a recent struggle lie. You regain consciousness and notice your friends are scattered on the battleground... Who do you seek for aid:",
				"character1": "none",
				"character2": "none",
				"event": "none",
				"choices": []
			},

			{
				"branchId": "branch3",
				"text": "",
				"character1": "none",
				"character2": "none",
				"event": "visualChoices",
				"choices": [
					{
						"choiceId": "0",
						"option": "Jasmin",
						"outcome": "<span class=\"characterName\">Jasmin:</span> <i>With no words She hugs you </i>... I thought you were gone. You took quite a hit... all this time...we should have never trusted them. <i> She looks into the north to a cloaked figure</i>.",
						"character1": "Images/healer.webp",
						"character2": "none",
						"imgSrc": "Images/healer.webp",
						"gradient": "linear-gradient(15deg, #142850, #14365f, #13476f, #125d80, #107792, #0d96a5, #09b8b4, #04ccb1)",
						"event": "none"
					},
					{
						"choiceId": "1",
						"option": "Llewellyn",
						"outcome": "<span class=\"characterName\">Llewellyn:</span> Ah glad to see you've woken up from that sleep you were in. As you may or may not remember. <i>He points to a cloaked figure</i>. I don't know how but we need to stop them.",
						"character1": "Images/titan.webp",
						"character2": "none",
						"imgSrc": "Images/titan.webp",
						"gradient": "radial-gradient(circle at 20% 0%, #ff8b17, #e6751f, #cc6021, #b24d22, #963b1f, #7b2b1c, #601d16, #45100e)",
						"event": "none"
					},
					{
						"choiceId": "2",
						"option": "Mthi",
						"outcome": "<span class=\"characterName\">Mthi:</span> Do my eyes deceive me? What would we do without you? Don't go doing that again. <i>She smiles faintly and hugs you.</i> Anyway our problem lies with them. <i> Mthi turns to face the cloaked figure in the distance. </i>",
						"character1": "Images/eye.webp",
						"character2": "none",
						"imgSrc": "Images/eye.webp",
						"gradient": "linear-gradient(195deg, #ff00c3, #d123ba, #a42dab, #7b2f97, #552b80, #342465, #181a48, #050b2b)",
						"event": "none"
					},
					{
						"choiceId": "3",
						"option": "Tino",
						"outcome": "<span class=\"characterName\">Tino:</span> Well well well, your return is right on time. Thank you for not dying on us... at least yet. <i>He smiles at you </i>. Although for now, I don't see us getting out of this one. <i> He states while looking at a cloaked figure </i>.",
						"character1": "Images/timekeeper.webp",
						"character2": "none",
						"imgSrc": "Images/timekeeper.webp",
						"gradient": "linear-gradient(90deg, #dc781f, #b8860b, #8b4513)",
						"event": "none"
					},
					{
						"choiceId": "4",
						"option": "Zanele",
						"outcome": "<span class=\"characterName\">Zanele:</span> You poor little thing... I thought you were dead. <i>She hugs you with a sigh of relief</i>. We need to make them pay for this <i>She looks at a cloaked figure in the distance </i> for everything...",
						"character1": "Images/phoenix.webp",
						"character2": "none",
						"imgSrc": "Images/phoenix.webp",
						"gradient": "linear-gradient(45deg, #7d0928, #962521, #ad3e0f, #c15900, #d27500, #de9200, #e6b100, #e8d103)",
						"event": "none"
					}
				]
			},
			{
				"branchId": "branch4",
				"text": "<i>You turn to see the others rushing towards both of you.</i><br><span class=\"characterName\">Jasmin:</span>We can't hold on for much longer. I can only heal everyone a couple more times then I am out of Mana.<br><span class=\"characterName\">Mthi:</span> And I can't transform for a prelonged period of time now thanks to their Mana depletion field.<br><span class=\"characterName\">Tino:</span> Then I'm presuming you can't transform into a Titan for long as well? <i>He looks at Llewellyn.</i><br><span class=\"characterName\">Llewellyn:</span> Yea, I am still able to do a good amount of damage but at the cost of defense. <br><span class=\"characterName\">Zanele:</span> Clearly we need a plan or something. This can't be the end. <br>The group looks to you, awaiting a decision that will determine the stratergy. You decide to: ",
				"character1": "all",
				"character2": "Images/Characters/cloakedFigureBack.webp",
				"event": "none",
				"choices": [
					{
						"choiceId": "0",
						"option": "Jasmin to heal the group and set up a defense barrier",
						"outcome": "<span class=\"characterName\">Jasmin:</span> I'll heal you guys first then we can move on to an attack.<br><span class=\"characterName\">Llewellyn:</span> There won't be much room to plan an effective attack though.<br> <span class=\"characterName\">Jasmin:</span> I know, the mana between all of us should be enough for one more transformation. <i> jasmin heals the group</i> <br><span class=\"characterName\">Zanele:</span> Thank you <i>She nods.</i><br><span class=\"characterName\">Mthi:</span> Collectively we should have enough mana now to hold off.<br> <span class=\"characterName\">Jasmin:</span> Okay <i> The group activates a defensive barrier around them.</i> This should hold.",
						"character1": "all",
						"character2": "Images/Characters/cloakedFigureBack.webp",
						"event": "none"
					},
					{
						"choiceId": "1",
						"option": "Llewellyn to transform into a Titan and strike the enemy",
						"outcome": "<span class=\"characterName\">Llewellyn:</span> There is only one way to get through: full force.<br><span class=\"characterName\">Mthi:</span> That's took risky though, you might not make it.<br><span class=\"characterName\">Llewellyn:</span> That mana field is not going anyway anytime soon.<br><span class=\"characterName\">Tino:</span> He's got a point, if we combine the attack force with a rip through time maybe we can deal enough damage.<br><span class=\"characterName\">Mthi:</span> I'll guide you incase things get...messier. <br><i>Both Llewellyn and Tino nod</i>",
						"character1": "all",
						"character2": "Images/Characters/cloakedFigureBack.webp",
						"event": "none"
					},
					{
						"choiceId": "2",
						"option": "Mthi to sneak up and hypnotize the enemy",
						"outcome": "<span class=\"characterName\">Mthi:</span> Somehow they've managed to dodge all my arrows till this point. Maybe if I try to gain control of them even just for a second. <br><span class=\"characterName\">Zanele:</span> Don't you think that they are too powerful for mind control? <br> <span class=\"characterName\">Jasmin:</span> Yea we couldn't land a single physical attack, mental attacks are another story. <br> <span class=\"characterName\">Mthi:</span> It's worth a shot... and I always take mine. <i>Mthi smirks </i>. <br> <span class=\"characterName\">Zanele:</span>... Just don't die.",
						"character1": "all",
						"character2": "Images/Characters/cloakedFigureBack.webp",
						"event": "none"
					},
					{
						"choiceId": "3",
						"option": "Tino stops time, giving the group enough time to escape the battlefield",
						"outcome": "<span class=\"characterName\">Tino:</span> Maybe we just need a good amount of time to get out of this mess. <br> <span class=\"characterName\">Llewellyn:</span> What about our allies? <br><span class=\"characterName\">Tino:</span> There won't be enough time... <br> <span class=\"characterName\">Zanele:</span> If that's a choice we must make...<br> <span class=\"characterName\">Tino:</span> Nothing else needs to said. <i>Tino stops time </i>",
						"character1": "all",
						"character2": "Images/Characters/cloakedFigureBack.webp",
						"event": "none"
					},
					{
						"choiceId": "4",
						"option": "Zanele to burn the battlefield, losing allies but ensuring the enemy is gone",
						"outcome": "<span class=\"characterName\">Zanele:</span> We need to get out of this, one way or the other. <br> <span class=\"characterName\">Jasmin:</span> And you are suggesting? <br> <span class=\"characterName\">Zanele:</span> Using Inferno around us, we can ensure that the enemy is gone but - <br> <span class=\"characterName\">Mthi:</span> That flame will also devour everything else outside of the protective circle. <br> <span class=\"characterName\">Zanele:</span> Yes. <br> <span class=\"characterName\">Jasmin:</span> At this point- <br> <span class=\"characterName\">Tino:</span> We need to ensure that they are stopped, no matter the cost. <br> <span class=\"characterName\">Zanele:</span> Okay... <i> Zanele lights the circle and everyone steps inside </i>.",
						"character1": "all",
						"character2": "Images/Characters/cloakedFigureBack.webp",
						"event": "none"
					}
				]
			},
			{
				"branchId": "branch5",
				"text": "<span class=\"characterName\">Cloaked Figure:</span> So That's It?!?",
				"character1": "all",
				"character2": "Images/Characters/cloakedFigureFront.webp",
				"event": "skipChoices",
				"choices": [
					{
						"choiceId": "0",
						"option": "",
						"outcome": "<span class=\"characterName\">Cloaked Figure:</span> The so-called mighty Five... hiding behind barriers instead of facing me head-on? <i> With a single tap, the Cloaked Figure shatters the protective field into a cascade of glittering fragments.</i>.Your cowardice is laughable. .<br><i>In the blink of an eye, the enemy vanishes, reappearing inches from your face.</i><br> <span class=\"characterName\">Cloaked Figure:</span> I suppose I'll just cut off your heads, then.",
						"character1": "all",
						"character2": "Images/Characters/cloakedFigureFront.webp",
						"event": "none"
					},
					{
						"choiceId": "1",
						"option": "",
						"outcome": "<span class=\"characterName\">Llewellyn:</span> Now! <br> Llewellyn roars as he transforms into a towering Titan, his every move supercharged by Tino's time magic, making him a blur of speed and power. Together, they launch a relentless assault of attacks on the cloaked figure, each attack crashing down with earth-shaking force. The cloaked figure remained unscaled, dodging at faster speeds. Llewellyn raises his colossal fist for a final strike, slamming it down with all his might. The ground trembles, but the cloaked figure meets the blow with a single hand, stopping the attack effortlessly. <br> <span class=\"characterName\">Cloaked Figure:</span> Hmm....  you done? <br> The group rallies together, charging into another fierce battle, ready to face the enemy once more.",
						"character1": "Images/Assets/Titan Terror.webp",
						"character2": "Images/Characters/cloakedFigureFront.webp",
						"event": "none"
					},
					{
						"choiceId": "2",
						"option": "",
						"outcome": "<span class=\"characterName\">Mthi:</span> Just need the perfect angle.<i>She dashes through the chaos, weaving effortlessly between enemies, her eyes locked on the cloaked figure.</i> <br><span class=\"characterName\">Cloaked Figure:</span> Mthi... perhaps you’ll prove to be a worthy opponent. <br> <span class=\"characterName\">Mthi:</span> Can't say the same for you. <i>She fires an illusionary arrow that splits into a barrage of identical arrows, each one indistinguishable from the original.</i> <br>The cloaked figure, unphased, snatches the real arrow mid-air with chilling precision.<br><span class=\"characterName\">Cloaked Figure:</span> Let me guess... now comes the hypnosis?<i> A sinister grin spreads across their face, laced with dark intent.</i> <br><span class=\"characterName\">Mthi:</span> <i>Mthi reaches out to seize control of the figure's mind, but instead, she’s violently pulled into a whirlwind of her darkest nightmares. Fear floods her senses as her worst terrors rise to the surface, drowning her in a horrifying reality she can't escape.</i> <br> <span class=\"characterName\">Llewellyn:</span>  Mthi! Change of plan - attack head on. <i>Without hesitation, the group surges forward, weapons drawn, charging into another deadly clash with the enemy, ready to face whatever chaos awaits.</i> ",
						"character1": "Images/eye2.webp",
						"character2": "Images/Characters/cloakedFigureFront.webp",
						"event": "none"
					},
					{
						"choiceId": "3",
						"option": "",
						"outcome": "<span class=\"characterName\">Tino:</span> A second is enough to change this.<i>The sky darkens, drained of all colour, as He slams his hands together with a thunderous force, halting the flow of time itself. Everything freezes in place, except for the group, suspended in the eerie stillness of the world around them.</i> <br><span class=\"characterName\">Jasmin:</span> Let's go. <i> She opens a portal to place she has visisted, allowing for the group to find safe closure there.</i>",
						"character1": "Images/timekeeper.webp",
						"character2": "Images/Characters/cloakedFigureFront.webp",
						"event": "none"
					},
					{
						"choiceId": "4",
						"option": "",
						"outcome": "<span class=\"characterName\">Zanele:</span> Yes, that's it. <i>Zanele snaps her fingers, igniting a spark that erupts into a roaring inferno. Flames spiral outward, devouring everything in their path. Smoke chokes the air, and the heat is suffocating, leaving behind only the charred scent of scorched earth and burning flesh as the fire consumes all on the battleground.</i>",
						"character1": "Images/storyInferno.webp",
						"character2": "Images/Characters/cloakedFigureFront.webp",
						"event": "none"
					}
				]
			},
			{
				"branchId": "branch6",
				"text": "",
				"character1": "none",
				"character2": "none",
				"event": "checkChoices",
				"choice": 1,
				"values": [3],
				"endBranch": 7,
				"choices": []
			},
			{
				"branchId": "branch7",
				"text": "<span class=\"characterName\">Unknown Queen:</span> Cowards ! In our worst moment you choose to run ? <br>The battlefield is chaos. Soldiers from the allied kingdoms clash desperately against the relentless enemy. Banners are tattered, and the air is thick with smoke and ash.<br><span class=\"characterName\">Unknown Ally:</span> Hold the line! For Eryndor! For all the kingdoms.A knight swings their halberd, cutting down an enemy as a  Aurelian mage summons water to douse encroaching flames. Before the mage can cast again, they fall to a hail of arrows.<br><span class=\"characterName\">Unknown Captain:</span> Protect the queen at all costs!The captain, clad in silver armor, carves a path through the chaos. Their greatsword cleaves through enemies, but even their strength seems insufficient against the tide.Through the fray, the cloaked figure strides with deadly precision.<br><span class=\"characterName\">Unknown Ally:</span> What is that thing? Nothing stops them! <br>The cloaked figure raises a hand, and a wave of fire erupts, consuming rows of archers. Shadowy tendrils lash out from their blade, pulling shield-bearers into the inferno.<br><span class=\"characterName\">Unknown Queen:</span> Stand your ground! Fight with honor! Unlike those cowards we shall not leave our home to perish. <br>The queen’s silver spear pierces an enemy foe, but her efforts are not enough to turn the tide. Another fiery orb detonates in the heart of the allied forces, scattering soldiers and leaving despair in its wake.<br><span class=\"characterName\">Unknown Captain:</span> We can’t hold them! Fall back!The captain charges the cloaked figure in a desperate bid for hope. Their blade meets the figure’s with a clash that reverberates through the battlefield. But the figure counters swiftly, shattering the captain’s sword and sending them to the ground.The cloaked figure advances, unstoppable, as the allied forces crumble around them. Victory slips further away with every step.",
				"character1": "Images/Characters/Silver Order.webp",
				"character2": "Images/Characters/cloakedFigureFront.webp",
				"event": "none",
				"choices": []
			},
			{
				"branchId": "branch8",
				"text": "",
				"character1": "none",
				"character2": "none",
				"event": "checkChoices",
				"choice": 1,
				"values": [4],
				"endBranch": 9,
				"choices": []
			},
			{
				"branchId": "branch9",
				"text": "The allied forces scramble to organize, but the chaos only grows. The cries of the wounded echo, blending with the clash of weapons and the roar of the flames.<br><span class=\"characterName\">Unknown Captain:</span> Where did that flame arise from ?! <br><span class=\"characterName\"> Unknown Knight:</span> Our eyes say from the east Captain. Seems that <i>the group </i> has betrayed us. <br><span class=\"characterName\">Unknown Captain:</span> Jasmin... why would they ?.... Knight. Gather all the water types and stop those flames. <br><span class=\"characterName\"> Unknown Knight:</span> Understood. <br><span class=\"characterName\">Unknown Ally:</span> Water! We need water! Douse the flames! <br>Water mages spring into action, summoning torrents of water in a desperate attempt to quell the inferno. But the flames grow, twisting and expanding with a life of their own. Every spell cast is met with resistance, as the fire leaps higher and higher, fueled by an unrelenting heat.<br><span class=\"characterName\">Unknown Mage:</span> It’s too much! We can’t stop it! <br>A massive wall of water is summoned, crashing down on the flames, but the fire surges forward, licking the air with an insatiable hunger. Soldiers flee from the blaze, their clothes singed, but the fire continues to spread across the battlefield.<br><span class=\"characterName\">Unknown Ally:</span> Retreat! Fall back to the eastern ridge! <br>The once organized lines are shattered as the fire rages on, burning through the ranks of the allied forces. Soldiers shout for their comrades, but the flames separate them, isolating the injured and the dying.Through the storm of fire, the cloaked figure moves unscathed, walking calmly amidst the chaos.<br><span class=\"characterName\">Cloaked Figure:</span> The Atlas Six really think this will stop <i>me</i>Let your allies burn. <br> The cloaked figure raises a hand, and the flames grow brighter, more ferocious. The shadows around them seem to twist and coil, feeding the fire, making it impossibly vast. Despite all efforts, the fire continues to rage, and the allied forces are overwhelmed, unable to stop the inferno from consuming everything in its path.The landscape is becoming a wasteland, the once vibrant colors of the battlefield replaced by the deadly glow of flames. Those who remain on their feet are scattered, unsure of where to go, their faces smudged with soot and fear. But through it all, the cloaked figure walks unharmed, a shadow amidst the burning world they have left behind.",
				"character1": "Images/Characters/Cedric.webp",
				"character2": "Images/Characters/cloakedFigureFront.webp",
				"event": "none",
				"choices": []
			},

			{
				"branchId": "branch10",
				"text": "",
				"character1": "none",
				"character2": "none",
				"event": "checkChoices",
				"choice": 1,
				"values": [0, 1, 2],
				"endBranch": 12,
				"choices": []
			},

			{
				"branchId": "branch11",
				"text": "",
				"character1": "all",
				"character2": "Images/Characters/cloakedFigureFront.webp",
				"event": "triggerBattle",
				"winnable": false,
				"startEnemies": [0],
				"spawnEnemies": [],
				"choices": []
			},
			{
				"branchId": "branch12",
				"text": "As your vision clears, you feel the jagged chill of the hard, cold ground beneath you, echoing the icy dread settling in your bones. A rhythmic pounding fills your ears—your own heartbeat, hammering faster with each passing second. Shadows shift, and a dark figure steps closer, their silhouette seeming to blend into the very void around them. <br><span class=\"characterName\">Cloaked:</span> Look at you — fallen, broken. You've lost more than just this battle. Prepare to watch everything you hold dear slip away … one by one. <br> Their voice is a low, menacing whisper, each word twisting like a blade in your heart. You feel a suffocating weight as the realization dawns—this isn’t just defeat; it’s a reckoning, the merciless unraveling of everything you fought for. In the shadows, you see flashes of familiar faces—your friends, your allies—each one flickering like a candle about to be snuffed out. The Cloaked Figure’s presence presses down, clouding the air with a foreboding that chills you to your core. This isn’t just an end; it’s your end, at the hands of someone who you held close to you.",
				"character1": "all",
				"character2": "Images/Characters/The Sixth Atlas.webp",
				"event": "none",
				"choices": []
			},
			{
				"branchId": "branch13",
				"text": ".",
				"character1": "none",
				"character2": "none",
				"event": "stopMusic",
				"choices": []
			},
			{
				"branchId": "branch14",
				"text": "......",
				"character1": "none",
				"character2": "none",
				"event": "none",
				"choices": []
			},
			{
				"branchId": "branch15",
				"text": "<span class=\"characterName\">Passion:</span> Hey there, developer Tino here... No not in game Tino, Tino from the past... or in your case the present... but also the future ? Anyway, Thanks for taking your precious time to give The Atlas Six a try. Currently the game is still in early development so there are prone to be bugs but fear not, they don't bite. Feel free to let me know if you encounter any bug that does bite though <a href=\"mailto:tinomhedziso21@gmail.com\">tinomhedziso21@gmail.com</a>.",
				"character1": "none",
				"character2": "Images/timekeeper.webp",
				"event": "none",
				"choices": []
			},
			{
				"branchId": "branch16",
				"text": "<span class=\"characterName\">Passion:</span> The narrative of The Atlas Six is centered around 6 heroes... whom the 6th one may or may not betray you as you have just seen. The idea was constructed around a fictional storyline my friends <i>[who are the in game characters]</i> and I came up with. That being said each character is meant to represent a subset of that friend but the actions performed in the world by Atlas characters do not completely reflect actions my friends would actually do.",
				"character1": "none",
				"character2": "Images/timekeeper.webp",
				"event": "none",
				"choices": []
			},
			{
				"branchId": "branch17",
				"text": "<span class=\"characterName\">Passion:</span> The world you find yourself is a strange one - to say the least. The <i>Known World </i> is a place teeming with conflict, clashing ideologies, ruthless politics, and fervent beliefs — it's a relentless force that consumes all who dare ignore its warnings.  The world is constantly changing based on Your choices such as <i>this timeline </i> where your 6th friend betrays you, whoever that is. Certain actions will have certain consequences that may or may not align with your desire, certain characters will have certain story narratives and certain.... blah blah blah you get the idea. Morally right choices may not be the best ones overall and vice versa so think carefully. Experience is the best teacher so I will let you play now 😄🦚 - <i>Enjoy</i>",
				"character1": "none",
				"character2": "Images/timekeeper.webp",
				"event": "none",
				"choices": []
			},
			{
				"branchId": "branch18",
				"text": "",
				"character1": "none",
				"character2": "none",
				"event": "playMusic",
				"music": "BloomhavenMusic",
				"choices": []
			},
			{
				"branchId": "branch19",
				"text": "",
				"character1": "",
				"character2": "",
				"event": "changeScene",
				"background": "Bloomhaven",
				"choices": []
			},
			{
				"branchId": "branch20",
				"text": "Tino’s mind clears, his senses snapping back to reality, only to find himself staring down the gleaming tip of an arrow aimed directly at his head.. <br> <span class=\"characterName\">Mthi:</span> Rise an shine sleepy head. <i>Mthi’s voice rings out, and a mischievous grin lights up her face, clearly savoring the moment.</i> <br><span class=\"characterName\">Tino:</span> Go on, release it… I dare you. Your aim’s about as good as the guys who try to shoot <i>their shot</i> at you. <i>He laughs at the challenge sparking between them</i>. <br> <span class=\"characterName\">Mthi:</span> How is it possible to be both the fastest and the slowest here? <i> Her bowstring pulls back, just a hair’s breadth from releasing.</i> <br> <span class=\"characterName\">Tino:</span> One second is all I need.<i> Tino raises his hand, fingers resting against the hilt of his blade - </i>. <br>Before the tension thickens any further, Zanele steps forward, casting a warning glance between them. <br> <span class=\"characterName\">Zanele:</span> Knock it off you two, we don't want any problems here, especially in Bloomhaven.",
				"character1": "Images/timekeeper.webp",
				"character2": "Images/eye.webp",
				"event": "none",
				"choices": []
			},
			{
				"branchId": "branch21",
				"text": "Bloomhaven is a charming inn tucked in the heart of Aurelia, exuding warmth and inviting tranquility to all who pass through. Known for its namesake lanterns that emit a soft, golden glow, the inn’s cozy ambiance is perfect for weary travelers and townsfolk alike. The inn’s flower-laden windows and ivy-wrapped walls reflect Aurelia’s affinity for nature, with scents of lavender drifting through the air. <br><span class=\"characterName\">Jasmin:</span> Bloomhaven, I remember coming here as a girl. <br> <span class=\"characterName\">Tino:</span> So you are not a girl anymore ? <br> <span class=\"characterName\">Jasmin:</span> ...A <i>Young</i> girl... <i> Tino </i>. <br>  Where is Llewellyn anyway? <br> <span class=\"characterName\">Tino:</span> Probably training with the royal guard or things of that nature. I don't know. <br> <span class=\"characterName\">Mthi:</span> In that case, I am going to find a game to play. <i> She starts searching for a game host. </i> <br> <span class=\"characterName\">Zanele:</span> Meanwhile I'll get us the usual drinks.",
				"character1": "Images/healer.webp",
				"character2": "Images/phoenix.webp",
				"event": "none",
				"choices": []
			},
			{
				"branchId": "branch22",
				"text": "As Zanele walks towards the innkeeper, her eyes catch sight of two figures standing side-by-side, shrouded in the warm light. They each wear steampunk-inspired attire, detailed with gears, buckles, and straps in shimmering brass and worn leather. Their outfits, however, are primarily a deep, rich shade of purple, blending into the twilight hues around them. The first figure, taller with a sturdy posture, is a man whose presence feels timeless. His face is partially shadowed beneath a hat. His eyes hold a far-off gaze, as though he’s not entirely present, one foot grounded in this moment and the other in a place beyond comprehension. <br> Beside him, the second figure is more slight and nimble, exuding a sharp, clever energy. This one—the shorter, with a mischievous gleam in her eye — has an air of wit and keen observation, her expression is one of amusement. She glances toward her companion with a knowing smirk, her attention flicking from him to the world around with effortless curiosity. They notice Zanele but don’t address her, continuing their debate, their words cryptic, laced with double meanings and a weight she can't quite place. For now, they refer only to vague ideas—life, choices, paths, knowledge—dancing around deeper subjects that feel just out of reach, waiting for Zanele to uncover their true purpose in her journey.",
				"character1": "Images/phoenix.webp",
				"character2": "Images/Characters/The Twins-purple.webp",
				"event": "none",
				"choices": []
			},
			{
				"branchId": "branch23",
				"text": "<span class=\"characterName\">Twin 1:</span>To live is to understand the world around you, the roads that twist and turn, the choices branching into every possibility. Without knowing the pathways before us, we become lost, endlessly wandering. Life is best understood as a series of external paths to traverse, and mastery comes from navigating them well. Only through awareness of our surroundings and understanding of the world’s patterns can we move forward with certainty. Those who ignore the greater map risk being swept away by currents they cannot see. <br> The female twin nods with her eyes closed, assimilating her brother's point while conjuring her own. <br><span class=\"characterName\">Twin 2:</span> And yet, dear twin, all the paths in the world are meaningless if one doesn't know oneself. To explore the outer world without examining one's own depths is to chase reflections, shadows cast by the soul. Knowing who you are—your strengths, your weaknesses, your friends, your enemies—this is the true anchor. How can one stand firm in the shifting sands of fate without first understanding the inner workings of the heart? <br><span class=\"characterName\">Twin 1:</span>To focus solely inward is to miss the infinite beauty and danger of the world beyond. If we know ourselves but not the world we live in, we become trapped within our own minds, circling familiar thoughts. It is the journey outward that shapes us, just as we shape the journey. <br> With a patient smile, the female twin looks at Zanele then answers with her response. <br><span class=\"characterName\">Twin 2:</span> Perhaps. But it is only through looking within that we find the tools to face the world without. A map may guide your steps, but it cannot help you understand why you walk or who walks with you. True mastery comes from learning to see with the heart as well as the eye. . <br> They fall silent, each pondering the other’s words, as Zanele watches them in quiet fascination, sensing that this is no ordinary debate but a glimpse into something much deeper.",
				"character1": "Images/phoenix.webp",
				"character2": "Images/Characters/The Twins-purple.webp",
				"event": "none",
				"choices": []
			},
			{
				"branchId": "branch24",
				"text": "<span class=\"characterName\">Twin 2:</span>Consider a book, dear Chronos. Some are open, easy to read, their pages clear to anyone who looks. But others hide their truths, requiring patience, insight, and time to understand. And just as we learn to read others, we must also learn to read ourselves, to turn our own pages and understand the story we’re telling. Without this inner knowledge, how can we interpret the world’s challenges, let alone respond to them? <br><span class=\"characterName\">Twin 1:</span> Quiet so indeed Caelia - <i>They both gaze at you, allowing the purple radiance of their magic to dissipate into nothingness, granting you passage.</i> Ah, but we have a guest, tell us <i> Zanele - </i> <br> A wave of confusion fills your mind; you've just learned their names, yet they speak yours as if it were known to them for ages. <br> <span class=\"characterName\">Caelia:</span> —what do you believe is more important? <br><span class=\"characterName\">Chronos:</span> Is it knowing oneself? <br><span class=\"characterName\">Caelia:</span> Or understanding the world around?",
				"character1": "Images/phoenix.webp",
				"character2": "Images/Characters/The Twins-purple.webp",
				"event": "none",
				"choices": []
			},
			{
				"branchId": "branch25",
				"text": "",
				"character1": "Images/phoenix.webp",
				"character2": "Images/Characters/The Twins.webp",
				"event": "visualChoices",
				"choices": [
					{
						"choiceId": "0",
						"imgSrc": "Images/Choices/Knowing Yourself.webp",
						"option": " Knowing yourself",
						"outcome": "<span class=\"characterName\">Caelia:</span> Well, well, it seems my words have had their effect. <i>She tilts her head slightly, her smile still warm but reserved, as if she's trying to hide her satisfaction.</i> <br><span class=\"characterName\">Caelia:</span> I must admit, I wasn't sure how you'd choose, but… I suppose I shouldn't be surprised. <br> <span class=\"characterName\">Chronos:</span>She doesn’t say it, but she’s pleased. <i> His voice carries the faintest trace of amusement, though his tone is as calm and measured as ever. He stands a little further away, arms crossed, watching the interaction with interest.</i> <br><span class=\"characterName\">Caelia:</span> Take this <i> She hands takes out a map  and hands it over with a quiet nod, her eyes scanning your face for a reaction.</i> It's not just a map of the lands; it's a map of what's to come. Follow its paths, and you’ll find more than just landmarks. <br><span class=\"characterName\">Chronos:</span>The path ahead is uncertain, but the map ... is certain. Hmmm might as well also hand over this. <br> He reaches into his cloak and pulls out an ancient book, its cover glowing faintly with an ethereal light. The worn leather feels surprisingly warm, as if it recognizes your touch. As you open it, the pages shimmer with energy, whispering secrets in languages unknown, while the illustrations seem to come alive. It’s both a guide and a challenge—offering wisdom yet guarding dangerous truths. The book feels like a paradox, a trusted companion and a formidable foe, revealing only what it chooses. ",
						"character1": "Images/phoenix.webp",
						"character2": "Images/Characters/The Twins.webp",
						"gradient": "linear-gradient(0deg, rgba(127,59,66,1) 0%, rgba(28,20,41,1) 100%)",
						"event": "none"
					},
					{
						"choiceId": "1",
						"imgSrc": "Images/Choices/Knowing The World.webp",
						"option": "Knowing the world",
						"outcome": "<span class=\"characterName\">Caelia:</span> So, you've made your choice. But the world you're stepping into... well, it's more than what meets the eye. <br><span class=\"characterName\">Chronos:</span> You will need more than instinct to understand the world around you. This will help. <br>He reaches into his cloak and pulls out a book, its cover glowing faintly with an ethereal light. The worn leather feels surprisingly warm, as if it recognizes your touch. As you open it, the pages shimmer with energy, whispering secrets in languages unknown, while the illustrations seem to come alive.It’s both a guide and a challenge—offering wisdom yet guarding dangerous truths. The book feels like a paradox, a trusted companion and a formidable foe, revealing only what it chooses. <br><span class=\"characterName\">Chronos:</span> This is the Encyclopedia of the Known World. It holds the knowledge of many lands, cultures, creatures, and even some secrets... if you know where to look. <br><span class=\"characterName\">Caelia:</span>  It will open your eyes to things you never thought possible. The more you know, the better you'll understand the path you’re on. <br><span class=\"characterName\">Chronos:</span>The truth is rarely exciting, but it is always necessary. <br> Caelia also hands you a map, revealing paths to places you've never encountered before. <br><span class=\"characterName\">Caelia:</span> You'll need that as well.",
						"character1": "Images/phoenix.webp",
						"character2": "Images/Characters/The Twins.webp",
						"gradient": "linear-gradient(180deg, #dc781f, #b8860b, #8b4513)",
						"event": "none"
					}
				]
			},
			{
				"branchId": "branch26",
				"text": "<span class=\"characterName\">Zanele:</span> Hold on, this is all well and good, but who are you people, and how do you even know my name? <br><span class=\"characterName\">Chronos:</span> Heh, that’s the spirit—always ask when you're not told. <br> With a dismissive wave, they cast the purple barrier of energy once more, sealing you off from further interaction. Unfazed, they continue their intricate debate as they stride out of the inn, leaving you in their wake.<br><span class=\"characterName\">Caelia:</span> Do you think the others would have chosen differently? Maybe Mthi? <br><span class=\"characterName\">Chronos:</span> Perhaps Llewellyn, but I can’t say for certain about Jasmin.. <br> Zanele tries to follow them, eager for answers, but in the blink of an eye, they disappear, leaving no trace behind.",
				"character1": "Images/phoenix.webp",
				"character2": "Images/Characters/The Twins-purple.webp",
				"event": "none",
				"choices": []
			},

			{
				"branchId": "branch27",
				"text": "Under the warm glow of Bloomhaven’s lamplight, Jasmin and Elenora share a rare moment of peace. Though they have walked different paths, the magic they once learned together still binds them. Jasmin, whose hands have healed countless wounds within the Atlas Six, feels a quiet nostalgia here, with Elenora's familiar smile across the table. <br><span class=\"characterName\">Elenora:</span> You’ve come a long way, Jasmin, <i>Elenora says, pouring another cup of tea</i> I hear the Atlas Six has made quite a name for themselves. <br> Jasmin smiles, fondly recalling the adventures and bonds she’s forged, yet grateful for the steady friendship that Nora has always offered: one that stretches back to childhood training sessions and letters exchanged over the years. Their lives may be different now, but in moments like these, it’s as if nothing has changed at all.<br><span class=\"characterName\">Jasmin:</span> Yes, we’ve been through more than I ever imagined... battles, journeys, mysteries unraveling one after another. But it’s the little things I miss most, like these quiet moments. <i>She says, meeting Elenora's gaze.</i> <br><span class=\"characterName\">Elenora:</span> You’re the healer, after all. The one who’s always making sure everyone else’s spirits are intact. <i>She leans back thoughtfully, the firelight casting warm shadows on her face. </i> I suppose that hasn’t changed since we were kids, huh? <br><span class=\"characterName\">Jasmin:</span> No, I guess it hasn’t. And you Nora, hehe — you’re still as sharp as ever, I bet. I remember how you’d always get ahead in our lessons, even when I struggled to keep up.<br> Elenora raising an eyebrow while grinning at you.<br><span class=\"characterName\">Elenora:</span> Oh please, your flattery won’t get you an extra training session with me. <br> You put on a mock frown, as if truly let down. ",
				"character1": "Images/healer.webp",
				"character2": "Images/Characters/Elenora.webp",
				"event": "none",
				"choices": []
			},
			{
				"branchId": "branch28",
				"text": "<span class=\"characterName\">Elenora:</span> What would you like us to talk about ?",
				"character1": "Images/healer.webp",
				"character2": "Images/Characters/Elenora.webp",
				"event": "choiceLoop",
				"choices": [
					{
						"choiceId": "0",
						"option": "Aurelia and the World",
						"outcome": "<span class=\"characterName\">Jasmin:</span> Aurelia is still as vibrant as it ever was. <br> <span class=\"characterName\">Elenora:</span> It remains ever so alive, the kingdom and its folk. We’re holding strong, despite the challenges. The heart of Aurelia beats in its people, as always.<br><span class=\"characterName\">Jasmin:</span> What kind of challenges have you been facing lately? <br><span class=\"characterName\">Elenora:</span> Oh, you know, the usual... There are whispers of unrest, small pockets of rebellion, but nothing we can't handle. The land itself still flourishes, but with the growing tensions between kingdoms, it’s harder to maintain the same peace we once had. It’s not just the politics, but the rising threats from beyond our borders, too. <br><span class=\"characterName\">Jasmin:</span> I thought we were all allies... <br><span class=\"characterName\">Elenora:</span> We were. And many still are. But not all share the same vision for the future of the kingdoms. Some are growing bolder, others more fearful. <i>Eryndor </i>, the land of fierce stone titans, has always sought to expand its horizons. More often than not, this has led them into conflict with <i> Kurohana </i>, the land hidden among the mountains with it's graceful traditions. Who would have thought that stone and fire — two elements that should naturally find balance — would be at odds? It's a strange time. The winds of change are swirling, Jas.",
						"character1": "Images/healer.webp",
						"character2": "Images/Characters/Elenora.webp",
						"event": "none"
					},
					{
						"choiceId": "1",
						"option": " Elenora's family",
						"outcome": "<span class=\"characterName\">Jasmin:</span> Your family, how are they? <br><span class=\"characterName\">Elenora:</span> Oh, they’re doing well enough. You know how it is—busy with their duties. My father’s been working on his latest project in the city, and my mother ...well, she’s always involved in one of her gardens. It’s hard to get a quiet moment with her sometimes. <br> <span class=\"characterName\">Jasmin:</span> Sounds like the usual. I’m sure they’re all proud of you, though. Especially your mother — she spends so much time in the garden, but I’m sure you’re the thing she’s most proud of nurturing. <br><span class=\"characterName\">Elenora:</span> Thing? from flattery to insults huh Jasmin ? <i> she playfully winks at you </i> Yeah, I get that. My independence grows from the seeds my parents have planted, all the effort they've put in to help me blossom into who I am today.",
						"character1": "Images/healer.webp",
						"character2": "Images/Characters/Elenora.webp",
						"event": "none"
					},
					{
						"choiceId": "2",
						"option": "Current Affairs",
						"outcome": "<span class=\"characterName\">Jasmin:</span> How are the royals Nora? <br><span class=\"characterName\">Elenora:</span> Girl <i> please </i>,when have you ever cared about politics? <i>A slight shadow of concern crosses Elenora's face. She leans in close, her eyes narrowing as she examines yours.</i>. Wait... you're not a shifter, are you?<br> <span class=\"characterName\">Jasmin:</span> Oh trust me, I still don't, but what I do care about are the decisions made by the higher ranks. Those affect me and the people around me. <br><span class=\"characterName\">Elenora:</span> Fair enough, you always did care more about people than power. <i>Elenora gives a small, knowing smile before her expression grows more serious.</i> <br><span class=\"characterName\">Elenora:</span> Aurelia is still thriving, Jas. The kingdom itself is stable for now, but there are growing concerns. The unrest is there, simmering beneath the surface. Small protests here and there, mostly about the royals’ handling of trade agreements and the distribution of resources. Nothing major, yet, but it could escalate if they don't handle it right. <i>Her voice softens, but there's a hint of caution in her tone.</i> <br> If things do take a turn for the worse... we could see something far more serious. The possibility of war is becoming harder to ignore, and if that happens, healers like us might be forced to stay in Aurelia. We’d be bound to the kingdom, regardless of the personal cost. It’s a future none of us want to face, but it’s something we’ll have to prepare for if the royals can’t keep the peace.",
						"character1": "Images/healer.webp",
						"character2": "Images/Characters/Elenora.webp",
						"event": "none"
					},
					{
						"choiceId": "3",
						"option": "Combat",
						"outcome": "<span class=\"characterName\">Jasmin:</span> How do you find the world's battles Nor- <i> before you finish, Elenora interjects </i> <br> <span class=\"characterName\">Elenora:</span> You’ve heard the tales—how our battles are more than just swinging swords and casting spells, right? In this world, combat is as much about strategy as it is about power. The clash of blades and the weave of magic are just the beginning. <br> Elenora looks over her shoulder, scanning the room, then leans in a bit closer, her voice lowering, almost as if sharing a secret. <br><span class=\"characterName\">Elenora:</span> The battlefield is a dance. You take your turn, then the enemy takes theirs. You can either strike with all your might—attack—or you can tend to your own wounds and heal those around you. Sometimes, the best offense is a strong defense, so we’ve got ways to bolster ourselves. With the right focus, you can strengthen your body or sharpen your mind—boosting your health and energy for what's to come. It’s a delicate balance. <i>Her eyes sparkle with a glint of excitement, revealing the possibilities that lie ahead.</i> <br><span class=\"characterName\">Elenora:</span> But it doesn't stop there. As you journey through this land, you’ll unlock new abilities, new ways of fighting. Our classes aren't set in stone, Jas. A healer, like you, could one day wield the forbidden arts of blood magic or tap into the vampiric energies of your foes. Instead of drawing from mana, you could steal life from your enemies, turning their strength into your own. And that’s just one example. <br><span class=\"characterName\">Jasmin:</span> Nora - <i> You try to stop her, but she presses on, undeterred, her voice unwavering.</i> <br><span class=\"characterName\">Elenora:</span> Imagine this: <i> She grabs your hand, her gaze drifting to the distant horizon, </i> synergies. The Atlas Six working together, combining their strength, magic, and willpower for a devastating super attack. Picture it: you and Mthi, weaving your powers together, striking down an enemy in a single, unstoppable blow. Each of us is a thread in a greater tapestry, Jas. Alone, we are powerful. Together, we are unstoppable. <br><span class=\"characterName\">Jasmin:</span> Nora, that’s a lot to take in. Thank you, but... I think I need a moment to process all of that. <br><span class=\"characterName\">Elenora:</span>Heh, You asked for it. <i>She flashes a knowing smile, clearly amused by the amount of information she just unloaded on you.</i>",
						"character1": "Images/healer.webp",
						"character2": "Images/Characters/Elenora.webp",
						"event": "none"
					},
					{
						"choiceId": "4",
						"option": "Relationships",
						"outcome": "<span class=\"characterName\">Jasmin:</span> So, any hopeful admirers, Nora? <br><span class=\"characterName\">Elenora:</span> You, of all people, are really asking me this? <i>She raises a brow and her face becomes emotionless.</i> <br> Her tone is light, but there's a spark of challenge in her eyes. Sensing you may have hit a nerve, you try to backtrack. <br><span class=\"characterName\">Jasmin:</span> I mean—no offense, I was just curious— <br> Before you can continue, she narrows her gaze, crossing her arms in exaggerated indignation. <br><span class=\"characterName\">Elenora:</span> Curious, were you? <br> She lets the silence hang a moment too long, her expression unreadable. <br><span class=\"characterName\">Jasmin:</span> Nora... <br>Just as you start to wonder if you've really crossed a line, her face breaks into laughter. Elenora’s laughter rings out, filling the air with a warmth that diffuses any tension. <br><span class=\"characterName\">Elenora:</span> Relax, Jas. I’m just messing with you. As for romance... no one at the moment. My focus is on training, becoming someone worthy of our kingdom. <br><span class=\"characterName\">Jasmin:</span> Nah girl I can never with you. Because, honestly, every guy I meet either wants to marry me or ‘get to know me better’ - which, let’s be real, we both know what that means. <br> Elenora bursts out into more laughter. <br><span class=\"characterName\">Jasmin:</span> And I mean, not even marriage, really. Half of them can barely hold a conversation before they’re already planning our wedding in their heads. <br> Elenora’s laughter fades, and her expression shifts, her eyes narrowing as if she’s genuinely considering the weight of your words.<br><span class=\"characterName\">Elenora:</span>But... if this is your way of asking me out, Jas, well, maybe I’d make an exception.",
						"character1": "Images/healer.webp",
						"character2": "Images/Characters/Elenora-expressionless.webp",
						"event": "none"
					},
					{
						"choiceId": "5",
						"option": "End Conversation",
						"outcome": "As the conversation winds down, Elenora steps forward, her eyes warm as she pulls you into a tight embrace. The familiar scent of cedar fills the air, bringing back memories of the long nights spent laughing and dreaming together. <br><span class=\"characterName\">Elenora:</span> Even in all the chaos, we somehow always find our way back to each other. <br>You both linger in the moment, each lost in the memory of shared adventures and quiet moments under the Aurelia stars. <br><span class=\"characterName\">Elenora:</span> I’ll see you again, Jasmin. Don’t go finding trouble without me, alright? <br><span class=\"characterName\">Jasmin:</span> I won't Nora. <i> You feel a sense of emptiness as she leaves the inn. </i> ",
						"character1": "Images/healer.webp",
						"character2": "Images/Characters/Elenora.webp",
						"event": "none"
					}
				],
				"closingChoice": 5
			},

			{
				"branchId": "branch29",
				"text": "Mthi's search is resolved shortly as she finds a game host. Analysing the table, the game is simple: A memory game that requires you to flip the cards creating pairs until you match all 18 cards. <br> <span class=\"characterName\">Game Host:</span> Tis an easy game, just match the cards that's all. What do you say to a round or two? <br> <span class=\"characterName\">Mthi:</span> Hmmm, okay, it's a good way to kill time I guess.",
				"character1": "Images/eye.webp",
				"character2": "Images/Characters/Game Host-normal.webp",
				"event": "none",
				"choices": []
			},
			{
				"branchId": "branch30",
				"text": "",
				"character1": "none",
				"character2": "none",
				"event": "triggerGame",
				"game": "MemoryGame",
				"choices": []
			},
			{
				"branchId": "branch31",
				"text": "<span class=\"characterName\">Game Host:</span> A sharp eye indeed... How about a wager: If you win, I’ll part with my most treasured possession. But if you lose... I’ll claim that exquisite instrument of yours. <br><span class=\"characterName\">Mthi:</span>And what exactly is this so-called treasured possession? <br><span class=\"characterName\">Game Host:</span>Oh, you’ll find out... once you’ve earned the right to see it. Now, shall we play?",
				"character1": "Images/eye.webp",
				"character2": "Images/Characters/Game Host-normal.webp",
				"event": "none",
				"choices": []
			},

			{
				"branchId": "branch32",
				"text": "With unshakable confidence, she accepts the challenge. <br><span class=\"characterName\">Mthi:</span> Uh-huh... might as well go fetch whatever treasure you're hiding now. <i>Her hand glides over the cards on the table, poised to win. </i>. <br>But something feels... off. Mthi’s hand pauses as she notices the cards shifting beneath her fingers. No matter how carefully she plays, the images twist and change as if refusing to pair with any match, slipping through her grasp with every attempt. It’s as if the deck itself is alive, mocking her skill with an eerie magic. <br> <span class=\"characterName\">Game Host:</span> Something wrong ?<br>A hand lands firmly on her shoulder, and suddenly, the world goes silent. The birds outside cease their song, the air stills, and everything around them freezes in time.<br><span class=\"characterName\">Tino:</span>Oh, look at that... He's cheating. <br><span class=\"characterName\">Mthi:</span>Not surprised. Animation magic — brings objects to life. Hold on. <i>She waves her hand across the cards, dismantling the illusion with a decisive sweep. The cards flicker, and a new power shimmers across the table. </i> <br><span class=\"characterName\">Tino:</span>Interesting choice of play.",
				"character1": "Images/eye.webp",
				"character2": "Images/timekeeper.webp",
				"event": "none",
				"choices": []
			},
			{
				"branchId": "branch33",
				"text": "",
				"character1": "Images/eye.webp",
				"character2": "Images/Characters/The Sixth Atlas.webp",
				"event": "triggerGame",
				"game": "MemoryGame-2",
				"choices": []
			},
			{
				"branchId": "branch34",
				"text": "As you lay down the final pair of cards with an effortless flourish, the Game Host's face twists in disbelief, his composure shattered. <br><span class=\"characterName\">Mthi:</span> And done. <br><span class=\"characterName\">Game host:</span> But—no, that’s impossible!. <i> Rage and confusion flicker in his eyes as he glares at the cards, each one mocking him with its defiance. </i> <br><span class=\"characterName\">Game Host:</span> You cheated! <br><span class=\"characterName\">Mthi:</span> Right, right... imagine having to rig your own game and still losing. <br><span class=\"characterName\">Game Host:</span> You—cheater! <i>  He lunges, fist raised, but Mthi sidesteps effortlessly, his punch landing squarely on an unsuspecting bystander.</i> <br><span class=\"characterName\">Mthi:</span> So much for subtle exits. <br>Just then, Llewellyn strolls in, late as ever, with his usual nonchalant grin. <br><span class=\"characterName\">Llewellyn:</span> Hello humans - Huh? <br> His words hang unfinished as another bystander charges at him, shouting in fury. In an instant, chaos erupts, and the group braces themselves for the impending brawl.",
				"character1": "Images/eye.webp",
				"character2": "Images/Characters/Game Host-normal.webp",
				"event": "none",
				"choices": []
			},
			{
				"branchId": "branch35",
				"text": ".",
				"character1": "none",
				"character2": "none",
				"event": "stopMusic",
				"choices": []
			},
			{
				"branchId": "branch36",
				"text": "",
				"character1": "none",
				"character2": "none",
				"event": "playMusic",
				"music": "BloomhavenFightMusic",
				"choices": []
			},
			{
				"branchId": "branch37",
				"text": "",
				"character1": "none",
				"character2": "none",
				"event": "triggerBattle",
				"winnable": true,
				"startEnemies": [1],
				"spawnEnemies": [],
				"choices": []
			},
			{
				"branchId": "branch38",
				"text": "Following the chaotic burst of action, the inn is ablaze with shouts and overturned tables as fists fly and drinks spill. The Game Host, now seething and vengeful, grabs a nearby chair, swinging it in Mthi’s direction. She ducks just in time, but not before another bystander takes the hit, adding to the pandemonium.As the group grapples with the chaos, the Game Host, now humiliated and vengeful, grabs a knife from a nearby table, sneering at Mthi. His eyes are filled with murderous intent, and he lunges toward her with reckless abandon. The group finds themselves at a critical choice, each path leading to a different outcome.",
				"character1": "Images/eye.webp",
				"character2": "Images/Characters/Game Host-normal.webp",
				"event": "none",
				"choices": [
					{
						"choiceId": "0",
						"option": "Let him live",
						"outcome": "Mthi disarms the Game Host with a swift move, knocking the knife from his hand and forcing him to the ground. She looks down, calm but resolute. <br> <span class=\"characterName\">Mthi:</span> This isn't worth anyone’s life. Take this as a warning. <br> The Game Host stumbles back, humiliated and resentful, but alive. He sneers, vowing that Mthi and her group will pay for this insult, hinting at potential consequences down the line...",
						"character1": "Images/eye.webp",
						"character2": "Images/Characters/Game Host-normal.webp",
						"event": "none"
					},
					{
						"choiceId": "1",
						"option": "Strike the final blow",
						"outcome": "Mthi pauses, taking in the desperation in the Game Host’s eyes. But this isn’t a look of regret or shame—only raw terror as he realizes his gamble has failed. Llewellyn steps forward, casting a glance at Mthi, whose expression is unreadable. Slowly, she nods, giving silent permission. Llewellyn raises his sword, and the Game Host’s face twists in silent protest, his voice catching as he whispers, <i>Please…</i> before the blade falls, ending him.",
						"character1": "Images/eye.webp",
						"character2": "Images/Characters/Game Host-normal.webp",
						"event": "none"
					}
				]
			},
			{
				"branchId": "branch39",
				"text": ".",
				"character1": "none",
				"character2": "none",
				"event": "stopMusic",
				"choices": []
			},
			{
				"branchId": "branch40",
				"text": "As the dust settles from the chaotic scuffle, the atmosphere in Bloomhaven turns tense. Lily, the innkeeper, stands behind the counter, arms crossed and a frown etched across her face. <br><span class=\"characterName\">Lily:</span> Enough! <i>  she exclaims, her voice cutting through the remnants of the brawl.</i> <br> <span class=\"characterName\">Lily:</span>I won’t have this ruckus in my inn. <br>The Group, still catching their breath from the unexpected fight, exchange glances, feeling the weight of her disappointment. <br>Lily continues, her irritation palpable.<br> <span class=\"characterName\">Lily:</span> You’ve disturbed my guests and wrecked my establishment. I can’t afford to have troublemakers like you here. It’s time for you to leave! <br>With a resigned nod, Mthi steps forward, attempting to diffuse the situation. <br><span class=\"characterName\">Mthi:</span> We didn’t mean to cause a scene, Lily. We were just— <br><span class=\"characterName\">Lily:</span>Just what? <i> She interrupts, her eyes narrowing</i>. Just playing games while destroying my peaceful haven? This isn’t a tavern for drunken brawls; it’s a place of respite. <br> The group’s morale dips as they realize their actions have consequences. They gather their belongings and shuffle toward the exit, feeling the weight of Lily’s anger.",
				"character1": "all",
				"character2": "Images/Characters/Lily.webp",
				"event": "none",
				"choices": []
			},
			{
				"branchId": "branch41",
				"text": "",
				"character1": "",
				"character2": "",
				"event": "changeScene",
				"background": "Outside Bloomhaven",
				"choices": []
			},
			{
				"branchId": "branch42",
				"text": "",
				"character1": "all",
				"character2": "none",
				"event": "skipChoices",
				"choices": [
					{
						"choiceId": "0",
						"option": "",
						"outcome": " The Atlas Six find themselves standing outside Bloomhaven in the cool night air, the door firmly closed behind them. The muffled sounds of laughter and conversation continue within, but they’re no longer welcome in the inn. The group exchanges a few uneasy glances, unsure of their next move. <br> <span class=\"characterName\">Mthi:</span> Well, that went well. <i>she says, brushing off a stray leaf from her cloak.</i><br> <i>Llewellyn shrugs, unfazed.</i> <br> <span class=\"characterName\">Llewellyn:</span>Can’t say it was unexpected. <br> <span class=\"characterName\">Tino:</span> Yeeaaa.. that was fun. <br> Jasmin, ever the voice of compassion, places a hand on Mthi's shoulder. <br> <span class=\"characterName\">Jasmin:</span> Violence isn’t always the answer. Sometimes mercy is the stronger path. <br> <span class=\"characterName\">Llewellyn:</span> Either way, we’re not welcome here anymore. We need to put some distance between us and Bloomhaven. <br> <i>He gestures toward the nearby forest, where the trees stand tall and dark, offering a concealed path away from Aurelia.</i> ",
						"character1": "all",
						"character2": "none",
						"event": "none"
					},
					{
						"choiceId": "1",
						"option": "",
						"outcome": "As the Atlas Six gather outside Bloomhaven, the air is heavy with tension and a mix of guilt and anger. The night feels colder, and the distant lights of the town seem to mock their predicament. Mthi tightens her cloak, her eyes scanning their surroundings, alert for any signs of pursuit. The group stands in silence for a moment, each processing the weight of what they’ve just done. <br> Suddenly, Llewellyn breaks the silence, his voice strained. <br> <span class=\"characterName\">Llewellyn:</span> We had no choice. He forced our hand. <br> <span class=\"characterName\">Jasmin:</span> We’ll need to lie low for now. The townsfolk… they may not understand what we did or why. <br> <span class=\"characterName\">Mthi:</span> Let's get going. The less attention we draw, the better. <br> She glances toward the woods on the edge of town, where the shadows seem to promise safety.",
						"character1": "all",
						"character2": "none",
						"event": "none"
					}
				]
			},
			{
				"branchId": "branch43",
				"text": "The party agrees to venture into the forest, seeking a temporary camp where they can regroup and plan their next move. As they fade into the darkness, the reality of their decision settles over them, binding them even closer, for better or for worse.",
				"character1": "all",
				"character2": "none",
				"event": "none",
				"choices": []
			},
			{
				"branchId": "branch44",
				"text": "",
				"character1": "none",
				"character2": "none",
				"event": "changeScene",
				"background": "Goblin forest",
				"choices": []
			},

			{
				"branchId": "branch45",
				"text": "<span class=\"characterName\">Tino:</span> Why are we in a creepy dark forest at night again ? Seems like we are just asking to be killed at this point. <br><span class=\"characterName\">Zanele:</span> You're not afraid aren't you Tino? Who knows what we will encounter... <br> <span class=\"characterName\">Mthi:</span> I agree with Tino, maybe we can try a different inn... Aurelia is big. <br> <span class=\"characterName\">Llewellyn:</span> Word spreads like wildfire unfortunately, We best lay low for now.",
				"character1": "all",
				"character2": "none",
				"event": "none",
				"choices": []
			},
			{
				"branchId": "branch46",
				"text": "<span class=\"characterName\">Jasmin:</span> This forest ... it may be our only shelter, but it feels like something’s lurking.<br><span class=\"characterName\">Llewellyn:</span> We don’t have many options. It’ll keep us hidden, at least.<br><span class=\"characterName\">Tino:</span> Doesn’t exactly feel cozy.<br> As they press deeper into the forest’s shadows, Tino feels a light tap on his shoulder.<br><span class=\"characterName\">Tino:</span> <i>Zee, now’s really not the time.</i> <br> He glances back toward Zanele.<br><span class=\"characterName\">Zanele:</span> Huh? I didn’t do anything.<br>Llewellyn suddenly feels something brush against his leg, and a dark figure slips away into the trees.<br><span class=\"characterName\">Llewellyn:</span> Um, guys ... I don’t think we’re alone here.<br>The surrounding leaves rustle, shadows twist, and the grass stirs as if alive.<br><span class=\"characterName\">Mthi:</span> Everyone, stay sharp.",
				"character1": "all",
				"character2": "none",
				"event": "none",
				"choices": []
			},
			{
				"branchId": "branch47",
				"text": "",
				"character1": "none",
				"character2": "none",
				"event": "playMusic",
				"music": "Goblin Encounter",
				"choices": []
			},
			{
				"branchId": "branch48",
				"text": "As goblins close in on the Atlas Six, you stand side by side with your companions, preparing to hold your ground.<br> Objective: Work with the team to defeat as many goblins as possible within the time limit. Reach enough points to secure a win and protect everyone from the horde. <br> Gameplay: Every goblin you take down adds points, but be careful: the goblins use green bombs scattered throughout the chaos, and hitting one will cost you. <br> Keep your accuracy sharp to avoid losing valuable points. <br> Mechanics: Hold down your left mouse button to slice through goblins with precision. The more goblins you strike, the closer you bring the group to victory. Good luck! The Atlas Six are counting on your skill to survive this onslaught! ",
				"character1": "none",
				"character2": "none",
				"event": "none",
				"choices": []
			},
			{
				"branchId": "branch49",
				"text": "",
				"character1": "none",
				"character2": "none",
				"event": "triggerGame",
				"game": "GoblinSlayer",
				"choices": []
			},
			{
				"branchId": "branch50",
				"text": "The battlefield settles for just a moment, and the group stands amid the aftermath of their victory. Tino’s sword gleams, streaked with dark goblin blood, and he gives Zanele a triumphant grin. <br> Zanele brushes a strand of hair from her face, her chains still crackling with residual energy. Mthi’s bow is lowered but ready, her sharp eyes scanning the shadows. <br>Just as a faint sigh of relief begins to escape, a low growl ripples through the forest. Rustling sounds echo from all around, followed by the unmistakable, guttural snarls of goblins hungry for vengeance. From the shadows, a fresh wave of goblins emerges, twice as many as before, their eyes gleaming with feral determination.",
				"character1": "all",
				"character2": "none",
				"event": "none",
				"choices": []
			},
			{
				"branchId": "branch51",
				"text": "Without missing a beat, Jasmin raises her hands, calling upon a shimmering shield of healing energy around her companions. Zanele’s chains pulse with a fiery glow, her focus sharp as she mutters an incantation, setting the ground alight with searing embers around the approaching goblins. <br> Mthi, with deadly precision, releases a rapid volley of arrows, each one finding its mark as goblins drop from the trees like broken puppet. <br>Llewellyn drives his blade into the earth with a thunderous crash, sending a shockwave that stuns a cluster of goblins. In one swift, fierce sweep, he cuts them down, his blade slicing through the air with lethal precision.<br><span class=\"characterName\">Jasmin:</span> They won't stop. <br><span class=\"characterName\">Llewellyn:</span> More target practice for us.",
				"character1": "all",
				"character2": "none",
				"event": "none",
				"choices": []
			},
			{
				"branchId": "branch52",
				"text": "",
				"character1": "none",
				"character2": "none",
				"event": "triggerBattle",
				"winnable": true,
				"startEnemies": [2, 3, 4, 5, 6],
				"spawnEnemies": [],
				"choices": []
			},
			{
				"branchId": "branch53",
				"text": ".",
				"character1": "none",
				"character2": "none",
				"event": "stopMusic",
				"choices": []
			},
			{
				"branchId": "branch54",
				"text": " The group, weary and bruised from battle, trudges deeper into the forest. Shadows grow longer as twilight settles, and they come upon a spacious clearing carpeted with soft moss and encircled by towering oaks and whispering pines.",
				"character1": "all",
				"character2": "none",
				"event": "none",
				"choices": []
			},
			{
				"branchId": "branch55",
				"text": "",
				"character1": "none",
				"character2": "none",
				"event": "changeScene",
				"background": "forest campsite",
				"choices": []
			},
			{
				"branchId": "branch56",
				"text": "The scent of damp earth and pine needles hangs in the air, providing a strange sense of comfort amid the fading light. <br><span class=\"characterName\">Zanele:</span> Alright, let’s set up here. <br>  Zanele declares, her voice steady yet softened by fatigue. She assigns tasks: Mthi and Jasmin are to gather herbs,fibers and fruit, while Llewellyn and Tino collect firewood and materials to build a shelter. <br><span class=\"characterName\">Zanele:</span> I'll set up a defensive spell, safe point,  and keep watch. <br> The group accepts their respective tasks and begin preparing for the night ahead.",
				"character1": "all",
				"character2": "none",
				"event": "none",
				"choices": []
			},
			{
				"branchId": "branch57",
				"text": "",
				"character1": "none",
				"character2": "none",
				"event": "changeScene",
				"background": "picking forest",
				"choices": []
			},

			{
				"branchId": "branch58",
				"text": "<span class=\"characterName\">Jasmin:</span> Looks like it’s just us, Mthi. Let’s see what we can find.<br> They move quietly through the forest, the soft crackling of leaves underfoot as they pick their way through patches of herbs and low-hanging fruits. Jasmin’s eyes roam over the foliage, keenly spotting bright clusters of berries hidden among the leaves. <br><span class=\"characterName\">Mthi:</span> You always seem to know exactly what to look for, Jas. <br><span class=\"characterName\">Jasmin:</span> Comes with the job. Healer’s instinct, you know? And there’s something calming about it - being that helping hand in difficult situations. Just as your music puts us at ease <i> she playfully nudges Mthi </i>. <br><span class=\"characterName\">Mthi:</span> Thank you <i>she struggles not to smile shyly </i>. It’s beautiful how the moon filters down like this, isn’t it? Almost like the forest is alive with secrets. <br> They both stop, momentarily lost in the stillness of the night, their eyes drawn to the 3 moons hanging high above. The silver light casts a soft glow over the forest, illuminating the leaves and bathing the world in a tranquil silence.",
				"character1": "Images/healer.webp",
				"character2": "Images/eye.webp",
				"event": "none",
				"choices": []
			},
			{
				"branchId": "branch59",
				"text": "<span class=\"characterName\">Jasmin:</span> It really is. <br><span class=\"characterName\">Mthi:</span It reminds me of home. The wind, the animals , the silence, brings back memories of the hunt. Especially nights like these, they always feel familiar.<br> <i>She bends down to examine some dark green leaves hidden in the underbrush.</i> <br><span class=\"characterName\">Jasmin:</span> What is it? <br><span class=\"characterName\">Mthi:</span> These herbs - Moonshade and Fernshade. Moonshade works for quick mana recovery, Fernshade on the other hand can help replenish stamina. Which one do you think we should take? <br><span class=\"characterName\">Jasmin:</span> And we can't take both. I remember from my potion classes that these two don’t mix well -in fact, combined, they’re actually... poisonous.. <br><span class=\"characterName\">Mthi:</span> And we’ll need a good amount of one or the other to fully restore our mana or stamina.",
				"character1": "Images/healer.webp",
				"character2": "Images/eye.webp",
				"event": "none",
				"choices": []
			},
			{
				"branchId": "branch60",
				"text": "",
				"character1": "none",
				"character2": "none",
				"event": "visualChoices",
				"choices": [
					{
						"choiceId": "0",
						"imgSrc": "Images/moonshade.webp",
						"outcome": "Examining the plants in her hand, Jasmin frowns thoughtfully. <br><span class=\"characterName\">Jasmin:</span> We might need our magic more than anything else right now. Stamina’s good, but without mana, we’re defenseless.<br> Mthi nods in agreement, her gaze drifting over the glimmering blue ocean of the moonshade. <span class=\"characterName\">Mthi:</span> Mhm. And moonshade’s potency is just what we need to restore mana. If we bring enough of this back, it’ll give us an edge. <br><span class=\"characterName\">Jasmin:</span> Zanele’s probably expecting us to make the right call here. She looked ready to take on the world when we left. <br><span class=\"characterName\">Mthi:</span> I'm sure she’ll approve of this. Moonshade isn’t easy to find, but it’s worth it. <br> As they carefully gather the delicate, glowing leaves, the forest wraps them in a blanket of silence. The faint blue light of the moonshade reflects in their eyes, casting an fluorescent glow around them.",
						"option": "Moonshade",
						"character1": "Images/healer.webp",
						"character2": "Images/eye.webp",
						"gradient": " linear-gradient(90deg, hsla(159, 82%, 55%, 1) 0%, hsla(206, 98%, 48%, 1) 100%)",
						"event": "none"
					},
					{
						"choiceId": "1",
						"imgSrc": "Images/Fernshade.webp",
						"outcome": "<span class=\"characterName\">Mthi:</span> Hmmm, let's go with stamina.<br><span class=\"characterName\">Jasmin:</span> Agreed. It might not be as dazzling as moonshade, but it’s just as vital - especially if we need to keep our strength up. With Zanele putting us on herb duty, we’d better be ready for anything.<br><span class=\"characterName\">Mthi:</span> Exactly and if needed, atleast we will be able to run, although I would rather fight. <br><span class=\"characterName\">Jasmin:</span> You're always the first one to run, I will do it if push comes to shove but that's a last resort. <br> The two of them begin harvesting the Fernshade carefully, filling their pouches with the vibrant green leaves that seem to hum with earthy energy. <br><span class=\"characterName\">Mthi:</span> Speaking of running, race you to Zanele - <br> Mthi darts ahead with a burst of speed, her steps light and precise as she weaves through the underbrush. She nimbly dodges low-hanging branches and leaps over fallen logs with practiced grace, her movements so fluid it’s as though she’s gliding through the forest. Each stride is swift yet silent, her form barely a whisper. <br><span class=\"characterName\">Jasmin:</span>  Hey! ... wait Mthi, don't leave me here alone.",
						"option": "Fernshade",
						"character1": "Images/healer.webp",
						"character2": "Images/eye.webp",
						"gradient": "linear-gradient(90deg, hsla(0, 0%, 5%, 1) 0%, hsla(126, 82%, 33%, 1) 100%)",
						"event": "none"
					}
				]
			},
			{
				"branchId": "branch61",
				"text": "The forest hums with a quiet vigor, its massive trees stretching skyward, their silhouettes stretching long and dark under the pale moonlight. Tendrils of mist drift close to the ground, curling around knotted roots and thick ferns, obscuring the forest’s hidden mysteries. The silence is punctuated by soft rustling as nocturnal creatures move, their eyes catching light like tiny, scattered stars amid the foliage. Overhead, the leaves murmur in response to the light breeze, while the air hangs heavy with the rich, damp scent of moss and earth.",
				"character1": "none",
				"character2": "none",
				"event": "none",
				"choices": []
			},
			{
				"branchId": "branch62",
				"text": "",
				"character1": "none",
				"character2": "none",
				"event": "changeScene",
				"background": "fighting forest",
				"choices": []
			},
			{
				"branchId": "branch64",
				"text": "<span class=\"characterName\">Tino:</span> So then she says, <i> \"Only someone truly daring could handle this\"...</i> staring straight at me with those fiery eyes. <br><span class=\"characterName\">Llewellyn:</span> Sooo, did you handle it? <br><span class=\"characterName\">Tino:</span> It was such a mess, I got soaked.<br><span class=\"characterName\">Llewellyn:</span> Yea but Did you Handle it though ?<br><span class=\"characterName\">Tino:</span> The Hydra? Nah, I left, not because I wasn’t up for it — but because... <i> He grabs a solid, rugged branch, its bark still fresh and damp from the night’s dew, perfect for stoking a strong fire.</i> <br><span class=\"characterName\">Llewellyn:</span> Because...? <br><span class=\"characterName\">Tino:</span> Because I was halfway across the kingdom on a very important errand, and the royal guard had already arrived. No point in stepping into a mess like that. It's diffucult fighting a water type without a fire type. <br><span class=\"characterName\">Llewellyn:</span> Right <i>and</i> also it resembling a snake. <br>Llewellyn finishes chopping the branches and starts securing them to his back.<br><span class=\"characterName\">Tino:</span> That as well. <br> They both laugh then continue to gather materials throughout the forest's domain.",
				"character1": "Images/timekeeper.webp",
				"character2": "Images/titan.webp",
				"event": "none",
				"choices": []
			},
			{
				"branchId": "branch65",
				"text": "Under the cold moonlight, the clearing buzzed with tension. A black bear, its fur dark as night and eyes glowing a deep brown, stood its ground, claws scraping the earth. Its orange magic flickered around it, crackling with raw power. Across from it, a black wolf—sleek, agile, and with eyes gleaming green—shifted low to the ground, its fur shimmering with an ethereal green glow. The air hummed with their magic, the forest holding its breath. <br><span class=\"characterName\">Tino:</span> What do we have here? <br><span class=\"characterName\">Llewellyn:</span> Seems like we've got a show, you can have first pick: Whoever loses has do to <i>the thing</i>. <br> Llewellyn looks at Tino awaiting his response to the bet. <br><span class=\"characterName\">Tino:</span> You still remember that ? Well we both know what the obvious choice is here but just to be different I'll go with...",
				"character1": "Images/Characters/Bear.webp",
				"character2": "Images/Characters/Wolf.webp",
				"event": "none",
				"choices": []
			},
			{
				"branchId": "branch66",
				"text": "",
				"character1": "none",
				"character2": "none",
				"event": "visualChoices",
				"choices": [
					{
						"choiceId": "0",
						"imgSrc": "Images/Characters/Bear.webp",
						"outcome": "<span class=\"characterName\">Tino:</span> I'm betting on the wolf, speed won't fail. <br><span class=\"characterName\">Llewellyn:</span> I wouldn’t be so sure. The bear’s got the power to crush anything in its path. The wolf leaps forward with a burst of green light, its speed like a blur as it hurls thorns towards the bear, a magical storm of green spikes. The bear grunts, its orange magic exploding around it as it slams into the ground, sending the thorns scattering. The bear’s eyes burn with rage, and it swipes out with massive claws, cutting through the air like deadly weapons. <br> The wolf dodges with grace, twisting in the air, but the bear follows, closing the distance with terrifying speed. It slams its paw down, sending shockwaves through the ground. The wolf, agile as ever, twists away just in time, but the bear’s magic surges with power, enveloping the wolf in a fiery embrace. <br><span class=\"characterName\">Tino:</span> Come on wolf... <br> The bear is relentless. Its claws tear through the air, striking with pinpoint precision. The wolf scrambles to keep up, using its green magic to deflect the bear’s strikes, but the power behind each blow from the bear sends shockwaves through the air. <br>The bear swipes again, catching the wolf off guard. With a final roar, the bear launches the wolf into the air with a massive burst of orange energy, sending the wolf crashing into the ground. The wolf groans, its green magic flickering weakly before finally fading. <br><span class=\"characterName\">Llewellyn:</span> Told you, strength wins everytime. <br><span class=\"characterName\">Tino:</span> No suprise to that in this case, next time, I'm betting on that bear. <br><span class=\"characterName\">Llewellyn:</span> That's more like it, now don't forget our bet. <br><span class=\"characterName\">Tino:</span> Yea yea, I'll do it, let's just take these back.",
						"option": "Bear",
						"character1": "Images/Characters/Bear.webp",
						"character2": "Images/Characters/Wolf.webp",
						"gradient": "linear-gradient(90deg, hsla(0, 0%, 0%, 1) 0%, hsla(11, 80%, 57%, 1) 100%)",
						"event": "none"
					},
					{
						"choiceId": "1",
						"imgSrc": "Images/Characters/Wolf.webp",
						"outcome": "<span class=\"characterName\">Tino:</span> I'm going with the wolf, something about speed that sits right with me. <br><span class=\"characterName\"> Llewellyn:</span> You don't say ? Well only makes sense I take strength then. <br> The wolf launches forward, a blur of green, and with a flash of magic, it summons a whirlwind of thorns, spiraling toward the bear. The bear counters with a shockwave of orange magic, slamming into the earth with explosive force, sending the thorns scattering. The wolf dodges, rolling under the bear’s swipe, its green magic pulsing as it creates a barrier of swirling energy to deflect the bear’s fiery assault. <br><span class=\"characterName\">Tino:</span> That's crazy speed right? <br><span class=\"characterName\">Llewellyn:</span> Yup but the fight has just begun. The bear roars, sending out a wave of fiery orange force, surging toward the wolf. But the wolf darts to the side, just out of reach, and strikes back with a devastating blast of green magic, freezing the air in front of it. The wolf’s jaws snap shut, aimed at the bear’s throat. For a moment, it looks like the wolf will win, but the bear, with a brutal swing, swipes the wolf’s magic aside and lands a crushing blow. The wolf staggers, but its pack emerges, shifting the momentum. With a final, explosive burst of green energy, the wolf forces the bear to retreat, its magic overwhelming the bear’s defenses. <br><span class=\"characterName\">Tino:</span> Interesting turn of events. <br><span class=\"characterName\">Llewellyn:</span> You got lucky. The wolf’s agility saved it this time. <i> Llewellyn chuckles </i>, Guess I'll have to do it then.<br><span class=\"characterName\">Tino:</span> Fear not <i>Your royal highess </i>: You still remain the strongest in all the kingdoms. <br><span class=\"characterName\">Llewellyn:</span> Ah, your confidence in me is truly humbling, <i>Sensei.</i>",
						"option": "Wolf",
						"character1": "Images/Characters/Bear.webp",
						"character2": "Images/Characters/Wolf.webp",
						"gradient": "linear-gradient(90deg, hsla(0, 0%, 5%, 1) 0%, hsla(126, 82%, 33%, 1) 100%)",
						"event": "none"
					}
				]
			},
			{
				"branchId": "branch67",
				"text": "Llewellyn and Tino make their way back through the forest, the tension from the earlier spectacle lingering faintly in the air. The distant crackle of twigs keeps them alert, their hands instinctively brushing their weapons.",
				"character1": "Images/timekeeper.webp",
				"character2": "Images/titan.webp",
				"event": "none",
				"choices": []
			},
			{
				"branchId": "branch68",
				"text": "",
				"character1": "none",
				"character2": "none",
				"event": "changeScene",
				"background": "picking forest",
				"choices": []
			},
			{
				"branchId": "branch69",
				"text": "Suddenly, a rustling ahead stops them in their tracks. Two figures dart between the trees, their movements quick and chaotic. <br><span class=\"characterName\">Tino:</span> Hasn't enough happended today already ? <br>Tino sighs with a hint of annoyance <br><span class=\"characterName\">Llewellyn:</span> I guess not. Whatever they are... they are <i>definitely small</i>. <br><span class=\"characterName\">Tino:</span> Please not more goblins, they are so difficult to hit. <br><span class=\"characterName\">Llewellyn:</span> Hopefully not. We're a lot slower right now since we are carrying these, if we don't react quickly it could end badly. <br> You decide to:",
				"character1": "Images/timekeeper.webp",
				"character2": "Images/titan.webp",
				"event": "none",
				"choices": []
			},
			{
				"branchId": "branch70",
				"text": "",
				"character1": "Images/timekeeper.webp",
				"character2": "Images/titan.webp",
				"event": "visualChoices",
				"choices": [
					{
						"choiceId": "0",
						"imgSrc": "Images/Choices/Act swiftly.webp",
						"option": "Act swiftly",
						"outcome": "The shapes emerge from the undergrowth, moving with surprising speed. Instinct takes over as Llewellyn’s sword arcs out, his stance grounded like a fortress. Tino, ever quicker, darts forward, closing the distance in a blur. In a single fluid motion, he drives one of the figures to the ground. <br><span class=\"characterName\">Tino:</span> Mthi !? <br> Tino blurts out, realizing who he’s tackled. Mthi scowls up at him, clutching a bundle of brightly coloured plants, her bow askew on her shoulder. <br><span class=\"characterName\">Mthi:</span> Heyyyyyyyyyy... please get off me. <br> Llewellyn halts his blade in a heartbeat, the weapon slicing through the air with precision, stopping mere inches from Jasmin. The edge hums with restrained power, shimmering in the faint light, as if the very air trembles in its wake. <br><span class=\"characterName\">Jasmin:</span> Hey, rude! <br> They realize the consequences of their impulsive actions. <br><span class=\"characterName\">Llewellyn:</span> Oh sorry girls, we thought you were goblins - <br> Both Jasmin and Mthi look at each other in disbelief.<br><span class=\"characterName\">Jasmin:</span> Rude. <br><span class=\"characterName\"> Llewellyn:</span> Not like that, you looked like goblins - <br><span class=\"characterName\">Tino:</span> Hehe. <br> Mthi pushes Tino aside, brushing off the dust clinging to her clothes before inspecting the herbs with a sharp, critical eye.",
						"character1": "Images/healer.webp",
						"character2": "Images/eye.webp",
						"gradient": " linear-gradient(orange,red, orange)",
						"event": "none"
					},
					{
						"choiceId": "1",
						"imgSrc": "Images/Choices/Do nothing.webp",
						"option": "Do nothing",
						"outcome": "Without a word, they exchange a knowing glance and remain rooted where they stand, their weapons untouched. Moments later, Mthi and Jasmin burst into view - Mthi clutching a vibrant bundle of herbs, her bow bouncing haphazardly against her back, and Jasmin trailing close behind, cheeks flushed and her weariness evident. <br><span class=\"characterName\">Llewellyn:</span> Ladies, we were expecting you. <br><span class=\"characterName\">Tino:</span>You two seem like you’ve had quite the adventure. <br><span class=\"characterName\">Jasmin:</span> If you can call it that <i> she looks at Mthi </i> please never do that again. <br><span class=\"characterName\">Mthi:</span> I don't even know why I did. <br> She also breathes heavily, exhaustion evident on her face. <br><span class=\"characterName\">Jasmin:</span> Never again.",
						"character1": "Images/healer.webp",
						"character2": "Images/eye.webp",
						"gradient": "linear-gradient(black, red)",
						"event": "none"
					}
				]
			},
			{
				"branchId": "branch71",
				"text": "<span class=\"characterName\">Llewellyn:</span> Were you two running from something? <br><span class=\"characterName\">Mthi:</span> Only from the wrath of that squirrel, <i> Mthi replies, gesturing toward the treetops with mock seriousness. </i> <br><span class=\"characterName\">Mthi:</span> It wasn’t happy we borrowed its stash. <br> Jasmin joins in on their inside joke <br><span class=\"characterName\">Jasmin:</span> She means she stole its entire hoard and taunted it. <br><span class=\"characterName\">Tino:</span> You had us thinking it was something serious. Like, I don’t know, another magical fight to bet on. <br> Conversations continue to fill the night air as the group starts walking back to Zanele.",
				"character1": "Images/timekeeper.webp",
				"character2": "Images/titan.webp",
				"event": "none",
				"choices": []
			},
			{
				"branchId": "branch72",
				"text": "",
				"character1": "",
				"character2": "",
				"event": "changeScene",
				"background": "forest campsite",
				"choices": []
			},
			{
				"branchId": "branch73",
				"text": "You arrive back at the forest campsite. Zanele has set up a potent fire spell that will incinerate anyone who doesn’t bear the name inscribed on the inner palm of her hand. The fire barrier crackles with an intense, fiery glow, casting an amber hue over the campsite. The heat radiates from the flames, yet the sight is mesmerizing. The intricate patterns of Kurohana fire magic weave through the air, a symphony of colour and energy. Everything about it speaks of power and grace—just like the people from the mountain kingdom. The towering, ornate structures of Kurohana, with their flame-etched roofs and red-hued stone, seem almost like an extension of the very fire that powers them. Zanele stands tall at the heart of it all, her aura as commanding as the flames she controls.",
				"character1": "all",
				"character2": "Images/Scenes/Orb - Forest Campsite.webp",
				"event": "none",
				"choices": []
			},
			{
				"branchId": "branch74",
				"text": "<span class=\"characterName\">Passion:</span> Me Again, sorry to interrupt (not reallly). You've reached a safe point, indicated by that orb over there on the right. Home is where your heart is and for the Atlas Six, as much as everyone has a physical place to stay, they prefer to be together while navigating the Known World. This home along with other safe points acts as a place of respite, offering you the ability to talk to your friends along with other activities depending on the story point and decisions you have made thus far. Each orb throughout the world is different though, some such as this one require you to have defensive measures in place (Yes yes, you are inside the orb) others allow you to do other things. The orb is a marvel of magical design, seamlessly blending practicality with enchantment. Inside, you'll find ethereal furniture that shifts to fit the needs of its occupants—cushioned seating that molds to your shape and tables that levitate slightly above the ground. There are serene, softly glowing bedrooms with bedspreads woven from shimmering threads that adjust to the perfect temperature. The bathrooms are equally enchanted, with showers of warm, mist-like water that cleanse without a trace. It’s a mobile sanctuary, offering the comforts of home no matter where the journey leads.This does not limit you though from living in the physical world, such as the inn that you were in earlier, see what I did there? , by the way: what was the name of that said inn ? Get it right and I'll reward you, wrong and ... you restart the game 😉.",
				"character1": "Images/timekeeper.webp",
				"character2": "Images/Scenes/Orb - Forest Campsite.webp",
				"event": "none",
				"choices": [
					{
						"choiceId": "0",
						"option": "Aurelia",
						"outcome": "Partly correct? Actually no, unfortunately for you that's wrong. Listen: Aurelia is one of the 5 kingdoms of the Known World. Mostly quiet but the kingdom and her kinfolk do have their fair share of problems, don't we all ? Anyway The inn is called Bloomhaven but I'll let you off the hook for now.",
						"character1": "Images/timekeeper.webp",
						"character2": "Images/Scenes/Orb - Forest Campsite.webp",
						"event": "none"
					},
					{
						"choiceId": "1",
						"option": "Bloomhaven",
						"outcome": "And that my friend is correct :) . This is why you are my favourite one, don't tell the others though. Anyway, <i> something awaits you </i> upon the path you walk right now, continue the story to claim it - oh and you're welcome.",
						"character1": "Images/timekeeper.webp",
						"character2": "Images/Scenes/Orb - Forest Campsite.webp",
						"event": "none"
					},
					{
						"choiceId": "2",
						"option": "Eryndor",
						"outcome": "Uhm no, Bloomhaven, pay attention. Seems like the story is too easy for you currently so I'll have to amp up the diffuclty :) .... Anyway, no restarting , <i> for now </i>.",
						"character1": "Images/timekeeper.webp",
						"character2": "Images/Scenes/Orb - Forest Campsite.webp",
						"event": "none"
					},
					{
						"choiceId": "3",
						"option": "I don't know",
						"outcome": "<span class=\"characterName\">Passion:</span>What, you don't know? HeHe you're joking right....right? Well then. I might as well restart the game, matter of fact: Forget restarting, I might as well delete the game from your local files since you seem to not care much about the effort I put into project. The again, you are my favourite one out of the 4 so I will let you off the hook for now.",
						"character1": "Images/timekeeper.webp",
						"character2": "Images/Scenes/Orb - Forest Campsite.webp",
						"event": "none"
					}
				]
			},
			{
				"branchId": "branch75",
				"text": "<span class=\"characterName\">Zanele:</span> Finally, you guys are back. <br> Zanele takes your hand and pulls you into the orb. <br><span class=\"characterName\">Mthi:</span> I can sense you put a lot of enegry into this Zanele. <br><span class=\"characterName\">Zanele:</span> Of course I did. I don’t do things halfway. Besides, with the lot of you roaming about, I need to make sure we’re not ambushed again. <br> The orb’s fiery barrier pulses around you, its light casting warm shadows on the group. The air inside feels charged, almost alive with Zanele's fire magic.<br><span class=\"characterName\">Jasmin:</span> It’s beautiful, though. Trust Zanele to make protection look like an art piece.<br><span class=\"characterName\">Zanele:</span> <i> Ofcourse my dear</i>. <br><span class=\"characterName\">Llewellyn:</span> Appreciation’s nice and all, but how do we leave without torching ourselves? <br><span class=\"characterName\">Zanele:</span> Relax, Llewellyn. The barrier knows our names - we're free to enter and exit safely. I can also block the enterance thus nothing enters or exits completey.",
				"character1": "all",
				"character2": "Images/Scenes/Orb - Forest Campsite.webp",
				"event": "none",
				"choices": []
			},
			{
				"branchId": "branch76",
				"text": "<span class=\"characterName\">Tino:</span> Tino is such a <i> great name </i> though, needless to say that so many bear it. What if another Tino tries to enter? <br><span class=\"characterName\">Zanele:</span> Since it's on my hand, the barrier responds to my memories therefore only <i> our </i> Tino can enter. <br><span class=\"characterName\">Tino:</span> You honour me, <i>princess</i>. <br><span class=\"characterName\">Zanele:</span>  Just sit down before I erase your name from my palm. <br> Zanele fixes an unwavering gaze as she delivers the threat, her words firm and laced with undeniable truth.",
				"character1": "all",
				"character2": "Images/Scenes/Orb - Forest Campsite.webp",
				"event": "none",
				"choices": []
			},
			{
				"branchId": "branch77",
				"text": "The forest at night hums with life, a symphony of distant calls and rustling leaves blending into the backdrop. The magical orb encasing the campsite glows faintly, its fiery aura a stark contrast to the cool, dark expanse beyond. Outside, unseen animals chirp and chatter, their sounds weaving into the serenity of the evening.At the center, the campfire blazes with a steady, warm glow, its flickering flames casting dancing shadows on the group's faces. The light bathes them in an amber hue, softening their features and creating a sense of familiratiy.Zanele rests her head gently on Llewellyn's shoulder, her usual guarded demeanor softened by the moment. Across from them, Mthi and Jasmin sit back-to-back, their postures relaxed. Mthi absently twirls an arrow between her fingers, while Jasmin hums a quiet tune, her fingers brushing against the edges of her druidic charm. <br> The campsite now offers you the ability to interact with the group.",
				"character1": "all",
				"character2": "Images/Scenes/Orb - Forest Campsite.webp",
				"event": "none",
				"choices": []
			},
			{
				"branchId": "branch78",
				"text": "",
				"character1": "none",
				"character2": "none",
				"event": "visualChoices",
				"choices": [
					{
						"choiceId": "0",
						"option": "Jasmin",
						"outcome": "Near the campfire, Jasmin is tending to a small, injured bird she found during the day. Her healing aura shimmers faintly, blending with the golden hues of the firelight. She notices you watching and offers a soft smile.",
						"character1": "none",
						"character2": "Images/healer.webp",
						"imgSrc": "Images/healer.webp",
						"gradient": "linear-gradient(15deg, #142850, #14365f, #13476f, #125d80, #107792, #0d96a5, #09b8b4, #04ccb1)",
						"event": "none"
					},
					{
						"choiceId": "1",
						"option": "Llewellyn",
						"outcome": "You approach Llewellyn, who seems to be invested in stone skipping. His fingers brush the flat stones, and each one pulses with a faint glow. As he flicks his wrist, the stones don’t just skip—they glide across the water, suspended in midair for a brief moment before they break the silence. Each impact sends out ripples that spread across the pond like an echo.",
						"character1": "none",
						"character2": "Images/titan.webp",
						"imgSrc": "Images/titan.webp",
						"gradient": "radial-gradient(circle at 20% 0%, #ff8b17, #e6751f, #cc6021, #b24d22, #963b1f, #7b2b1c, #601d16, #45100e)",
						"event": "none"
					},
					{
						"choiceId": "2",
						"option": "Mthi",
						"outcome": "Mthi sits cross-legged near the crackling fire, her head tilted in concentration as her hand glides over a parchment. On the paper, notes and staves appear with a life of their own, shimmering faintly like moonlight on water. As her pen moves, the symbols pulse softly and resonate with delicate sounds—a gentle melody that seems to spill directly from her thoughts. Each note follows her hand like fireflies trailing a lantern, filling the air with an ethereal tune that harmonizes with the night's stillness. The firelight dances on her face, highlighting her small, knowing smirk as she catches you watching. <br><span class=\"characterName\">Mthi:</span> You didn’t think I’d write in silence, did you? <br><span class=\"characterName\"> You:</span> Till this day, I can't understand how you do <i>that</i>. <br><span class=\"characterName\">Mthi:</span> A bit of magic ... and a lot of skill.",
						"character1": "none",
						"character2": "Images/eye.webp",
						"imgSrc": "Images/eye.webp",
						"gradient": "linear-gradient(195deg, #ff00c3, #d123ba, #a42dab, #7b2f97, #552b80, #342465, #181a48, #050b2b)",
						"event": "none"
					},
					{
						"choiceId": "3",
						"option": "Tino",
						"outcome": "Tino moves like a restless phantom, his steps swift and deliberate, his form barely a blur against the moonlight. The wind seems to follow his every motion, swirling around him in soft yet insistent gusts. Leaves stir and lift into the air, dancing in intricate patterns that seem to ripple outward as if forming a shield, a boundary between him and the rest of the world.You call out, your voice hesitant but clear, 'Tino?' For a moment, he pauses, his head tilting slightly as if he heard you—but instead of turning, he picks up speed, his movements sharper. Determined to close the distance, you take a step forward, only to feel a sharp tug beneath your foot. A thorny branch catches your shoe, halting your advance. You glance down, relieved to see no harm done. When you look back up, Tino is gone. The leaves that once encircled him flutter harmlessly to the ground, and the wind that had seemed so alive moments ago fades into stillness. The clearing is silent, save for the faint rustle of the trees, as though he was never there at all.",
						"character1": "none",
						"character2": "Images/timekeeper.webp",
						"imgSrc": "Images/timekeeper.webp",
						"gradient": "linear-gradient(90deg, #dc781f, #b8860b, #8b4513)",
						"event": "none"
					},
					{
						"choiceId": "4",
						"option": "Zanele",
						"outcome": "<span class=\"characterName\">You:</span> Looks like you’re deep in thought. Planning something special for dinner? <br><span class=\"characterName\">Zanele:</span> Hmm, perhaps. A good meal isn’t just about feeding the body—it’s about feeding the soul too. <br>Zanele’s eyes scan through the assortment laid out before her. Small glass jars of colorful spices glint faintly in the firelight. She lifts one, uncorking it and letting a puff of fragrant cinnamon waft into the cool night air. Next to the spices lie a bundle of freshly picked vegetables—crisp carrots, onions, and leafy greens—alongside a woven basket containing grains, dried meats, and foraged herbs. A pouch of nuts and berries rests nearby, their vibrant colors a contrast to the muted earth tones of the campsite. <br><span class=\"characterName\">You:</span> That’s quite the spread. Got something specific in mind? <br><span class=\"characterName\">Zanele:</span> Oh, I’ve got ideas. A hearty stew, maybe? Or something simpler—a few roasted vegetables with a pinch of this spice here. <br>She gestures at a jar of bright red powder. <br><span class=\"characterName\">Zanele:</span> This one’s paprika. Perfect for adding a little heat. Or, if we’re in the mood for something sweet, we could mix these berries with some crushed nuts for dessert. <br><span class=\"characterName\">You:</span> So... what’s the verdict? <br><span class=\"characterName\">Zanele:</span> That’s the problem. Too many options, not enough decisiveness. Care to help me choose? Or are you just here to taste test? <br><span class=\"characterName\">Zanele:</span> Actually, before we decide... how about we talk about something else for a moment? Got any thoughts on how the group’s been doing lately? Or anything you’ve been wondering about the journey ahead? <br>",
						"character1": "none",
						"character2": "Images/phoenix.webp",
						"imgSrc": "Images/phoenix.webp",
						"gradient": "linear-gradient(45deg, #7d0928, #962521, #ad3e0f, #c15900, #d27500, #de9200, #e6b100, #e8d103)",
						"event": "none"
					},
					{
						"choiceId": "5",
						"option": "Continue the night",
						"outcome": "The others start gathering around the campfire, the warmth of the flames mixing with the evening air. Zanele stirs the stew, Mthi hums a soft tune, and the sounds of nature fill the night.<br><span class=\"characterName\">Llewellyn:</span> Where did Tino disappear off to?<br><span class=\"characterName\">Mthi:</span> <i>Chuckling lightly</i> You know how he is: always popping in and out of thin air. It’s probably best not to ask. <br><span class=\"characterName\">Zanele:</span> Glancing around I’d bet he’s just lurking in the shadows, watching us. Tino’s never far, just... in his own world.<br> Just as you think about questioning further, a sudden breeze sweeps through the camp, and Tino materializes out of nowhere, standing beside the fire with a grin.<br><span class=\"characterName\">Tino:</span> Did I miss anything? Smells like dinner's almost ready!<br><span class=\"characterName\">Jasmin:</span> <i>Sighing in amusement</i> How do you even do that? <br><span class=\"characterName\">Tino:</span> Oh, you know... hither and thither. A bit of this, a bit of that... time's a tricky thing to manage. <br><span class=\"characterName\">Zanele:</span> Hither and thither?That's your excuse? <br><span class=\"characterName\">Tino:</span> Works for me, doesn’t it? I’ve got places to be, <i>people to not meet</i>.<br><span class=\"characterName\">Jasmin:</span> Right... Well, I won’t ask any further. Probably better I don’t.<br><span class=\"characterName\">Tino:</span> Smart move. Now, who’s ready for some food?<br> Zanele smacks Tino's hand away before he can snatch himself a bowl.<br><span class=\"characterName\">Zanele:</span> - And no magic tricks around the stew, okay?<br><span class=\"characterName\">Tino:</span> Wouldn’t dream of it.<br> The group settles around the campfire, sharing the meal and chatting comfortably, the sounds of laughter and warmth surrounding you all.",
						"character1": "all",
						"character2": "none",
						"imgSrc": "Images/Choices/Continue the night.webp",
						"gradient": "linear-gradient(black, white)",
						"event": "none"
					}
				]
			},
			{
				"branchId": "branch79",
				"text": ">>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>Error - Broken ChoiceLoop<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<",
				"character1": "Images/timekeeper.webp",
				"character2": "Images/titan.webp",
				"event": "multipleChoices",
				"goToBranches": [81, 84, 87, 88, 90, 92],
				"choices": []
			},
			{
				"branchId": "branch80",
				"text": "You sit by her side and watch her work her magic. <br> <span class=\"characterName\"> You:</span> You have a way with animals Jas. <br><span class=\"characterName\">Jasmin:</span> They’ve always been drawn to me. I think it’s because I understand them better than people sometimes. <br><span class=\"characterName\">You:</span> More than us? <br><span class=\"characterName\">Jasmin:</span> You sound offended <i> she smirks at you, hinting a yes to that answer </i> No, definitely not more than you guys ofcourse. <br><span class=\"characterName\">You:</span> So how does it work, you know: Water magic. <br><span class=\"characterName\">Jasmin:</span> Water carries life. It flows, mends, and nurtures. Let me show you.",
				"character1": "none",
				"character2": "Images/healer.webp",
				"event": "none",
				"choices": [
					{
						"choiceId": "0",
						"option": "Sure",
						"outcome": "<span class=\"characterName\">Jasmin:</span> Hehe. <br> Jasmin kneels beside the tiny, trembling bird, its wing bent at an unnatural angle. The campfire casts flickering light across her serene expression as she cups her hands above the creature. A soft hum fills the air, a melody that seems to resonate with the forest itself. From her palms, tendrils of water emerge, glowing faintly with an ethereal blue hue. They weave like delicate threads, spiraling around the injured wing. The water pulses gently, like the heartbeat of a living thing, and with each pulse, the bird’s wing straightens, knitting itself back to wholeness.The sound is mesmerizing—soft trickles like a forest stream, punctuated by the faint hum of magic. The droplets shimmer, refracting the firelight into tiny rainbows, creating an sacred atmosphere. The bird twitches, letting out a faint chirp as it tests its newfound strength. Jasmin smiles, her eyes glowing with quiet satisfaction. <i>There you go</i> she whispers, her voice soft and warm, like a lullaby.",
						"character1": "none",
						"character2": "Images/healer.webp",
						"event": "none"
					},
					{
						"choiceId": "1",
						"option": "Nah, no thanks",
						"outcome": "<span class=\"characterName\">You:</span> Nah, you can keep the healing magic to yourself. As long as I live to see another battle. <br><span class=\"characterName\">Jasmin:</span> Right. Remind me to not heal you next time. <br> Jasmin’s gaze softens, but her eyes narrow with a quiet frustration. Her lips press together, and the disappointment in her expression is unmistakable, as if the weight of your actions has momentarily dimmed her usual joyfulness.",
						"character1": "none",
						"character2": "Images/healer.webp",
						"event": "none"
					}
				]
			},
			{
				"branchId": "branch81",
				"text": "<span class=\"characterName\">Jasmin:</span> What's on your mind ?",
				"character1": "none",
				"character2": "Images/healer.webp",
				"event": "choiceLoop",
				"choices": [
					{
						"choiceId": "0",
						"option": "Aurelia",
						"outcome": "<span class=\"characterName\">You:</span> Tell me more about Aurelia. <br><span class=\"characterName\">Jasmin:</span> Aurelia is a place of light and life, a kingdom that thrives in harmony with nature. It's where the land sings with beauty—lush forests, endless meadows, and lakes so clear you can see the sky reflected in them. The people here are as connected to the earth as the trees, their magic flowing as naturally as the rivers. It's a peaceful kingdom, full of growth and healing, where scholars and healers like myself can find purpose and peace. It truly is a haven, a place where the heart can rest.",
						"character1": "none",
						"character2": "Images/healer.webp",
						"event": "none"
					},
					{
						"choiceId": "1",
						"option": "Elenora",
						"outcome": "<span class=\"characterName\">You:</span> I saw you speaking with a friend earlier, can I ask who she is? <br><span class=\"characterName\">Jasmin:</span> Ofcourse silly, her name is Elenora but you can call her Nora. Her and I go way back. We’ve known each other since we were children, both growing up in Aurelia, but our bond really deepened over time. She's always been a steady presence in my life, like the calm in the storm. I admire her strength, her independence, but what I love most about her is her heart. She sees the world with such clarity, and she’s always there when I need her, even if it’s just a quiet moment to sit and talk. We've shared so many memories, and even though the years have passed, it feels like nothing has changed between us. She’s more than a friend; she’s family. <br> She looks around the campsite. <br><span class=\"characterName\">Jasmin:</span> Just like you guys.",
						"character1": "none",
						"character2": "Images/healer.webp",
						"event": "none"
					},
					{
						"choiceId": "2",
						"option": "Family",
						"outcome": "<span class=\"characterName\">Jasmin:</span> My family... they're a bit of a handful, to be honest,<i> she starts, her voice coated in affection </i>. We come from a long line of Druids — healers and sorcerers who have always had a unique bond with the natural world. It’s in our blood, this connection with animals and the land. My  great great grandmother, especially, was known for her deep understanding of creatures, from the smallest insects to the largest beasts. She could calm a raging wolf with just her voice. My mother, though, she preferred to work with the plants—healing herbs, magic that soothes, those sorts of things. And me, well, I’m a bit of both, I suppose. Animals have always been my companions. I can communicate with them, understand them in ways that feels... natural. <br> She pauses, her expression shifting into one of fond nostalgia before she continues with a laugh. <br><span class=\"characterName\">Jasmin:</span> This one time - <i> she pauses and takes a moment to laugh. </i> This one time, my granny, bless her heart, was a bit ... strange. She went out to collect some potions and got a little mixed up. As she was returning, she wandered straight into the wrong house. Now, this house wasn’t even related to ours, mind you — it belonged to an elderly man who was known for being a bit jumpy, shall we say. So, my grandmother, in her strange ways, just strolls right in like she owns the place. And she looks around, sees the elderly man sitting there, and — well, she screamed at the top of her lungs.<br> Jasmin looks at you with a grin, unable to be serious. <br><span class=\"characterName\">Jasmin:</span> Terrified, he screams right back. And just like that, the two of them are locked in this intense shouting match, both completely convinced they’ve encountered something dangerous. My grandmother’s waving her arms, yelling and the poor man is cowering in the corner, thinking she’s some wild intruder.",
						"character1": "none",
						"character2": "Images/healer.webp",
						"event": "none"
					},
					{
						"choiceId": "3",
						"option": "Nothing else",
						"outcome": "The cool night air envelops you as the campfire crackles, casting flickering shadows across the forest floor. The gentle sounds of the wilderness—chirping insects, the rustle of leaves—create a peaceful atmosphere.The firelight reflects off the herbs she’s carefully arranging, her movements rhythmic and serene. <br><span class=\"characterName\">Jasmin:</span> Leaving so soon? <br><span class=\"characterName\">You:</span> I need to check up on the others. <br><span class=\"characterName\">Jasmin:</span> Once you're done, you should rest. <br> She nods at you then continues to absorb herself in her work.",
						"character1": "none",
						"character2": "Images/healer.webp",
						"event": "none"
					}
				],
				"closingChoice": 3
			},
			{
				"branchId": "branch82",
				"text": "",
				"character1": "none",
				"character2": "none",
				"event": "multipleChoicesEnd",
				"choices": []
			},
			{
				"branchId": "branch83",
				"text": "<span class=\"characterName\">You:</span> Having Fun? <br><span class=\"characterName\">Llewellyn:</span> Not as much without a competitor. <br> He rubs his hands together, a playful glint in his eye, signaling that he's ready for a challenge. <br><span class=\"characterName\">You:</span> Aren't you an <i> earth type </i> stone skipping is literally childsplay to you. <br><span class=\"characterName\">Llewellyn:</span> I promise I'll go easy, for now atleast. <br> You decide to: ",
				"character1": "none",
				"character2": "Images/titan.webp",
				"event": "none",
				"choices": [
					{
						"choiceId": "0",
						"option": "Play",
						"outcome": "<span class=\"characterName\">Llewellyn:</span> Yay. I'll start just to give you some guidance. Llewellyn tosses the first stone, his movements fluid and precise. The stone skims across the water’s surface, bouncing effortlessly before sinking into the pond. He gives you a quick glance, awaiting your attempt. <br> You focus, selecting a smooth stone from the sand. With careful aim, you hurl it forward, but the rock sinks after a single, dismal hop. Llewellyn chuckles, the sound lighthearted but unmistakably triumphant. <br><span class=\"characterName\">Llewellyn:</span> Not bad for a first try. <br><span class=\"characterName\">You:</span> Right it didn't even make it to two hops. <br><span class=\"characterName\">Llewellyn:</span> Tilt your hand. <br> He retrieves another stone and throws it, this one covering double the distance as the first. <br><span class=\"characterName\">Llewellyn:</span> Like that, <i>simple</i>. <br> Determined, you grab another stone and try again, but no matter how much effort you put in, your throws fall short. Llewellyn is relentless, offering pointers between throws but never missing the opportunity to outdo you. <br><span class=\"characterName\">Llewellyn:</span> Looks like the stones favor me tonight. <br> He says while tossing the last one with a lazy flick. Despite the loss, there’s joy to the moment, a bond forming in the shared experience. The challenge might not have ended in your favor, but Llewellyn’s genuine enjoyment makes it hard to feel bitter.",
						"character1": "none",
						"character2": "Images/titan.webp",
						"event": "none"
					},
					{
						"choiceId": "1",
						"option": "Don't Play",
						"outcome": "<span class=\"characterName\">You:</span> I think I'll pass. <br> Llewellyn glances at you, tossing a stone between his fingers. His grin is teasing but not insistent. <br><span class=\"characterName\">Llewellyn:</span> Not feeling competitive tonight? Fair enough. <br>  He says with a shrug, his tone light. <br> He steps closer to the edge of the pond, scanning the ground for another smooth stone. Finding one, he flicks it out over the water with a sharp, practiced motion. The stone skips across the pond's surface, sending out rippling rings with each graceful hop before sinking quietly beneath the water. The soft splashes of stones gliding across the pond mingle with the chirps of crickets and the occasional swish of leaves caught in the night air. In the distance, the campfire’s faint glow flickers, its light just skimming the edge of the water, while the moon’s pale radiance washes over the pond in a cool, silvery sheen. After sending a few more stones skittering across the pond, Llewellyn straightens and turns back toward you. <br><span class=\"characterName\">Llewellyn:</span> Alright, I’ve had my fun. <br> He says with a half-smile while walking over to settle beside you on the soft grass. He leans back on his elbows, his expression distant yet calm as his gaze lingers on the still surface of the pond. <br><span class=\"characterName\">You:</span> Always finding a way to have fun. <br> Llewellyn chuckles at your remark as he knows it's true. With no defense, he responds: <br><span class=\"characterName\">Llewellyn:</span> Skipping stones, as simple as it is, has always been a way to clear my head.",
						"character1": "none",
						"character2": "Images/titan.webp",
						"event": "none"
					}
				]
			},
			{
				"branchId": "branch84",
				"text": "<span class=\"characterName\">Llewellyn:</span> Anything to talk about ?",
				"character1": "none",
				"character2": "Images/titan.webp",
				"event": "choiceLoop",
				"choices": [
					{
						"choiceId": "0",
						"option": "Eryndor",
						"outcome": "<span class=\"characterName\">You:</span> Eryndor, your home, how is it like? I've never been. <br><span class=\"characterName\">Llewellyn:</span> Eryndor is not for the faint of heart. It’s a kingdom of stone and strength, forged on unyielding earth and sculpted by centuries of discipline. Towering spires of silver and grey pierce the skies, their surfaces etched with the intricate marks of our history. The buildings are strong, unshaken by the elements, a reflection of the people who call them home. We don’t just live in Eryndor — we endure it, shape it, and thrive within its unrelenting embrace. <br><span class=\"characterName\">You:</span> Sounds like a pain. <br><span class=\"characterName\">Llewellyn:</span> He, it's not easy but nor is it impossible. <br><span class=\"characterName\"> You:</span> Tell me more. <br><span class=\"characterName\">Llewellyn:</span> The lands stretch far beyond the stone citadels. Eryndor is a kingdom that hungers, its reach extending to new terrains. It is a place of conquest, of fierce ambition, where the rulers wield the finest armies in all the lands. The air smells of iron and ambition, and the banners of the generals fly high, their silver and green emblems striking fear into our enemies. <br><span class=\"characterName\">You:</span> Wait aren't <i>You</i> a general ? <br><span class=\"characterName\"> Llewellyn:</span> Mhm but I prefer skipping stones and spending time with those that matter than fighting political wars for some random royal, you know how the Known World is. <br>Llewellyn nudges you with a faint smile, but beneath it lingers a trace of unease. His eyes, though warm, betray the weight of the political tensions among the five kingdoms, a quiet reflection of his concern for the world’s fragile state.",
						"character1": "none",
						"character2": "Images/titan.webp",
						"event": "none"
					},
					{
						"choiceId": "1",
						"option": "Family",
						"outcome": "<span class=\"characterName\">You:</span> Now that I think about it, we don't know much about your family. <br><span class=\"characterName\">Llewellyn:</span> Well you know I wasn’t born into anything grand. <br> He begins, a casual tone masking the pride beneath his words. <br><span class=\"characterName\">Llewellyn:</span> Unlike somebody we both know... <br>  He trails off, a playful smirk hinting at the presence of royalty within the group, though he doesn’t name names. <br><span class=\"characterName\">Llewellyn:</span> My parents weren’t royals. Far from it. But they’ve always been highly respected warriors in Eryndor’s army. My father, especially—he leads a special unit now. The kind of team they send in when there’s no room for mistakes. <br> His voice carries admiration while his hand absently brushes the edge of his sleeve. <br><span class=\"characterName\">You:</span> And you, surely that must mean a lot of pressure, to fight in these wars ? <br> He chuckles suddenly, breaking the weight of his words. <br><span class=\"characterName\">Llewellyn:</span> Sometimes. Where we come from does not define where we are going. As for me, I started hearing <i> Your Royal Highness </i> tossed around because I climbed the militia ranks too fast for some people’s egos. It started as a joke, and I think they meant it to be an insult. But you know what? I leaned into it. Sounds regal, doesn’t it? <br><span class=\"characterName\">You:</span> Sounds like <i>something</i>.",
						"character1": "none",
						"character2": "Images/titan.webp",
						"event": "none"
					},
					{
						"choiceId": "2",
						"option": "Lateness",
						"outcome": "<span class=\"characterName\">You:</span> Why are you always late, Llewellyn? It's becoming your trademark at this point. <br><span class=\"characterName\">Llewellyn:</span> Always late? That's a bit harsh—I prefer <i>fashionably delayed,</i>, thank you very much. <br> He flashes you a sly grin, brushing off the accusation like dust on his armor. <br><span class=\"characterName\">You:</span> You’re dodging the question. <br><span class=\"characterName\">Llewellyn:</span> Alright, fine. Punctuality is the thief of time, didn’t you know? If you ask me, life’s too short to rush through it. <br> He leans against a nearby tree, his tone a mix of amusement and half-hearted philosophy. <br><span class=\"characterName\">You:</span> That’s the worst excuse I’ve ever heard. <br><span class=\"characterName\">Tino:</span> Or the best one, depending on your perspective. And life? It's all about perspectives, right? <br> Tino appears out of nowhere and greets you with a smile. <br><span class=\"characterName\">You:</span> Where did you come from ? <br><span class=\"characterName\">Tino:</span> I heard you two getting philosophical... had to join. <br> You look at Llewellyn but only receive an utterly unbothered shrug.",
						"character1": "Images/timekeeper.webp",
						"character2": "Images/titan.webp",
						"event": "none"
					},
					{
						"choiceId": "3",
						"option": "End Conversation",
						"outcome": "Llewellyn leans back slightly, his gaze drifting to the pond as the stones in his hand remain untouched. <br><span class=\"characterName\">Llewellyn:</span> Well, it’s not every day I get to share my stone-skipping secrets. Guess I should count myself lucky tonight. <br>You decide it’s time to let him be. <br><span class=\"characterName\">You:</span> I’ll leave you to it then. <br><span class=\"characterName\">Llewellyn:</span> Noted. Don’t worry about me: I’ve got this pond under control. <br>With a casual flick of his wrist, another stone skips effortlessly across the water, disappearing into the night. As you walk away, you catch his voice behind you, light but tinged with sincerity. <br><span class=\"characterName\">Llewellyn:</span> Thanks for the company.",
						"character1": "none",
						"character2": "Images/titan.webp",
						"event": "none"
					}
				],
				"closingChoice": 3
			},
			{
				"branchId": "branch85",
				"text": "",
				"character1": "none",
				"character2": "none",
				"event": "multipleChoicesEnd",
				"choices": []
			},
			{
				"branchId": "branch86",
				"text": "<span class=\"characterName\">You:</span> I can definitely see that. Must have taken so much time to learn. <br><span class=\"characterName\">Mthi:</span> And discipline but it's something even you can achieve. Just give yourself like - about twenty years.  <span class=\"characterName\">You:</span> Twenty years, huh? Guess I'll have to settle for a more immediate solution. <br> <span class=\"characterName\">Mthi:</span> <i> She laughs </i> You’d be surprised. It’s more about patience than anything else. Sure, magic flows in the air, but the real trick is learning how to make it your own. <br> <span class=\"characterName\">You:</span> So, it’s not just about the notes and the melody? <br> <span class=\"characterName\">Mthi:</span> Oh, no. Music is more than just that. It's about feeling it.<br> Zanele who is across the campfire looks at Mthi while she's explaining this to you. <br><span class=\"characterName\">Zanele:</span> You don't say?... <br> Mthi waves off her remark and continues explaining to you. <br><span class=\"characterName\">Mthi:</span> Every note carries emotion, every pause holds meaning. It’s like telling a story without words. You’ve got to listen closely to what’s unsaid, and that’s the magic. <br> <span class=\"characterName\">You:</span> Sounds a lot like how you play with the notes. There’s something... otherworldly about it. <br> <span class=\"characterName\">Mthi:</span> <i> She smiles as she applauds your awareness </i> That’s because it is. Magic isn’t just spells or tricks; it’s in the little things we do. The rhythm of life, the melody of a conversation, the harmony between us all. You’ve got it, just... hidden somewhere in you, waiting to be played. <br> <span class=\"characterName\">You:</span>  I think I might be <i> a little </i> ways  from finding it, but maybe one day. <br> With her usual sense of humour she adds:<br> <span class=\"characterName\">Mthi:</span> I’ll be here, twenty years later, ready to play the duet. For now though would you like to hear something?",
				"character1": "none",
				"character2": "Images/eye.webp",
				"event": "none",
				"choices": [
					{
						"choiceId": "0",
						"option": "Yes Please",
						"outcome": "<span class=\"characterName\">You:</span> I would love that. <br> Mthi giggles, her laughter light and warm, before she picks up her guitar again. The strings hum softly as she strums a few chords, the sound creating a gentle melody that fills the quiet night air around the campsite.<br> <span class=\"characterName\">Mthi:</span> Alright, here’s one of my favorites. It’s a little something I’ve been working on. <br> She begins to play, her fingers moving expertly over the strings, and the music flows smoothly like a river—soft, flowing, and calming. The melody is simple, yet it carries a depth of emotion, as if each note holds a story that only the music knows. There’s a delicate balance between the rhythm and the silence, with each pause adding weight to the piece. <br><span class=\"characterName\">Mthi:</span> It’s funny how a song can capture everything in a single moment. All the things we don’t say, all the things we feel. Her gaze lifts slightly as she plays, her expression peaceful, lost in the music. The sound of her guitar seems to draw out the stillness of the night, as if the stars above are listening too, swaying in time with the tune. <br><span class=\"characterName\">You:</span> I think that’s the most beautiful thing I’ve heard in a while. <br> Mthi doesn’t stop playing but looks at you with a quiet smile, her eyes sparkling with the kind of happiness that only music can bring. She continues, the song now wrapping around you like a soft blanket, filling the space with warmth and comfort. It’s a simple song, but it feels like something more - like a gift, something personal just for this moment between the two of you. ",
						"character1": "none",
						"character2": "Images/eye.webp",
						"event": "none"
					},
					{
						"choiceId": "1",
						"option": "No Thanks",
						"outcome": "<span class=\"characterName\">You:</span> No thanks, I’m good for now. <br> Mthi pauses for a moment, her fingers resting on the strings of her guitar, before she flashes you a playful smile. <br> <span class=\"characterName\">Mthi:</span> Oh, I see how it is. Well, there’s always a better time for music, right? <br> She shrugs nonchalantly, her smile not fading in the slightest. With a soft laugh, she returns her attention to the sheet of paper in front of her. Her pencil moves smoothly across the page, writing out new musical notes, each one seeming to take on a life of its own as the melody forms in her mind. <br> The faint scribbling of the pencil is the only sound now, as she carefully writes out the notes, clearly lost in thought. Her concentration is evident, but the playful energy never fully disappears from her demeanor. <br><span class=\"characterName\">Mthi:</span> <i>murmuring to herself</i> Maybe next time... or the time after that. Music will always be waiting. <br> She notices you once again. <br><span class=\"characterName\">Mthi:</span> Oh... you're still here. Would you like to hear it now? <br> She adds, knowing very well you never left.",
						"character1": "none",
						"character2": "Images/eye.webp",
						"event": "none"
					}
				]
			},
			{
				"branchId": "branch87",
				"text": "<span class=\"characterName\">Mthi:</span> Kewl, so now what ?",
				"character1": "none",
				"character2": "Images/eye.webp",
				"event": "choiceLoop",
				"choices": [
					{
						"choiceId": "0",
						"option": "Ambitions",
						"outcome": "<span class=\"characterName\">You:</span> So, Mthi, what’s the big dream? What’s the endgame for a musical prodigy like you? <br><span class=\"characterName\">Mthi:</span> Oh, the dream? Definitely to start a band! Like, a real band. <br><span class=\"characterName\">You:</span> A band, huh? Sounds like you’ve thought this through. Got any members in mind? <br><span class=\"characterName\">Mthi:</span> Hmm, well, I did think about recruiting you. But then I remembered... you have the rhythm of a clumsy goblin.<br><span class=\"characterName\">You:</span> Hey, I resent that! I could totally keep a beat.<br><span class=\"characterName\">Mthi:</span> <i>She grins at you</i> Sure, sure. But you’d have to promise not to trip over the drum kit.<br><span class=\"characterName\">You:</span> Fine, scratch me off the list. Who else? <br><span class=\"characterName\">Mthi:</span> Honestly? I think the our group would make an incredible band.... <i>once they learn ofcourse.</i> Just picture it: Llewellyn on bass — he’d have that broody, mysterious vibe all the fans would swoon over.<br><span class=\"characterName\">You:</span> A broody bassist, huh? What about Tino?<br><span class=\"characterName\">Mthi:</span> Oh, Tino? Drummer. Without a doubt. He’d be the chaotic one who plays upside down and smashes everything for fun.<br><span class=\"characterName\">You:</span> That checks out. And Zanele?<br><span class=\"characterName\">Mthi:</span> Lead vocals! She has that soothing, angelic presence that would balance out Tino’s absolute chaos.<br><span class=\"characterName\">You:</span> Practical and talented. What about Jasmin?<br><span class=\"characterName\">Mthi:</span> Hmm, Jasmin would be our manager. No nonsense. Making sure we show up on time, get paid, and don’t, you know, set anything on fire.<br><span class=\"characterName\">You:</span> And you?<br><span class=\"characterName\">Mthi:</span> Lead guitar, of course. I’d be the star... but, like, in a humble way.<br><span class=\"characterName\">You:</span> <i>You laugh</i> Humble, huh? So what’s the band’s name?<br><span class=\"characterName\">Mthi:</span> Oh, I’ve got it: Strings of Destiny. No, wait! The Atlas Mix! Ugh, no, that’s terrible. What do you think?<br><span class=\"characterName\">You:</span> How about The Misfit Chords?<br><span class=\"characterName\">Mthi:</span> <i>laughing</i> Okay, now you’re hired. You can’t play an instrument, but you’ve got the naming skills of a genius.<br><span class=\"characterName\">You:</span> See? I am useful!<br><span class=\"characterName\">Mthi:</span> <i>Mthi smiles at you</i> Alright, fine. Maybe there’s hope for you yet. But if you mess up our first gig, you’re demoted to roadie.<br><span class=\"characterName\">You:</span> Deal.<br><span class=\"characterName\">Mthi:</span> Now, if only I could convince the others... think Tino would trade his time magic for drumsticks? <br><span class=\"characterName\">You:</span> As long as he is not the singer.",
						"character1": "none",
						"character2": "Images/eye.webp",
						"event": "none"
					},
					{
						"choiceId": "1",
						"option": "Family",
						"outcome": "<span class=\"characterName\">You:</span> So, Mthi, what about your family? You must’ve picked up that personality from somewhere.<br><span class=\"characterName\">Mthi:</span> Oh, you mean this sparkling charm? Definitely from my mom. She’s the bubbliest person you’ll ever meet. Always laughing, always chatting—she could probably talk a tree into sprouting flowers.<br><span class=\"characterName\">You:</span> That sounds... lively. What does she do?<br><span class=\"characterName\">Mthi:</span> She’s the head of the Valdoran Guild of Artisans. Fancy title for someone who’s basically a whirlwind with a clipboard, organizing the most talented crafters in the kingdom.<br><span class=\"characterName\">You:</span> That’s impressive.<br><span class=\"characterName\">Mthi:</span> Oh, she’s a force of nature, for sure. My dad’s in the guild too, but he’s quieter. He’s the one making sure the magic-infused tools don’t blow up. Keeps everyone safe while Mom dazzles the crowd.<br><span class=\"characterName\">You:</span> And siblings?<br><span class=\"characterName\">Mthi:</span>  My brother’s training to be a Hunter. You know, tracking monsters, surviving in the wild, being annoyingly heroic. And then there’s my sister. She’s the brainiac—studying to be a scholar at the Academy.<br><span class=\"characterName\">You:</span> Scholar, huh? So she’s the responsible one?<br><span class=\"characterName\">Mthi:</span> Oh, completely. She can name every constellation, recite ancient texts, and still somehow judge me for eating dessert before dinner.<br><span class=\"characterName\">You:</span> Sounds like you’ve got quite the family.<br><span class=\"characterName\">Mthi:</span> <i>grinning</i> Yeah, they’re not bad.",
						"character1": "none",
						"character2": "Images/eye.webp",
						"event": "none"
					},
					{
						"choiceId": "2",
						"option": "Valdora",
						"outcome": "<span class=\"characterName\">Mthi:</span> Valdora is... different. It’s all about balance. The magic, the precision of archery, and the pursuit of knowledge. It’s a land of sorcery and infinite wisdom.<br><span class=\"characterName\">You:</span> Sounds like a dream.<br><span class=\"characterName\">Mthi:</span> Oh, wait till you hear about the library.<br><span class=\"characterName\">You:</span> Library?<br><span class=\"characterName\">Mthi:</span> Not just any library. It’s the largest one in the Known World. Picture this: towering shelves that disappear into the shadows above, scrolls and books crammed into every nook and cranny, the air heavy with the scent of ancient parchment and ink.<br><span class=\"characterName\">You:</span> Sounds incredible.<br><span class=\"characterName\">Mthi:</span> It’s also a maze. You could get lost in there for weeks, and that’s if the archivists let you in. It’s not open to just anyone.<br><span class=\"characterName\">You:</span> I’m guessing they don’t just hand out library cards?<br><span class=\"characterName\">Mthi:</span> Definitely not. I had to sneak in once.<br><span class=\"characterName\">You:</span> Had to?<br><span class=\"characterName\">Mthi:</span> <i>she meets your gaze with a sly smirk</i> Of course! I mean, who wouldn’t want to see ancient scrolls on forgotten spells or stories about bards charming entire armies?<br><span class=\"characterName\">You:</span> Did you get caught?<br><span class=\"characterName\">Mthi:</span> Let’s just say the archivist was very good at stern looks. Told me I was lucky they didn’t turn me into a duck.<br><span class=\"characterName\">You:</span> And?<br><span class=\"characterName\">Mthi:</span> I apologized profusely... and made a run for it. Totally worth it, though.<br><span class=\"characterName\">You:</span> I’m guessing you’re not done sneaking around?<br><span class=\"characterName\">Mthi:</span> Not even close.",
						"character1": "none",
						"character2": "Images/eye.webp",
						"event": "none"
					},
					{
						"choiceId": "3",
						"option": "End Conversation",
						"outcome": "<span class=\"characterName\">You:</span> It’s been fun, Mthi, but I should probably check in on the others before they think I’ve vanished.<br><span class=\"characterName\">Mthi:</span> <i>playfully</i> Oh, you’re leaving me for them? Just when I was about to compose your theme song.<br>You chuckle, shaking your head. Mthi’s cheerful energy is infectious, and for a moment, you’re tempted to linger. But the faint hum of the campfire and distant murmurs of the others tug at you, reminding you of the night ahead.<br><span class=\"characterName\">You:</span> Save it for my grand entrance next time.<br><span class=\"characterName\">Mthi:</span> Deal. But don’t keep me waiting too long.<br>As you rise, Mthi leans back, her guitar cradled against her like an old friend, and resumes jotting down notes on her sheet of paper. The soft scratch of her pencil blends with the gentle strum of her strings, filling the air with a melody that seems to follow you as you walk away.<br>The voices of your companions drift through the stillness, each carrying its own unique cadence, promising new stories and unexpected moments.<br>You glance back once, catching sight of Mthi, now fully absorbed in her music, her silhouette outlined against the pale light of the stars. A small smile tugs at your lips before you turn your focus forward, ready to see what—or who—awaits you next.",
						"character1": "none",
						"character2": "Images/eye.webp",
						"event": "none"
					}
				],
				"closingChoice": 3
			},
			{
				"branchId": "branch88",
				"text": "",
				"character1": "none",
				"character2": "none",
				"event": "multipleChoicesEnd",
				"choices": []
			},
			{
				"branchId": "branch89",
				"text": "",
				"character1": "none",
				"character2": "none",
				"event": "multipleChoicesEnd",
				"choices": []
			},
			{
				"branchId": "branch90",
				"text": "<span class=\"characterName\">Zanele:</span> Mhm, so you were saying ?",
				"character1": "none",
				"character2": "Images/phoenix.webp",
				"event": "choiceLoop",
				"choices": [
					{
						"choiceId": "0",
						"option": "Fire Magic",
						"outcome": "<span class=\"characterName\">You:</span> Zanele, do you ever ...fear fire magic? I mean, what it could do — to you, or to those around you?<br><span class=\"characterName\">Zanele:</span> Fear it?<br>She pauses, her dark oak coloured eyes catching the flickering flames of the campfire as if drawing strength from them.<br><span class=\"characterName\">Zanele:</span> Growing up, I was always taught to fear power. By those above me. They said it was something that could control you, bend you to its will. But you know what? That’s not true — not entirely.<br>She gestures towards the campfire, the tips of her fingers glowing faintly with ember-like light.<br><span class=\"characterName\">Zanele:</span> Fire ... it’s so much more than just a force to destroy. Yes, it can burn, devastate even, but it’s also life-giving. It’s what keeps us warm on winter nights. It’s how we cook the meals that keep us going, and believe it or not, it can even heal if wielded properly.<br>She smiles, leaning slightly closer as if sharing a secret.<br><span class=\"characterName\">Zanele:</span> One of my favourite spells is <i>Rekindling flame</i>. It’s an advanced one, but it allows you to use fire to cauterize wounds, sealing them in an instant. Of course, it’s not without its risks—get it wrong, and you’re just setting someone ablaze.<br><span class=\"characterName\">You:</span> Sounds ... intense.<br><span class=\"characterName\">Zanele:</span> That’s the thing about fire magic. It is intense. It demands respect and precision. I’ve spent years honing it, learning its nuances.<br><span class=\"characterName\">Zanele:</span> Another one of my favourites? Inferno. It's more than a spell; it's art. <br>Zanele steps back slightly, raising her hand with a graceful flourish. Slowly red leaves, tinted with hues of autumn gold and fiery orange, begin to materialize around her. <br>They swirl gently in the air, as though caught in a warm autumn breeze. The glow they emit bathes the campsite in a soft, radiant light, their edges flickering faintly like embers in the dark. <br>You watch, captivated, as the leaves descend around you. One leaf drifts closer, and you instinctively reach out. <br>It feels warm to the touch, delicate like silk but pulsing faintly as though alive. <br><span class=\"characterName\">You:</span> These are... beautiful. They almost don’t feel real. <br><span class=\"characterName\">Zanele:</span> <i>with a sly grin</i> Oh they’re real, all right. And deadly. Once they land on a target... <br>She snaps her fingers, and one of the leaves hanging in the air flashes briefly before disappearing in a silent puff of fiery red sparks. <br><span class=\"characterName\">Zanele:</span> ...Boom. They explode with devastating impact.<br>Your eyes widen, and you quickly retract your hand from the leaf you were touching. <br><span class=\"characterName\">You:</span> Wait... WHAT?! <br>The panic in your voice draws a hearty laugh from Zanele, who waves her hand, dispersing the remaining leaves into harmless embers. <br><span class=\"characterName\">Zanele:</span> Relax! I wasn’t going to blow you up. I’d never waste such a masterpiece on you. <br><span class=\"characterName\">You:</span> Right, thanks! That’s so reassuring. <br>She smirks and leans forward. <br><span class=\"characterName\">Zanele:</span> Don’t worry—I only explode the people who deserve it. <br>Her words are lighthearted, but the spark in her gaze makes it clear she means every word. <br>You can only shake their head in awe and slight disbelief.<br><span class=\"characterName\">Zanele:</span> Fire is balance. It’s not inherently good or bad—it’s the one who wields it that determines what it becomes. You don’t fear fire; you respect it, control it, and let it serve you, not the other way around.<br><span class=\"characterName\">You:</span> That’s ... a lot to take in.<br><span class=\"characterName\">Zanele:</span> It is. But don’t let it intimidate you. Just… don’t tell the others I gave you a crash course. I have a reputation to maintain.<br>She winks, the playful glimmer returning to her expression.",
						"character1": "none",
						"character2": "Images/phoenix.webp",
						"event": "none"
					},
					{
						"choiceId": "1",
						"option": "Family",
						"outcome": "<span class=\"characterName\">You:</span> Zanele, I’ve been meaning to ask—what’s your family like? You seem... well, like you’d be the glue that holds everyone together. <br>Zanele smiles softly. <br><span class=\"characterName\">Zanele:</span> My family? Oh, they’re... a force of nature, truly. Noble bloodlines, scattered far and wide. If there’s a fire-wielder in any corner of the Five Kingdoms, there’s a good chance we’re related somehow. <br>She pauses, her gaze distant as though she's envisioning faces she hasn’t seen in a while. <br><span class=\"characterName\">Zanele:</span> But at home, the heart of it all is smaller. My time there isn’t spent with diplomats or warriors. It’s with my nephews and nieces. <br>Her voice grows softer, almost reverent. <br><span class=\"characterName\">Zanele:</span> They’re my little sparks. Every time I visit, they run to me with their wild stories, their impossible dreams, and that innocent belief that I can do anything. <br>She lets out a small laugh, tinged with nostalgia. <br><span class=\"characterName\">Zanele:</span> I’ll never forget the first time one of them asked me to teach them fire magic. She couldn’t have been older than six. The way she looked at me — like I was this untouchable hero. That’s when I realized... they’re always watching. Every move I make, every word I say—it matters to them. <br>You can see her composure falter for just a moment, the weight of her words heavy in the air. <br><span class=\"characterName\">You:</span> That must be a lot of pressure. <br>She shakes her head gently, her tone resilient. <br><span class=\"characterName\">Zanele:</span> Not pressure. Purpose. They’ve shaped who I am as much as I’ve shaped them. They’re the reason I learned to lead with kindness, to stand strong even when it feels like the world’s on fire. <br>Her smile returns, soft yet resolute. <br><span class=\"characterName\">Zanele:</span> I think that’s why I’ve taken on this role with our group. It’s not about being perfect. It’s about being there — steady, unshakable, and always ready to hold everything together. <br>For a moment, the two of you sit in silence, the fire crackling softly between you. <br><span class=\"characterName\">You:</span> They’re lucky to have you, you know. <br>Her gaze meets yours, a flicker of gratitude shows in her eyes. <br><span class=\"characterName\">Zanele:</span> And I’m lucky to have them — and you guys. Family isn’t just who you’re born to. It’s who you fight for, who you stand beside, and who you’ll never give up on.",
						"character1": "none",
						"character2": "Images/phoenix.webp",
						"event": "none"
					},
					{
						"choiceId": "2",
						"option": "Kuruhona",
						"outcome": "<span class=\"characterName\">You:</span> So, Zanele... what’s your home like? I’ve heard rumors about the land of fire, but nothing concrete. <br>Zanele’s expression brightens instantly, her usual poise replaced with an almost childlike enthusiasm. <br><span class=\"characterName\">Zanele:</span> Ah, Kurohana. There’s nothing quite like it. Hidden high in the mountains, it’s a realm of endless flame and crimson skies. Imagine valleys where rivers of molten lava carve paths through jagged black stone, and the air hums with the energy of fire magic. Even the nights glow faintly, as though the land itself is alive. <br>She gestures as if painting the scene before you, her words flowing with pride. <br><span class=\"characterName\">Zanele:</span> Kurohana isn’t just a place—it’s a tradition, a way of life. Each clan has its own legacy, passed down through generations. The people there... well, we’re a fiery bunch, no pun intended. Martial arts and fire magic go hand in hand, taught from an early age to channel not just power, but precision and balance. <br>Her tone shifts, taking on a more thoughtful quality. <br><span class=\"characterName\">Zanele:</span> While other kingdoms might fear fire, we embrace it. We hone it like a blade, tempering its heat until it becomes an extension of who we are. <br>She pauses for a moment, glancing at you with a sly grin. <br><span class=\"characterName\">Zanele:</span> And of course, Kurohana is famous for its attire — and <i>its women </i>, the best of both, if I do say so myself.<br>You raise an eyebrow at her joking tone, and she chuckles, clearly enjoying herself. <br><span class=\"characterName\">You:</span> Attire? What makes it so special? <br><span class=\"characterName\">Zanele:</span> Our clothing isn’t just fabric. It’s an expression. Silk dyed in the deepest reds and golds, embroidered with patterns that shimmer like flames when they catch the light.Each design tells a story — of a family, a triumph, a loss, the purity of a marriage, or the quiet strength of a widow. And it’s not just for show. Our battle garments are woven with fire-resistant threads, beads, jewellery and other assets, as functional as they are beautiful. <br>Her gaze grows distant, a hint of melancholy creeping into her voice. <br><span class=\"characterName\">Zanele:</span> But Kurohana isn’t all beauty. We’ve been at war with Eryndor for as long as I can remember. They see us as a threat, a force to be subdued. Since we are physically opposite Kingdoms, there are bound to be tensions. Our fire magic gives us strength, but it also makes us a target. It’s a complicated history, one with too much bloodshed on both sides.<br>She sighs, her fingers absently tracing patterns in the dirt. <br><span class=\"characterName\">Zanele:</span> The monsters that roam Kurohana’s lands don’t help, either. Many of them are resistant to fire, which makes them particularly... stubborn. But they’ve shaped us, too. Facing creatures that don’t fear our flames forces us to think differently, to adapt. It’s part of what makes us who we are. <br>Her eyes flick back to yours, the firelight reflecting in them like molten gold. <br><span class=\"characterName\">Zanele:</span> So that’s Kurohana. Fierce, untamed, and beautiful. Just like its people. <br><span class=\"characterName\">You:</span> It sounds incredible. And dangerous. <br>She laughs, the sound warm and full of life. <br><span class=\"characterName\">Zanele:</span> Oh, it is. But if you ever visit, don’t worry. I’ll make sure you leave with your eyebrows intact. <br>",
						"character1": "none",
						"character2": "Images/phoenix.webp",
						"event": "none"
					},
					{
						"choiceId": "3",
						"option": "End Conversation",
						"outcome": "<span class=\"characterName\">Zanele:</span> Enough about me, let’s get to cooking. We’ve got plenty of ingredients—what are we making tonight? <br><span class=\"characterName\">You:</span> How about something hearty? A stew sounds good. <br><span class=\"characterName\">Zanele:</span> Good choice! Let’s get to it. You chop the veggies, I’ll handle the meat and spices. <br> You begin chopping carrots, onions, and garlic while Zanele prepares the meat. The warmth of the fire and the scent of herbs fill the air.<br><span class=\"characterName\">Zanele:</span> Don’t let the garlic burn—keep it soft and fragrant. Stir it gently. <br><span class=\"characterName\">You:</span> This smells amazing already. <br> You continue stirring as the stew begins to simmer. <br><span class=\"characterName\">Zanele:</span> Alright, just a pinch more salt... There! Now we wait.",
						"character1": "none",
						"character2": "Images/phoenix.webp",
						"event": "none"
					}
				],
				"closingChoice": 3
			},
			{
				"branchId": "branch91",
				"text": "",
				"character1": "none",
				"character2": "none",
				"event": "multipleChoicesEnd",
				"choices": []
			},
			{
				"branchId": "branch92",
				"text": "",
				"character1": "none",
				"character2": "none",
				"event": "visualChoices",
				"choices": [
					{
						"choiceId": "0",
						"option": "Play Memory Game",
						"outcome": "<span class=\"characterName\">Mthi:</span> Alright, I’ve had enough of listening to Tino's cryptic nonsense for one night. Who’s up for a game? <br><span class=\"characterName\">Zanele:</span> A game? I think we could all use something to pass the time. What do you have in mind? <br><span class=\"characterName\">Mthi:</span> How about a memory game? Cards, matching pairs... it’s simple, but fun. <br><span class=\"characterName\">Tino:</span> Didn't you play that earlier ? Hmmm anyway I'm in. But just so you know, I’ve got the best memory in the group. You’re all doomed from the start. <br><span class=\"characterName\">Llewellyn:</span> Sure, Tino. I’ll believe that when I see it. Let’s see if your memory is as good as you claim. <br><span class=\"characterName\">Jasmin:</span> Alright, alright. We’ll see who’s truly got the sharpest memory. Let’s get started.",
						"character1": "all",
						"character2": "none",
						"imgSrc": "Images/Choices/hand.webp",
						"gradient": "linear-gradient(brown, gold, brown,gold,brown)",
						"event": "none"
					},
					{
						"choiceId": "1",
						"option": "Sing Together",
						"outcome": "Mthi leans back against a log, eyes gleaming with excitement. <br><span class=\"characterName\">Mthi:</span> So, I’ve got an idea! How about a little sing-along? A song for the road ahead! Everyone’s got a voice, right? <br><span class=\"characterName\">Zanele:</span> I’m in! What are we singing? You know I’ve got a thing for tunes. <br><span class=\"characterName\">Jasmin:</span> Sounds fun. I could use a little music to lift the spirits. <br><span class=\"characterName\">Llewellyn:</span> I suppose I can give it a try. It’ll be nice to add something to the night. <br>Tino, who has been quietly observing, raises an eyebrow and waves his hand dismissively. <br><span class=\"characterName\">Tino:</span> .... Nah, I'll pass. <br>  With a playful grin, Mthi quickly moves closer to Tino, a twinkle in her eye.<br><span class=\"characterName\">Mthi:</span> Oh, come on, Tino! You can’t just leave us to sing by ourselves! It’ll be fun—you might even surprise yourself! <br> Zanele, ever the supportive force, laughs and nudges Tino lightly. <br><span class=\"characterName\">Zanele:</span> Yeah, Tino! Don’t leave us hanging. You can just sit back and listen, if you must... but you’ll have to hear us. <br> Tino looks around, then crosses his arms with a smirk, clearly outnumbered but unwilling to give in easily.<br><span class=\"characterName\">Tino:</span> <i>Let it go</i>. I'm not singing but you guys have fun. <br><span class=\"characterName\">Mthi:</span> Alright, Tino, you don’t have to sing—but you’ll be the audience, and we’ll make sure to put on a good show. Just don’t be surprised if we get you humming along by the end of it!",
						"character1": "all",
						"character2": "none",
						"imgSrc": "Images/Choices/Sing Along.webp",
						"gradient": "linear-gradient(gold,red 100%)",
						"event": "none"
					},
					{
						"choiceId": "2",
						"option": "Go to Sleep",
						"outcome": "<span class=\"characterName\">Passion:</span> And so, our journey comes to an end — for now. This game has been a labor of love, countles nights of coding (about above 100 and some spare change), designing, and rewriting. It’s not perfect, and I’ll admit, this is just the beta — the earliest version of what I hope will grow into something far greater.<br> If you’ve reached this point, it means you’ve joined me on this adventure, and for that, I’m truly grateful. Now, don’t get me wrong — your feedback might matter (I’m kidding, I promise). It does matter because your ideas, thoughts, and opinions could shape what this game will eventually become. Your voice is part of the ideation process now. A massive thank you to my real-life inspirations: Jasmin, Mthi, Llewellyn, and Zanele. Without your unwavering support, humor, and brilliant minds, this project would’ve remained just an idea. You’re the reason this world exists, and your influence is woven into every scene, every choice, and every moment of this story.<br> <i>Now onto the legalities:</i> I’d also like to acknowledge the incredible assets that helped bring this game to life. Most of the assets used in this project are free and available under the Creative Commons License (CC BY or similar), making it possible for creators like me to dream big.<br> Thank you for being a part of this story.<br> ~<i>PassionOverPain</i>",
						"character1": "Images/timekeeper.webp",
						"character2": "none",
						"imgSrc": "Images/Choices/Continue the night.webp",
						"gradient": "linear-gradient(black, white)",
						"event": "none"
					}
				]
			},
			{
				"branchId": "branch93",
				"text": ">>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>Error - Broken ChoiceLoop<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<",
				"character1": "none",
				"character2": "none",
				"event": "multipleChoices",
				"goToBranches": [93, 95, 103],
				"choices": []
			},
			{
				"branchId": "branch94",
				"text": "",
				"character1": "none",
				"character2": "none",
				"event": "triggerGame",
				"game": "MemoryGame",
				"choices": []
			},
			{
				"branchId": "branch95",
				"text": "",
				"character1": "none",
				"character2": "none",
				"event": "multipleChoicesEnd",
				"choices": []
			},
			{
				"branchId": "branch96",
				"text": "What would you like to sing?",
				"character1": "all",
				"character2": "none",
				"event": "none",
				"choices": [
					{
						"choiceId": "0",
						"option": "Classic",
						"outcome": "Let's go classical",
						"character1": "all",
						"character2": "none",
						"event": "none"
					},
					{
						"choiceId": "1",
						"option": "Rap",
						"outcome": "Let's Rap",
						"character1": "all",
						"character2": "none",
						"event": "none"
					}
				]
			},

			{
				"branchId": "branch97",
				"text": "",
				"character1": "none",
				"character2": "none",
				"event": "checkChoices",
				"choice": 10,
				"values": [0],
				"endBranch": 98,
				"choices": []
			},
			{
				"branchId": "branch98",
				"text": "The group bursts into song, their voices harmonizing under the stars. <br><br>\"Through the firelight, we’ll sing tonight, <br>Our voices echo under the moon so bright.The road may twist, <br>the skies may roar, <br>But together we’ll rise, forevermore.\" <br> <i>Sing About</i>:",
				"character1": "all",
				"character2": "Images/Scenes/Orb - Forest Campsite.webp",
				"event": "none",
				"choices": [
					{
						"choiceId": "0",
						"option": "Adventure",
						"outcome": "\"The winds may howl, the path unknown, <br> But courage finds us where we roam. <br> With every step, the world unfolds, <br> A tapestry of tales untold. <br><br> Through mountains high, and valleys wide, <br>We face the storm, we never hide. <br>The stars will guide us, shining true, <br>With every dawn, a world anew.\"",
						"character1": "all",
						"character2": "Images/Scenes/Orb - Forest Campsite.webp",
						"event": "none"
					},
					{
						"choiceId": "1",
						"option": "Friendship",
						"outcome": "\"When shadows fall and nights grow long,<br>We stand as one, our bond is strong.<br>Through laughter, tears, and battles fought,<br>We find the strength we always sought.<br><br>Together we’ll weave our story bright,<br>With trust as fierce as the fiercest fight.<br>In every voice, a thread of gold,<br>A friendship timeless, brave, and bold.\"",
						"character1": "all",
						"character2": "Images/Scenes/Orb - Forest Campsite.webp",
						"event": "none"
					},
					{
						"choiceId": "2",
						"option": "Home",
						"outcome": "\"The fire burns, a gentle glow,<br>Reminding us of all we know.<br>The laughter shared, the warmth of peace,<br>A moment’s rest, our hearts release.<br><br>Though roads may pull us far away,<br>Our memories hold the light of day.<br>No matter where the journey bends,<br>Home lives within, it never ends.\"",
						"character1": "all",
						"character2": "Images/Scenes/Orb - Forest Campsite.webp",
						"event": "none"
					}
				]
			},
			{
				"branchId": "branch99",
				"text": "\"Through the firelight, we’ll sing tonight, <br>Our voices echo under the moon so bright.The road may twist, <br>the skies may roar, <br>But together we’ll rise, forevermore.\"",
				"character1": "all",
				"character2": "Images/Scenes/Orb - Forest Campsite.webp",
				"event": "none",
				"choices": []
			},
			{
				"branchId": "branch100",
				"text": "",
				"character1": "none",
				"character2": "none",
				"event": "multipleChoicesEnd",
				"choices": []
			},
			{
				"branchId": "branch101",
				"text": "Listen bruv, the bars are coming soon... For now my brain is just dead, Not as dead as ChatGPTs flow 😭.",
				"character1": "none",
				"character2": "none",
				"event": "none",
				"choices": []
			},
			{
				"branchId": "branch102",
				"text": "",
				"character1": "none",
				"character2": "none",
				"event": "multipleChoicesEnd",
				"choices": []
			},
			{
				"branchId": "branch103",
				"text": "....",
				"character1": "Images/timekeeper.webp",
				"character2": "none",
				"event": "none",
				"choices": []
			},
			{
				"branchId": "branch104",
				"text": "<span class=\"characterName\">Passion:</span> Oh you're still here ? Welp As I said the game is finished now, you can leave.",
				"character1": "Images/timekeeper.webp",
				"character2": "none",
				"event": "none",
				"choices": []
			},
			{
				"branchId": "branch105",
				"text": "....",
				"character1": "Images/timekeeper.webp",
				"character2": "none",
				"event": "none",
				"choices": []
			},
			{
				"branchId": "branch106",
				"text": "<span class=\"characterName\">Passion:</span> The game is over, I promise, <i>Leave</i>.",
				"character1": "Images/timekeeper.webp",
				"character2": "none",
				"event": "none",
				"choices": []
			},
			{
				"branchId": "branch107",
				"text": "....",
				"character1": "Images/timekeeper.webp",
				"character2": "none",
				"event": "none",
				"choices": []
			},
			{
				"branchId": "branch108",
				"text": "<span class=\"characterName\">Passion:</span> You my friend are a persistent one... Anyway bruv feel free to stay here. I've got things to do in life.",
				"character1": "Images/timekeeper.webp",
				"character2": "none",
				"event": "none",
				"choices": []
			}
		]
	}
]
