[
	{
		"chapterId": "chapter1",
		"Name": "The Awakening",
		"branches": [
			{
				"branchId": "branch1",
				"text": "You awaken on a desolate battlefield, surrounded by a thick fog. The air feels heavy and cold, filled with echoes of distant voices. Shadows stretch across the ground, where remnants of a recent struggle lie. You regain consciousness and notice your friends are scattered on the battleground... Who do you seek for aid:",
				"character1": "none",
				"character2": "none",
				"event": "none",
				"choices": []
			},
			{
				"branchId": "branch2",
				"text": "",
				"character1": "none",
				"character2": "none",
				"event": "visualChoices",
				"choices": [
					{
						"choiceId": "0",
						"option": "Jasmin",
						"outcome": "<span class=\"characterName\">Jasmin:</span> <i>With no words She hugs you </i>... I thought you were gone. You took quite a hit... all this time...we should have never trusted them. <i> She looks into the north to a cloaked figure</i>.",
						"character1": "Images/healer.webp",
						"character2": "none",
						"imgSrc": "Images/healer.webp",
						"gradient": "linear-gradient(15deg, #142850, #14365f, #13476f, #125d80, #107792, #0d96a5, #09b8b4, #04ccb1)",
						"event": "none"
					},
					{
						"choiceId": "1",
						"option": "Llewellyn",
						"outcome": "<span class=\"characterName\">Llewellyn:</span> Ah glad to see you've woken up from that sleep you were in. As you may or may not remember. <i>He points to a cloaked figure</i>. I don't know how but we need to stop them.",
						"character1": "Images/titan.webp",
						"character2": "none",
						"imgSrc": "Images/titan.webp",
						"gradient": "radial-gradient(circle at 20% 0%, #ff8b17, #e6751f, #cc6021, #b24d22, #963b1f, #7b2b1c, #601d16, #45100e)",
						"event": "none"
					},
					{
						"choiceId": "2",
						"option": "Mthi",
						"outcome": "<span class=\"characterName\">Mthi:</span> Do my eyes deceive me? What would we do without you? Don't go doing that again. <i>She smiles faintly and hugs you.</i> Anyway our problem lies with them. <i> Mthi turns to face the cloaked figure in the distance. </i>",
						"character1": "Images/eye.webp",
						"character2": "none",
						"imgSrc": "Images/eye.webp",
						"gradient": "linear-gradient(195deg, #ff00c3, #d123ba, #a42dab, #7b2f97, #552b80, #342465, #181a48, #050b2b)",
						"event": "none"
					},
					{
						"choiceId": "3",
						"option": "Tino",
						"outcome": "<span class=\"characterName\">Tino:</span> Well well well, your return is right on time. Thank you for not dying on us... at least yet. <i>He smiles at you </i>. Although for now, I don't see us getting out of this one. <i> He states while looking at a cloaked figure </i>.",
						"character1": "Images/timekeeper.webp",
						"character2": "none",
						"imgSrc": "Images/timekeeper.webp",
						"gradient": "linear-gradient(90deg, #dc781f, #b8860b, #8b4513)",
						"event": "none"
					},
					{
						"choiceId": "4",
						"option": "Zanele",
						"outcome": "<span class=\"characterName\">Zanele:</span> You poor little thing... I thought you were dead. <i>She hugs you with a sigh of relief</i>. We need to make them pay for this <i>She looks at a cloaked figure in the distance </i> for everything...",
						"character1": "Images/phoenix.webp",
						"character2": "none",
						"imgSrc": "Images/phoenix.webp",
						"gradient": "linear-gradient(45deg, #7d0928, #962521, #ad3e0f, #c15900, #d27500, #de9200, #e6b100, #e8d103)",
						"event": "none"
					}
				]
			},
			{
				"branchId": "branch3",
				"text": "<i>You turn to see the others rushing towards both of you.<br></i><span class=\"characterName\">Jasmin:</span>We can't hold on for much longer. I can only heal everyone a couple more times then I am out of Mana.<br><span class=\"characterName\">Mthi:</span> And I can't transform for a prelonged period of time now thanks to their Mana depletion field.<br><span class=\"characterName\">Tino:</span> Then I'm presuming you can't transform into a Titan for long as well? <i>He looks at Llewellyn.</i><br><span class=\"characterName\">Llewellyn:</span> Yea, I am still able to do a good amount of damage but at the cost of defense. <br><span class=\"characterName\">Zanele:</span> Clearly we need a plan or something. This can't be the end. <br>The group looks to you, awaiting a decision that will determine the stratergy. You decide to: ",
				"character1": "all",
				"character2": "Images/cloakedFigureBack.webp",
				"event": "none",
				"choices": [
					{
						"choiceId": "0",
						"option": "Ask Jasmin to heal the group and set up a defense barrier",
						"outcome": "<span class=\"characterName\">Jasmin:</span> I'll heal you guys first then we can move on to an attack.<br><span class=\"characterName\">Llewellyn:</span> There won't be much room to plan an effective attack though.<br> <span class=\"characterName\">Jasmin:</span> I know, the mana between all of us should be enough for one more transformation. <i> jasmin heals the group</i> <br><span class=\"characterName\">Zanele:</span> Thank you <i>She nods.</i><br><span class=\"characterName\">Mthi:</span> Collectively we should have enough mana now to hold off.<br> <span class=\"characterName\">Jasmin:</span> Okay <i> The group activates a defensive barrier around them.</i> This should hold.",
						"character1": "all",
						"character2": "Images/cloakedFigureBack.webp",
						"event": "none"
					},
					{
						"choiceId": "1",
						"option": "Ask Llewellyn to transform into a Titan and strike the enemy",
						"outcome": "<span class=\"characterName\">Llewellyn:</span> There is only one way to get through: full force.<br><span class=\"characterName\">Mthi:</span> That's took risky though, you might not make it.<br><span class=\"characterName\">Llewellyn:</span> That mana field is not going anyway anytime soon.<br><span class=\"characterName\">Tino:</span> He's got a point, if we combine the attack force with a rip through time maybe we can deal enough damage.<br><span class=\"characterName\">Mthi:</span> I'll guide you incase things get...messier. <br><i>Both Llewellyn and Tino nod</i>",
						"character1": "all",
						"character2": "Images/cloakedFigureBack.webp",
						"event": "none"
					},
					{
						"choiceId": "2",
						"option": "Ask Mthi to hypnotize the enemy",
						"outcome": "<span class=\"characterName\">Mthi:</span> Somehow they've managed to dodge all my arrows till this point. Maybe if I try to gain control of them even just for a second. <br><span class=\"characterName\">Zanele:</span> Don't you think that they are too powerful for mind control? <br> <span class=\"characterName\">Jasmin:</span> Yea we couldn't land a single physical attack, mental attacks are another story. <br> <span class=\"characterName\">Mthi:</span> It's worth a shot... and I always take mine. <i>Mthi smirks </i>. <br> <span class=\"characterName\">Zanele:</span>... Just don't die.",
						"character1": "all",
						"character2": "Images/cloakedFigureBack.webp",
						"event": "none"
					},
					{
						"choiceId": "3",
						"option": "Ask Tino stop time, giving the group enough time to escape the battlefield",
						"outcome": "<span class=\"characterName\">Tino:</span> Maybe we just need a good amount of time to get out of this mess. <br> <span class=\"characterName\">Llewellyn:</span> What about our allies? <br><span class=\"characterName\">Tino:</span> There won't be enough time... <br> <span class=\"characterName\">Zanele:</span> If that's a choice we must make...<br> <span class=\"characterName\">Tino:</span> Nothing else needs to said. <i>Tino stops time </i>",
						"character1": "all",
						"character2": "Images/cloakedFigureBack.webp",
						"event": "none"
					},
					{
						"choiceId": "4",
						"option": "Ask Zanele to burn the battlefield, losing allies but ensuring the enemy is gone",
						"outcome": "<br> <span class=\"characterName\">Zanele:</span> We need to get out of this, one way or the other. <br> <span class=\"characterName\">Jasmin:</span> And you are suggesting? <br> <span class=\"characterName\">Zanele:</span> Using Inferno around us, we can ensure that the enemy is gone but - <br> <span class=\"characterName\">Mthi:</span> That flame will also devour everything else outside of the protective circle. <br> <span class=\"characterName\">Zanele:</span> Yes. <br> <span class=\"characterName\">Jasmin:</span> At this point- <br> <span class=\"characterName\">Tino:</span> We need to ensure that they are stopped, no matter the cost. <br> <span class=\"characterName\">Zanele:</span> Okay... <i> Zanele lights the circle and everyone steps inside </i>.",
						"character1": "all",
						"character2": "Images/cloakedFigureBack.webp",
						"event": "none"
					}
				]
			},
			{
				"branchId": "branch4",
				"text": "<span class=\"characterName\">Cloaked Figure:</span> So That's It?!?",
				"character1": "all",
				"character2": "Images/cloakedFigureFront.webp",
				"event": "skipChoices",
				"choices": [
					{
						"choiceId": "0",
						"option": "",
						"outcome": "<span class=\"characterName\">Cloaked Figure:</span> The so-called mighty Five... hiding behind barriers instead of facing me head-on? <i> With a single tap, the Cloaked Figure shatters the protective field into a cascade of glittering fragments.</i>.Your cowardice is laughable. .<br><i>In the blink of an eye, the enemy vanishes, reappearing inches from your face.</i><br> <span class=\"characterName\">Cloaked Figure:</span> I suppose I'll just cut off your heads, then.",
						"character1": "all",
						"character2": "Images/cloakedFigureFront.webp",
						"event": "none"
					},
					{
						"choiceId": "1",
						"option": "",
						"outcome": "<span class=\"characterName\">Llewellyn:</span> Now! <br> Llewellyn roars as he transforms into a towering Titan, his every move supercharged by Tino's time magic, making him a blur of speed and power. Together, they launch a relentless assault of attacks on the cloaked figure, each attack crashing down with earth-shaking force. The cloaked figure remained unscaled, dodging at faster speeds. Llewellyn raises his colossal fist for a final strike, slamming it down with all his might. The ground trembles, but the cloaked figure meets the blow with a single hand, stopping the attack effortlessly. <br> <span class=\"characterName\">Cloaked Figure:</span> Hmm....  you done? <br> The group rallies together, charging into another fierce battle, ready to face the enemy once more.",
						"character1": "Images/Assets/Titan Terror.webp",
						"character2": "Images/cloakedFigureFront.webp",
						"event": "none"
					},
					{
						"choiceId": "2",
						"option": "",
						"outcome": "<span class=\"characterName\">Mthi:</span> Just need the perfect angle.<i>She dashes through the chaos, weaving effortlessly between enemies, her eyes locked on the cloaked figure.</i> <br><span class=\"characterName\">Cloaked Figure:</span> Mthi... perhaps you’ll prove to be a worthy opponent. <br> <span class=\"characterName\">Mthi:</span> Can't say the same for you. <i>She fires an illusionary arrow that splits into a barrage of identical arrows, each one indistinguishable from the original.</i> <br>The cloaked figure, unphased, snatches the real arrow mid-air with chilling precision.<br><span class=\"characterName\">Cloaked Figure:</span> Let me guess... now comes the hypnosis?<i> A sinister grin spreads across their face, laced with dark intent.</i> <br><span class=\"characterName\">Mthi:</span> <i>Mthi reaches out to seize control of the figure's mind, but instead, she’s violently pulled into a whirlwind of her darkest nightmares. Fear floods her senses as her worst terrors rise to the surface, drowning her in a horrifying reality she can't escape.</i> <br> <span class=\"characterName\">Llewellyn:</span>  Mthi! Change of plan - attack head on. <i>Without hesitation, the group surges forward, weapons drawn, charging into another deadly clash with the enemy, ready to face whatever chaos awaits.</i> ",
						"character1": "Images/eye2.webp",
						"character2": "Images/cloakedFigureFront.webp",
						"event": "none"
					},
					{
						"choiceId": "3",
						"option": "",
						"outcome": "<span class=\"characterName\">Tino:</span> A second is enough to change this.<i>The sky darkens, drained of all color, as He slams his hands together with a thunderous force, halting the flow of time itself. Everything freezes in place, except for the group, suspended in the eerie stillness of the world around them.</i> <br><span class=\"characterName\">Jasmin:</span> Let's go. <i> She opens a portal to place she has visisted, allowing for the group to find safe closure there.</i>",
						"character1": "Images/timekeeper.webp",
						"character2": "Images/cloakedFigureFront.webp",
						"event": "none"
					},
					{
						"choiceId": "4",
						"option": "",
						"outcome": "<span class=\"characterName\">Zanele:</span> Yes, that's it. <i>Zanele snaps her fingers, igniting a spark that erupts into a roaring inferno. Flames spiral outward, devouring everything in their path. Smoke chokes the air, and the heat is suffocating, leaving behind only the charred scent of scorched earth and burning flesh as the fire consumes all on the battleground.</i>",
						"character1": "Images/storyInferno.webp",
						"character2": "Images/cloakedFigureFront.webp",
						"event": "none"
					}
				]
			},
			{
				"branchId": "branch5",
				"text": "",
				"character1": "none",
				"character2": "none",
				"event": "checkChoices",
				"choice": 1,
				"values": [0, 1, 2],
				"endBranch": 7,
				"choices": []
			},

			{
				"branchId": "branch6",
				"text": "",
				"character1": "all",
				"character2": "Images/cloakedFigureFront.webp",
				"event": "triggerBattle",
				"winnable": false,
				"startEnemies": [0],
				"spawnEnemies": [],
				"choices": []
			},
			{
				"branchId": "branch7",
				"text": "As your vision clears, you feel the jagged chill of the hard, cold ground beneath you, echoing the icy dread settling in your bones. A rhythmic pounding fills your ears—your own heartbeat, hammering faster with each passing second. Shadows shift, and a dark figure steps closer, their silhouette seeming to blend into the very void around them. <br><span class=\"characterName\">Cloaked:</span> Look at you — fallen, broken. You've lost more than just this battle. Prepare to watch everything you hold dear slip away … one by one. <br> Their voice is a low, menacing whisper, each word twisting like a blade in your heart. You feel a suffocating weight as the realization dawns—this isn’t just defeat; it’s a reckoning, the merciless unraveling of everything you fought for. In the shadows, you see flashes of familiar faces—your friends, your allies—each one flickering like a candle about to be snuffed out. The Cloaked Figure’s presence presses down, clouding the air with a foreboding that chills you to your core. This isn’t just an end; it’s your end, at the hands of someone who you held close to you.",
				"character1": "all",
				"character2": "Images/The Sixth Atlas.webp",
				"event": "none",
				"choices": []
			},
			{
				"branchId": "branch8",
				"text": "......",
				"character1": "none",
				"character2": "none",
				"event": "none",
				"choices": []
			},
			{
				"branchId": "branch9",
				"text": "<span class=\"characterName\">Passion:</span> Hey there, developer Tino here... No not in game Tino, Tino from the past... or in your case the present... but also the future ? Anyway, Thanks for taking your precious time to give The Atlas Six a try. Currently the game is still in early development so there are prone to be bugs but fear not, they don't bite. Feel free to let me know if you encounter any bug that does bite though <a href=\"mailto:tinomhedziso21@gmail.com\">tinomhedziso21@gmail.com</a>.",
				"character1": "none",
				"character2": "Images/timekeeper.webp",
				"event": "none",
				"choices": []
			},
			{
				"branchId": "branch10",
				"text": "<span class=\"characterName\">Passion:</span> The narrative of The Atlas Six is centered around 6 heroes... whom the 6th one may or may not betray you as you have just seen. The idea was constructed around a fictional storyline my friends <i>[who are the in game characters]</i> and I came up with. That being said each character is meant to represent a subset of that friend but the actions performed in the world by Atlas characters does not completely reflect actions my friends would actually do.",
				"character1": "none",
				"character2": "Images/timekeeper.webp",
				"event": "none",
				"choices": []
			},
			{
				"branchId": "branch11",
				"text": "<span class=\"characterName\">Passion:</span> The world you find yourself is a strange one - to say the least. It is one that is constantly changing based on Your choices such as this timeline where your 6th friend betrays you, whoever that is. Certain actions will have certain consequences that may or may not align with your desire, certain characters will have certain story narratives and certain.... blah blah blah you get the idea. Morally right choices may not be the best ones overall and vice versa so think carefully. Experience is the best teacher so I will let you play now 😄🦚 - <i>Enjoy</i>",
				"character1": "none",
				"character2": "Images/timekeeper.webp",
				"event": "none",
				"choices": []
			},
			{
				"branchId": "branch12",
				"text": "",
				"character1": "",
				"character2": "",
				"event": "changeScene",
				"background": "Bloomhaven",
				"choices": []
			},
			{
				"branchId": "branch13",
				"text": "Tino’s mind clears, his senses snapping back to reality, only to find himself staring down the gleaming tip of an arrow aimed directly at his head.. <br> <span class=\"characterName\">Mthi:</span> Rise an shine sleepy head. <i>Mthi’s voice rings out, and a mischievous grin lights up her face, clearly savoring the moment.</i> <br><span class=\"characterName\">Tino:</span> Go on, release it… I dare you. Your aim’s about as good as the guys who try to shoot <i>their shot</i> at you. <i>He laughs at the challenge sparking between them</i>. <br> <span class=\"characterName\">Mthi:</span> How is it possible to be both the fastest and the slowest here? <i> Her bowstring pulls back, just a hair’s breadth from releasing.</i> <br> <span class=\"characterName\">Tino:</span> One second is all I need.<i> Tino raises his hand, fingers resting against the hilt of his blade - </i>. <br>Before the tension thickens any further, Zanele steps forward, casting a warning glance between them. <br> <span class=\"characterName\">Zanele:</span> Knock it off you two, we don't want any problems here, especially in Bloomhaven.",
				"character1": "Images/timekeeper.webp",
				"character2": "Images/eye.webp",
				"event": "none",
				"choices": []
			},
			{
				"branchId": "branch14",
				"text": "Bloomhaven is a charming inn tucked in the heart of Aurelia, exuding warmth and inviting tranquility to all who pass through. Known for its namesake lanterns that emit a soft, golden glow, the inn’s cozy ambiance is perfect for weary travelers and townsfolk alike. The inn’s flower-laden windows and ivy-wrapped walls reflect Aurelia’s affinity for nature, with scents of lavender drifting through the air. <br><span class=\"characterName\">Jasmin:</span> Bloomhaven, I remember coming here as a girl. <br> <span class=\"characterName\">Tino:</span> So you are not a girl anymore ? <br> <span class=\"characterName\">Jasmin:</span> ...A <i>Young</i> girl... <i> Tino </i>. <br>  Where is Llewellyn anyway? <br> <span class=\"characterName\">Tino:</span> Probably training with the royal guard or things of that nature. I don't know. <br> <span class=\"characterName\">Mthi:</span> In that case, I am going to find a game to play. <i> She starts searching for a game host. </i> <br> <span class=\"characterName\">Zanele:</span> Meanwhile I'll get us the usual drinks.",
				"character1": "Images/healer.webp",
				"character2": "Images/phoenix.webp",
				"event": "none",
				"choices": []
			},
			{
				"branchId": "branch15",
				"text": "As Zanele walks towards the innkeeper, her eyes catch sight of two figures standing side-by-side, shrouded in the warm light. They each wear steampunk-inspired attire, detailed with gears, buckles, and straps in shimmering brass and worn leather. Their outfits, however, are primarily a deep, rich shade of purple, blending into the twilight hues around them. The first figure, taller with a sturdy posture, is a man whose presence feels timeless. His face is partially shadowed beneath a hat. His eyes hold a far-off gaze, as though he’s not entirely present, one foot grounded in this moment and the other in a place beyond comprehension. <br> Beside him, the second figure is more slight and nimble, exuding a sharp, clever energy. This one—the shorter, with a mischievous gleam in her eye — has an air of wit and keen observation, her expression is one of amusement. She glances toward her companion with a knowing smirk, her attention flicking from him to the world around with effortless curiosity. They notice Zanele but don’t address her, continuing their debate, their words cryptic, laced with double meanings and a weight she can't quite place. For now, they refer only to vague ideas—life, choices, paths, knowledge—dancing around deeper subjects that feel just out of reach, waiting for Zanele to uncover their true purpose in her journey.",
				"character1": "Images/phoenix.webp",
				"character2": "Images/Characters/The Twins-purple.webp",
				"event": "none",
				"choices": []
			},
			{
				"branchId": "branch16",
				"text": "<span class=\"characterName\">Twin 1:</span>To live is to understand the world around you, the roads that twist and turn, the choices branching into every possibility. Without knowing the pathways before us, we become lost, endlessly wandering. Life is best understood as a series of external paths to traverse, and mastery comes from navigating them well. Only through awareness of our surroundings and understanding of the world’s patterns can we move forward with certainty. Those who ignore the greater map risk being swept away by currents they cannot see. <br> The female twin nods with her eyes closed, assimilating her brother's point while conjuring her own. <br><span class=\"characterName\">Twin 2:</span> And yet, dear twin, all the paths in the world are meaningless if one doesn't know oneself. To explore the outer world without examining one's own depths is to chase reflections, shadows cast by the soul. Knowing who you are—your strengths, your weaknesses, your friends, your enemies—this is the true anchor. How can one stand firm in the shifting sands of fate without first understanding the inner workings of the heart? <br><span class=\"characterName\">Twin 1:</span>To focus solely inward is to miss the infinite beauty and danger of the world beyond. If we know ourselves but not the world we live in, we become trapped within our own minds, circling familiar thoughts. It is the journey outward that shapes us, just as we shape the journey. <br> With a patient smile, the female twin looks at Zanele then answers with her response. <br><span class=\"characterName\">Twin 2:</span> Perhaps. But it is only through looking within that we find the tools to face the world without. A map may guide your steps, but it cannot help you understand why you walk or who walks with you. True mastery comes from learning to see with the heart as well as the eye. . <br> They fall silent, each pondering the other’s words, as Zanele watches them in quiet fascination, sensing that this is no ordinary debate but a glimpse into something much deeper.",
				"character1": "Images/phoenix.webp",
				"character2": "Images/Characters/The Twins-purple.webp",
				"event": "none",
				"choices": []
			},
			{
				"branchId": "branch17",
				"text": "<span class=\"characterName\">Twin 2:</span>Consider a book, dear Chronos. Some are open, easy to read, their pages clear to anyone who looks. But others hide their truths, requiring patience, insight, and time to understand. And just as we learn to read others, we must also learn to read ourselves, to turn our own pages and understand the story we’re telling. Without this inner knowledge, how can we interpret the world’s challenges, let alone respond to them? <br><span class=\"characterName\">Twin 1:</span> Quiet so indeed Caelia - <i>They both gaze at you, allowing the purple radiance of their magic to dissipate into nothingness, granting you passage.</i> Ah, but we have a guest, tell us <i> Zanele - </i> <br> A wave of confusion fills your mind; you've just learned their names, yet they speak yours as if it were known to them for ages. <br> <span class=\"characterName\">Caelia:</span> —what do you believe is more important? <br><span class=\"characterName\">Chronos:</span> Is it knowing oneself? <br><span class=\"characterName\">Caelia:</span> Or understanding the world around?",
				"character1": "Images/phoenix.webp",
				"character2": "Images/Characters/The Twins-purple.webp",
				"event": "none",
				"choices": []
			},
			{
				"branchId": "branch18",
				"text": "",
				"character1": "Images/phoenix.webp",
				"character2": "Images/Characters/The Twins.webp",
				"event": "visualChoices",
				"choices": [
					{
						"choiceId": "0",
						"imgSrc": "Images/Choices/Knowing Yourself.webp",
						"option": " Knowing yourself",
						"outcome": "<span class=\"characterName\">Caelia:</span> Well, well, it seems my words have had their effect. <i>She tilts her head slightly, her smile still warm but reserved, as if she's trying to hide her satisfaction.</i> <br><span class=\"characterName\">Caelia:</span> I must admit, I wasn't sure how you'd choose, but… I suppose I shouldn't be surprised. <br> <span class=\"characterName\">Chronos:</span>She doesn’t say it, but she’s pleased. <i> His voice carries the faintest trace of amusement, though his tone is as calm and measured as ever. He stands a little further away, arms crossed, watching the interaction with interest.</i> <br><span class=\"characterName\">Caelia:</span> Take this <i> She hands takes out a map  and hands it over with a quiet nod, her eyes scanning your face for a reaction.</i> It's not just a map of the lands; it's a map of what's to come. Follow its paths, and you’ll find more than just landmarks. <br><span class=\"characterName\">Chronos:</span>The path ahead is uncertain, but the map ... is certain. Hmmm might as well also hand over this. <br> He reaches into his cloak and pulls out an ancient book, its cover glowing faintly with an ethereal light. The worn leather feels surprisingly warm, as if it recognizes your touch. As you open it, the pages shimmer with energy, whispering secrets in languages unknown, while the illustrations seem to come alive. It’s both a guide and a challenge—offering wisdom yet guarding dangerous truths. The book feels like a paradox, a trusted companion and a formidable foe, revealing only what it chooses. ",
						"character1": "Images/phoenix.webp",
						"character2": "Images/Characters/The Twins.webp",
						"gradient": "linear-gradient(0deg, rgba(127,59,66,1) 0%, rgba(28,20,41,1) 100%)",
						"event": "none"
					},
					{
						"choiceId": "1",
						"imgSrc": "Images/Choices/Knowing The World.webp",
						"option": "Knowing the world",
						"outcome": "<span class=\"characterName\">Caelia:</span> So, you've made your choice. But the world you're stepping into... well, it's more than what meets the eye. <br><span class=\"characterName\">Chronos:</span> You will need more than instinct to understand the world around you. This will help. <br>He reaches into his cloak and pulls out a book, its cover glowing faintly with an ethereal light. The worn leather feels surprisingly warm, as if it recognizes your touch. As you open it, the pages shimmer with energy, whispering secrets in languages unknown, while the illustrations seem to come alive.It’s both a guide and a challenge—offering wisdom yet guarding dangerous truths. The book feels like a paradox, a trusted companion and a formidable foe, revealing only what it chooses. <br><span class=\"characterName\">Chronos:</span> This is the Encyclopedia of the Known World. It holds the knowledge of many lands, cultures, creatures, and even some secrets... if you know where to look. <br><span class=\"characterName\">Caelia:</span>  It will open your eyes to things you never thought possible. The more you know, the better you'll understand the path you’re on. <br><span class=\"characterName\">Chronos:</span>The truth is rarely exciting, but it is always necessary. <br> Caelia also hands you a map, revealing paths to places you've never encountered before. <br><span class=\"characterName\">Caelia:</span> You'll need that as well.",
						"character1": "Images/phoenix.webp",
						"character2": "Images/Characters/The Twins.webp",
						"gradient": "linear-gradient(180deg, #dc781f, #b8860b, #8b4513)",
						"event": "none"
					}
				]
			},
			{
				"branchId": "branch19",
				"text": "<span class=\"characterName\">Zanele:</span> Hold on, this is all well and good, but who are you people, and how do you even know my name? <br><span class=\"characterName\">Chronos:</span> Heh, that’s the spirit—always ask when you're not told. <br> With a dismissive wave, they cast the purple barrier of energy once more, sealing you off from further interaction. Unfazed, they continue their intricate debate as they stride out of the inn, leaving you in their wake.<br><span class=\"characterName\">Caelia:</span> Do you think the others would have chosen differently? Maybe Mthi? <br><span class=\"characterName\">Chronos:</span> Perhaps Llewellyn, but I can’t say for certain about Jasmin.. <br> Zanele tries to follow them, eager for answers, but in the blink of an eye, they disappear, leaving no trace behind.",
				"character1": "Images/phoenix.webp",
				"character2": "Images/Characters/The Twins-purple.webp",
				"event": "none",
				"choices": []
			},

			{
				"branchId": "branch20",
				"text": "Under the warm glow of Bloomhaven’s lamplight, Jasmin and Elenora share a rare moment of peace. Though they have walked different paths, the magic they once learned together still binds them. Jasmin, whose hands have healed countless wounds within the Atlas Six, feels a quiet nostalgia here, with Elenora's familiar smile across the table. <br><span class=\"characterName\">Elenora:</span> You’ve come a long way, Jasmin, <i>Elenora says, pouring another cup of tea</i> I hear the Atlas Six has made quite a name for themselves. <br> Jasmin smiles, fondly recalling the adventures and bonds she’s forged, yet grateful for the steady friendship that Nora has always offered: one that stretches back to childhood training sessions and letters exchanged over the years. Their lives may be different now, but in moments like these, it’s as if nothing has changed at all.<br><span class=\"characterName\">Jasmin:</span> Yes, we’ve been through more than I ever imagined... battles, journeys, mysteries unraveling one after another. But it’s the little things I miss most, like these quiet moments. <i>She says, meeting Elenora's gaze.</i> <br><span class=\"characterName\">Elenora:</span> You’re the healer, after all. The one who’s always making sure everyone else’s spirits are intact. <i>She leans back thoughtfully, the firelight casting warm shadows on her face. </i> I suppose that hasn’t changed since we were kids, huh? <br><span class=\"characterName\">Jasmin:</span> No, I guess it hasn’t. And you Nora, hehe — you’re still as sharp as ever, I bet. I remember how you’d always get ahead in our lessons, even when I struggled to keep up.<br> Elenora raising an eyebrow while grinning at you.<br><span class=\"characterName\">Elenora:</span> Oh please, your flattery won’t get you an extra training session with me. <br> You put on a mock frown, as if truly let down. ",
				"character1": "Images/healer.webp",
				"character2": "Images/Characters/Elenora.webp",
				"event": "none",
				"choices": []
			},
			{
				"branchId": "branch21",
				"text": "<span class=\"characterName\">Elenora:</span> What would you like us to talk about ?",
				"character1": "Images/healer.webp",
				"character2": "Images/Characters/Elenora.webp",
				"event": "choiceLoop",
				"choices": [
					{
						"choiceId": "0",
						"option": "Aurelia and the World",
						"outcome": "<span class=\"characterName\">Jasmin:</span> Aurelia is still as vibrant as it ever was. <br> <span class=\"characterName\">Elenora:</span> It remains ever so alive, the kingdom and its folk. We’re holding strong, despite the challenges. The heart of Aurelia beats in its people, as always.<br><span class=\"characterName\">Jasmin:</span> What kind of challenges have you been facing lately? <br><span class=\"characterName\">Elenora:</span> Oh, you know, the usual... There are whispers of unrest, small pockets of rebellion, but nothing we can't handle. The land itself still flourishes, but with the growing tensions between kingdoms, it’s harder to maintain the same peace we once had. It’s not just the politics, but the rising threats from beyond our borders, too. <br><span class=\"characterName\">Jasmin:</span> I thought we were all allies... <br><span class=\"characterName\">Elenora:</span> We were. And many still are. But not all share the same vision for the future of the kingdoms. Some are growing bolder, others more fearful. <i>Eryndor </i>, the land of fierce stone titans, has always sought to expand its horizons. More often than not, this has led them into conflict with <i> Kurohana </i>, the land hidden among the mountains with it's graceful traditions. Who would have thought that stone and fire — two elements that should naturally find balance — would be at odds? It's a strange time. The winds of change are swirling, Jas.",
						"character1": "Images/healer.webp",
						"character2": "Images/Characters/Elenora.webp",
						"event": "none"
					},
					{
						"choiceId": "1",
						"option": " Elenora's family",
						"outcome": "<span class=\"characterName\">Jasmin:</span> Your family, how are they? <br><span class=\"characterName\">Elenora:</span> Oh, they’re doing well enough. You know how it is—busy with their duties. My father’s been working on his latest project in the city, and my mother ...well, she’s always involved in one of her gardens. It’s hard to get a quiet moment with her sometimes. <br> <span class=\"characterName\">Jasmin:</span> Sounds like the usual. I’m sure they’re all proud of you, though. Especially your mother — she spends so much time in the garden, but I’m sure you’re the thing she’s most proud of nurturing. <br><span class=\"characterName\">Elenora:</span> Thing? from flattery to insults huh Jasmin ? <i> she playfully winks at you </i> Yeah, I get that. My independence grows from the seeds my parents have planted, all the effort they've put in to help me blossom into who I am today.",
						"character1": "Images/healer.webp",
						"character2": "Images/Characters/Elenora.webp",
						"event": "none"
					},
					{
						"choiceId": "2",
						"option": "Current Affairs",
						"outcome": "<span class=\"characterName\">Jasmin:</span> How are the royals Nora? <br><span class=\"characterName\">Elenora:</span> Girl <i> please </i>,when have you ever cared about politics? <i>A slight shadow of concern crosses Elenora's face. She leans in close, her eyes narrowing as she examines yours.</i>. Wait... you're not a shifter, are you?<br> <span class=\"characterName\">Jasmin:</span> Oh trust me, I still don't, but what I do care about are the decisions made by the higher ranks. Those affect me and the people around me. <br><span class=\"characterName\">Elenora:</span> Fair enough, you always did care more about people than power. <i>Elenora gives a small, knowing smile before her expression grows more serious.</i> <br><span class=\"characterName\">Elenora:</span> Aurelia is still thriving, Jas. The kingdom itself is stable for now, but there are growing concerns. The unrest is there, simmering beneath the surface. Small protests here and there, mostly about the royals’ handling of trade agreements and the distribution of resources. Nothing major, yet, but it could escalate if they don't handle it right. <i>Her voice softens, but there's a hint of caution in her tone.</i> <br> If things do take a turn for the worse... we could see something far more serious. The possibility of war is becoming harder to ignore, and if that happens, healers like us might be forced to stay in Aurelia. We’d be bound to the kingdom, regardless of the personal cost. It’s a future none of us want to face, but it’s something we’ll have to prepare for if the royals can’t keep the peace.",
						"character1": "Images/healer.webp",
						"character2": "Images/Characters/Elenora.webp",
						"event": "none"
					},
					{
						"choiceId": "3",
						"option": "Combat",
						"outcome": "<span class=\"characterName\">Jasmin:</span> How do you find the world's battles Nor- <i> before you finish, Elenora interjects </i> <br> <span class=\"characterName\">Elenora:</span> You’ve heard the tales—how our battles are more than just swinging swords and casting spells, right? In this world, combat is as much about strategy as it is about power. The clash of blades and the weave of magic are just the beginning. <br> Elenora looks over her shoulder, scanning the room, then leans in a bit closer, her voice lowering, almost as if sharing a secret. <br><span class=\"characterName\">Elenora:</span> The battlefield is a dance. You take your turn, then the enemy takes theirs. You can either strike with all your might—attack—or you can tend to your own wounds and heal those around you. Sometimes, the best offense is a strong defense, so we’ve got ways to bolster ourselves. With the right focus, you can strengthen your body or sharpen your mind—boosting your health and energy for what's to come. It’s a delicate balance. <i>Her eyes sparkle with a glint of excitement, revealing the possibilities that lie ahead.</i> <br><span class=\"characterName\">Elenora:</span> But it doesn't stop there. As you journey through this land, you’ll unlock new abilities, new ways of fighting. Our classes aren't set in stone, Jas. A healer, like you, could one day wield the forbidden arts of blood magic or tap into the vampiric energies of your foes. Instead of drawing from mana, you could steal life from your enemies, turning their strength into your own. And that’s just one example. <br><span class=\"characterName\">Jasmin:</span> Nora - <i> You try to stop her, but she presses on, undeterred, her voice unwavering.</i> <br><span class=\"characterName\">Elenora:</span> Imagine this: <i> She grabs your hand, her gaze drifting to the distant horizon, </i> synergies. The Atlas Six working together, combining their strength, magic, and willpower for a devastating super attack. Picture it: you and Mthi, weaving your powers together, striking down an enemy in a single, unstoppable blow. Each of us is a thread in a greater tapestry, Jas. Alone, we are powerful. Together, we are unstoppable. <br><span class=\"characterName\">Jasmin:</span> Nora, that’s a lot to take in. Thank you, but... I think I need a moment to process all of that. <br><span class=\"characterName\">Elenora:</span>Heh, You asked for it. <i>She flashes a knowing smile, clearly amused by the amount of information she just unloaded on you.</i>",
						"character1": "Images/healer.webp",
						"character2": "Images/Characters/Elenora.webp",
						"event": "none"
					},
					{
						"choiceId": "4",
						"option": "Relationships",
						"outcome": "<span class=\"characterName\">Jasmin:</span> So, any hopeful admirers, Nora? <br><span class=\"characterName\">Elenora:</span> You, of all people, are really asking me this? <i>She raises a brow and her face becomes emotionless.</i> <br> Her tone is light, but there's a spark of challenge in her eyes. Sensing you may have hit a nerve, you try to backtrack. <br><span class=\"characterName\">Jasmin:</span> I mean—no offense, I was just curious— <br> Before you can continue, she narrows her gaze, crossing her arms in exaggerated indignation. <br><span class=\"characterName\">Elenora:</span> Curious, were you? <br> She lets the silence hang a moment too long, her expression unreadable. <br><span class=\"characterName\">Jasmin:</span> Nora... <br>Just as you start to wonder if you've really crossed a line, her face breaks into laughter. Elenora’s laughter rings out, filling the air with a warmth that diffuses any tension. <br><span class=\"characterName\">Elenora:</span> Relax, Jas. I’m just messing with you. As for romance... no one at the moment. My focus is on training, becoming someone worthy of our kingdom. <br><span class=\"characterName\">Jasmin:</span> Nah girl I can never with you. Because, honestly, every guy I meet either wants to marry me or ‘get to know me better’ - which, let’s be real, we both know what that means. <br> Elenora bursts out into more laughter. <br><span class=\"characterName\">Jasmin:</span> And I mean, not even marriage, really. Half of them can barely hold a conversation before they’re already planning our wedding in their heads. <br> Elenora’s laughter fades, and her expression shifts, her eyes narrowing as if she’s genuinely considering the weight of your words.<br><span class=\"characterName\">Elenora:</span>But... if this is your way of asking me out, Jas, well, maybe I’d make an exception.",
						"character1": "Images/healer.webp",
						"character2": "Images/Characters/Elenora-expressionless.webp",
						"event": "none"
					},
					{
						"choiceId": "5",
						"option": "End Conversation",
						"outcome": "As the conversation winds down, Elenora steps forward, her eyes warm as she pulls you into a tight embrace. The familiar scent of cedar fills the air, bringing back memories of the long nights spent laughing and dreaming together. <br><span class=\"characterName\">Elenora:</span> Even in all the chaos, we somehow always find our way back to each other. <br>You both linger in the moment, each lost in the memory of shared adventures and quiet moments under the Aurelia stars. <br><span class=\"characterName\">Elenora:</span> I’ll see you again, Jasmin. Don’t go finding trouble without me, alright? <br><span class=\"characterName\">Jasmin:</span> I won't Nora. <i> You feel a sense of emptiness as she leaves the inn. </i> ",
						"character1": "Images/healer.webp",
						"character2": "Images/Characters/Elenora.webp",
						"event": "none"
					}
				],
				"closingChoice": 5
			},

			{
				"branchId": "branch22",
				"text": "Mthi's search is resolved shortly as she finds a game host. Analysing the table, the game is simple: A memory game that requires you to flip the cards creating pairs until you match all 18 cards. <br> <span class=\"characterName\">Game Host:</span> Tis an easy game, just match the cards that's all. What do you say to a round or two? <br> <span class=\"characterName\">Mthi:</span> Hmmm, okay, it's a good way to kill time I guess.",
				"character1": "Images/eye.webp",
				"character2": "Images/Characters/Game Host.webp",
				"event": "none",
				"choices": []
			},
			{
				"branchId": "branch23",
				"text": "",
				"character1": "none",
				"character2": "none",
				"event": "triggerGame",
				"game": "MemoryGame",
				"choices": []
			},
			{
				"branchId": "branch24",
				"text": "<span class=\"characterName\">Game Host:</span> A sharp eye indeed... How about a wager: If you win, I’ll part with my most treasured possession. But if you lose... I’ll claim that exquisite instrument of yours. <br><span class=\"characterName\">Mthi:</span>And what exactly is this so-called treasured possession? <br><span class=\"characterName\">Game Host:</span>Oh, you’ll find out... once you’ve earned the right to see it. Now, shall we play?",
				"character1": "Images/eye.webp",
				"character2": "Images/Characters/Game Host.webp",
				"event": "none",
				"choices": []
			},

			{
				"branchId": "branch25",
				"text": "With unshakable confidence, she accepts the challenge. <br><span class=\"characterName\">Mthi:</span> Uh-huh... might as well go fetch whatever treasure you're hiding now. <i>Her hand glides over the cards on the table, poised to win. </i>. <br>But something feels... off. Mthi’s hand pauses as she notices the cards shifting beneath her fingers. No matter how carefully she plays, the images twist and change as if refusing to pair with any match, slipping through her grasp with every attempt. It’s as if the deck itself is alive, mocking her skill with an eerie magic. <br> <span class=\"characterName\">Game Host:</span> Something wrong ?<br>A hand lands firmly on her shoulder, and suddenly, the world goes silent. The birds outside cease their song, the air stills, and everything around them freezes in time.<br><span class=\"characterName\">Tino:</span>Oh, look at that... He's cheating. <br><span class=\"characterName\">Mthi:</span>Not surprised. Animation magic — brings objects to life. Hold on. <i>She waves her hand across the cards, dismantling the illusion with a decisive sweep. The cards flicker, and a new power shimmers across the table. </i> <br><span class=\"characterName\">Tino:</span>Interesting choice of play.",
				"character1": "Images/eye.webp",
				"character2": "Images/timekeeper.webp",
				"event": "none",
				"choices": []
			},
			{
				"branchId": "branch26",
				"text": "",
				"character1": "Images/eye.webp",
				"character2": "Images/The Sixth Atlas.webp",
				"event": "triggerGame",
				"game": "MemoryGame-2",
				"choices": []
			},
			{
				"branchId": "branch27",
				"text": "As you lay down the final pair of cards with an effortless flourish, the Game Host's face twists in disbelief, his composure shattered. <br><span class=\"characterName\">Mthi:</span> And done. <br><span class=\"characterName\">Game host:</span> But—no, that’s impossible!. <i> Rage and confusion flicker in his eyes as he glares at the cards, each one mocking him with its defiance. </i> <br><span class=\"characterName\">Game Host:</span> You cheated! <br><span class=\"characterName\">Mthi:</span> Right, right... imagine having to rig your own game and still losing. <br><span class=\"characterName\">Game Host:</span> You—cheater! <i>  He lunges, fist raised, but Mthi sidesteps effortlessly, his punch landing squarely on an unsuspecting bystander.</i> <br><span class=\"characterName\">Mthi:</span> So much for subtle exits. <br>Just then, Llewellyn strolls in, late as ever, with his usual nonchalant grin. <br><span class=\"characterName\">Llewellyn:</span> Hello humans - Huh? <br> His words hang unfinished as another bystander charges at him, shouting in fury. In an instant, chaos erupts, and the group braces themselves for the impending brawl.",
				"character1": "Images/eye.webp",
				"character2": "Images/Characters/Game Host.webp",
				"event": "none",
				"choices": []
			},
			{
				"branchId": "branch28",
				"text": "",
				"character1": "none",
				"character2": "none",
				"event": "triggerBattle",
				"winnable": true,
				"startEnemies": [1],
				"spawnEnemies": [],
				"choices": []
			},
			{
				"branchId": "branch29",
				"text": "Following the chaotic burst of action, the inn is ablaze with shouts and overturned tables as fists fly and drinks spill. The Game Host, now seething and vengeful, grabs a nearby chair, swinging it in Mthi’s direction. She ducks just in time, but not before another bystander takes the hit, adding to the pandemonium.As the group grapples with the chaos, the Game Host, now humiliated and vengeful, grabs a knife from a nearby table, sneering at Mthi. His eyes are filled with murderous intent, and he lunges toward her with reckless abandon. The group finds themselves at a critical choice, each path leading to a different outcome.",
				"character1": "Images/eye.webp",
				"character2": "Images/Characters/Game Host.webp",
				"event": "none",
				"choices": [
					{
						"choiceId": "0",
						"option": "Let him live",
						"outcome": "Mthi disarms the Game Host with a swift move, knocking the knife from his hand and forcing him to the ground. She looks down, calm but resolute. <br> <span class=\"characterName\">Mthi:</span> This isn't worth anyone’s life. Take this as a warning. <br> The Game Host stumbles back, humiliated and resentful, but alive. He sneers, vowing that Mthi and her group will pay for this insult, hinting at potential consequences down the line...",
						"character1": "Images/eye.webp",
						"character2": "Images/Characters/Game Host.webp",
						"event": "none"
					},
					{
						"choiceId": "1",
						"option": "Strike the final blow",
						"outcome": "Mthi pauses, taking in the desperation in the Game Host’s eyes. But this isn’t a look of regret or shame—only raw terror as he realizes his gamble has failed. Llewellyn steps forward, casting a glance at Mthi, whose expression is unreadable. Slowly, she nods, giving silent permission. Llewellyn raises his sword, and the Game Host’s face twists in silent protest, his voice catching as he whispers, <i>Please…</i> before the blade falls, ending him.",
						"character1": "Images/eye.webp",
						"character2": "Images/Characters/Game Host.webp",
						"event": "none"
					}
				]
			},
			{
				"branchId": "branch30",
				"text": "As the dust settles from the chaotic scuffle, the atmosphere in Bloomhaven turns tense. Lily, the innkeeper, stands behind the counter, arms crossed and a frown etched across her face. <br><span class=\"characterName\">Lily:</span> Enough! <i>  she exclaims, her voice cutting through the remnants of the brawl.</i> <br> <span class=\"characterName\">Lily:</span>I won’t have this ruckus in my inn. <br>The Group, still catching their breath from the unexpected fight, exchange glances, feeling the weight of her disappointment. <br>Lily continues, her irritation palpable.<br> <span class=\"characterName\">Lily:</span> You’ve disturbed my guests and wrecked my establishment. I can’t afford to have troublemakers like you here. It’s time for you to leave! <br>With a resigned nod, Mthi steps forward, attempting to diffuse the situation. <br><span class=\"characterName\">Mthi:</span> We didn’t mean to cause a scene, Lily. We were just— <br><span class=\"characterName\">Lily:</span>Just what? <i> She interrupts, her eyes narrowing</i>. Just playing games while destroying my peaceful haven? This isn’t a tavern for drunken brawls; it’s a place of respite. <br> The group’s morale dips as they realize their actions have consequences. They gather their belongings and shuffle toward the exit, feeling the weight of Lily’s anger.",
				"character1": "all",
				"character2": "Images/Characters/Lily.webp",
				"event": "none",
				"choices": []
			},
			{
				"branchId": "branch31",
				"text": "",
				"character1": "",
				"character2": "",
				"event": "changeScene",
				"background": "Outside Bloomhaven",
				"choices": []
			},
			{
				"branchId": "branch32",
				"text": "",
				"character1": "all",
				"character2": "none",
				"event": "skipChoices",
				"choices": [
					{
						"choiceId": "0",
						"option": "",
						"outcome": " The Atlas Six find themselves standing outside Bloomhaven in the cool night air, the door firmly closed behind them. The muffled sounds of laughter and conversation continue within, but they’re no longer welcome in the inn. The group exchanges a few uneasy glances, unsure of their next move. <br> <span class=\"characterName\">Mthi:</span> Well, that went well. <i>she says, brushing off a stray leaf from her cloak.</i><br> <i>Llewellyn shrugs, unfazed.</i> <br> <span class=\"characterName\">Llewellyn:</span>Can’t say it was unexpected. <br> <span class=\"characterName\">Tino:</span> Yeeaaa.. that was fun. <br> Jasmin, ever the voice of compassion, places a hand on Mthi's shoulder. <br> <span class=\"characterName\">Jasmin:</span> Violence isn’t always the answer. Sometimes mercy is the stronger path. <br> <span class=\"characterName\">Llewellyn:</span> Either way, we’re not welcome here anymore. We need to put some distance between us and Bloomhaven. <br> <i>He gestures toward the nearby forest, where the trees stand tall and dark, offering a concealed path away from Aurelia.</i> ",
						"character1": "all",
						"character2": "none",
						"event": "none"
					},
					{
						"choiceId": "1",
						"option": "",
						"outcome": "As the Atlas Six gather outside Bloomhaven, the air is heavy with tension and a mix of guilt and anger. The night feels colder, and the distant lights of the town seem to mock their predicament. Mthi tightens her cloak, her eyes scanning their surroundings, alert for any signs of pursuit. The group stands in silence for a moment, each processing the weight of what they’ve just done. <br> Suddenly, Llewellyn breaks the silence, his voice strained. <br> <span class=\"characterName\">Llewellyn:</span> We had no choice. He forced our hand. <br> <span class=\"characterName\">Jasmin:</span> We’ll need to lie low for now. The townsfolk… they may not understand what we did or why. <br> <span class=\"characterName\">Mthi:</span> Let's get going. The less attention we draw, the better. <br> She glances toward the woods on the edge of town, where the shadows seem to promise safety.",
						"character1": "all",
						"character2": "none",
						"event": "none"
					}
				]
			},
			{
				"branchId": "branch33",
				"text": "The party agrees to venture into the forest, seeking a temporary camp where they can regroup and plan their next move. As they fade into the darkness, the reality of their decision settles over them, binding them even closer, for better or for worse.",
				"character1": "all",
				"character2": "none",
				"event": "none",
				"choices": []
			},
			{
				"branchId": "branch34",
				"text": "",
				"character1": "none",
				"character2": "none",
				"event": "changeScene",
				"background": "Goblin forest",
				"choices": []
			},

			{
				"branchId": "branch35",
				"text": "<span class=\"characterName\">Tino:</span> Why are we in a creepy dark forest at night again ? Seems like we are just asking to be killed at this point. <br><span class=\"characterName\">Zanele:</span> You're not afraid aren't you Tino? Who knows what we will encounter... <br> <span class=\"characterName\">Mthi:</span> I agree with Tino, maybe we can try a different inn... Aurelia is big. <br> <span class=\"characterName\">Llewellyn:</span> Word spreads like wildfire unfortunately, We best lay low for now.",
				"character1": "all",
				"character2": "none",
				"event": "none",
				"choices": []
			},
			{
				"branchId": "branch36",
				"text": "<span class=\"characterName\">Jasmin:</span> This forest ... it may be our only shelter, but it feels like something’s lurking.<br><span class=\"characterName\">Llewellyn:</span> We don’t have many options. It’ll keep us hidden, at least.<br><span class=\"characterName\">Tino:</span> Doesn’t exactly feel cozy.<br> As they press deeper into the forest’s shadows, Tino feels a light tap on his shoulder.<br><span class=\"characterName\">Tino:</span> <i>Zee, now’s really not the time.</i> <br> He glances back toward Zanele.<br><span class=\"characterName\">Zanele:</span> Huh? I didn’t do anything.<br>Llewellyn suddenly feels something brush against his leg, and a dark figure slips away into the trees.<br><span class=\"characterName\">Llewellyn:</span> Um, guys ... I don’t think we’re alone here.<br>The surrounding leaves rustle, shadows twist, and the grass stirs as if alive.<br><span class=\"characterName\">Mthi:</span> Everyone, stay sharp.",
				"character1": "all",
				"character2": "none",
				"event": "none",
				"choices": []
			},
			{
				"branchId": "branch37",
				"text": "As goblins close in on the Atlas Six, you stand side by side with your companions, preparing to hold your ground.<br> Objective: Work with the team to defeat as many goblins as possible within the time limit. Reach enough points to secure a win and protect everyone from the horde. <br> Gameplay: Every goblin you take down adds points, but be careful: the goblins use green bombs scattered throughout the chaos, and hitting one will cost you. <br> Keep your accuracy sharp to avoid losing valuable points. <br> Mechanics: Hold down your left mouse button to slice through goblins with precision. The more goblins you strike, the closer you bring the group to victory. Good luck! The Atlas Six are counting on your skill to survive this onslaught! ",
				"character1": "none",
				"character2": "none",
				"event": "none",
				"choices": []
			},
			{
				"branchId": "branch38",
				"text": "",
				"character1": "none",
				"character2": "none",
				"event": "triggerGame",
				"game": "GoblinSlayer",
				"choices": []
			},
			{
				"branchId": "branch39",
				"text": "The battlefield settles for just a moment, and the group stands amid the aftermath of their victory. Tino’s sword gleams, streaked with dark goblin blood, and he gives Zanele a triumphant grin. <br> Zanele brushes a strand of hair from her face, her chains still crackling with residual energy. Mthi’s bow is lowered but ready, her sharp eyes scanning the shadows. <br>Just as a faint sigh of relief begins to escape, a low growl ripples through the forest. Rustling sounds echo from all around, followed by the unmistakable, guttural snarls of goblins hungry for vengeance. From the shadows, a fresh wave of goblins emerges, twice as many as before, their eyes gleaming with feral determination.",
				"character1": "all",
				"character2": "none",
				"event": "none",
				"choices": []
			},
			{
				"branchId": "branch40",
				"text": "Without missing a beat, Jasmin raises her hands, calling upon a shimmering shield of healing energy around her companions. Zanele’s chains pulse with a fiery glow, her focus sharp as she mutters an incantation, setting the ground alight with searing embers around the approaching goblins. <br> Mthi, with deadly precision, releases a rapid volley of arrows, each one finding its mark as goblins drop from the trees like broken puppet. <br>Llewellyn drives his blade into the earth with a thunderous crash, sending a shockwave that stuns a cluster of goblins. In one swift, fierce sweep, he cuts them down, his blade slicing through the air with lethal precision.<br><span class=\"characterName\">Jasmin:</span> They won't stop. <br><span class=\"characterName\">Llewellyn:</span> More target practice for us.",
				"character1": "all",
				"character2": "none",
				"event": "none",
				"choices": []
			},
			{
				"branchId": "branch41",
				"text": "",
				"character1": "none",
				"character2": "none",
				"event": "triggerBattle",
				"winnable": true,
				"startEnemies": [2, 3, 4, 5, 6],
				"spawnEnemies": [],
				"choices": []
			},
			{
				"branchId": "branch42",
				"text": " The group, weary and bruised from battle, trudges deeper into the forest. Shadows grow longer as twilight settles, and they come upon a spacious clearing carpeted with soft moss and encircled by towering oaks and whispering pines.",
				"character1": "all",
				"character2": "none",
				"event": "none",
				"choices": []
			},
			{
				"branchId": "branch43",
				"text": "",
				"character1": "none",
				"character2": "none",
				"event": "changeScene",
				"background": "forest campsite",
				"choices": []
			},
			{
				"branchId": "branch44",
				"text": "The scent of damp earth and pine needles hangs in the air, providing a strange sense of comfort amid the fading light. <br><span class=\"characterName\">Zanele:</span>Alright, let’s set up here. <br>  Zanele declares, her voice steady yet softened by fatigue. She assigns tasks: Mthi and Jasmin are to gather herbs,fibers and fruit, while Llewellyn and Tino collect firewood and materials to build a shelter. <br><span class=\"characterName\">Zanele:</span> I'll set up a defensive spell and keep watch.<br> The group accepts their respective tasks and begin preparing for the night ahead.",
				"character1": "all",
				"character2": "none",
				"event": "none",
				"choices": []
			},
			{
				"branchId": "branch45",
				"text": "",
				"character1": "none",
				"character2": "none",
				"event": "changeScene",
				"background": "picking forest",
				"choices": []
			},

			{
				"branchId": "branch46",
				"text": "<span class=\"characterName\">Jasmin:</span> Looks like it’s just us, Mthi. Let’s see what we can find.<br> They move quietly through the forest, the soft crackling of leaves underfoot as they pick their way through patches of herbs and low-hanging fruits. Jasmin’s eyes roam over the foliage, keenly spotting bright clusters of berries hidden among the leaves. <br><span class=\"characterName\">Mthi:</span> You always seem to know exactly what to look for, Jas. <br><span class=\"characterName\">Jasmin:</span> Comes with the job. Healer’s instinct, you know? And there’s something calming about it - being that helping hand in difficult situations. Just as your music puts us at ease <i> she playfully nudges Mthi </i>. <br><span class=\"characterName\">Mthi:</span> Thank you <i>she struggles not to smile shyly </i>. It’s beautiful how the moon filters down like this, isn’t it? Almost like the forest is alive with secrets. <br> They both stop, momentarily lost in the stillness of the night, their eyes drawn to the 3 moons hanging high above. The silver light casts a soft glow over the forest, illuminating the leaves and bathing the world in a tranquil silence.",
				"character1": "Images/healer.webp",
				"character2": "Images/eye.webp",
				"event": "none",
				"choices": []
			},
			{
				"branchId": "branch47",
				"text": "<span class=\"characterName\">Jasmin:</span> It really is. <br><span class=\"characterName\">Mthi:</span It reminds me of home. The wind, the animals , the silence, brings back memories of the hunt. Especially nights like these, they always feel familiar.<br> <i>She bends down to examine some dark green leaves hidden in the underbrush.</i> <br><span class=\"characterName\">Jasmin:</span> What is it? <br><span class=\"characterName\">Mthi:</span> These herbs - Moonshade and Fernshade. Moonshade works for quick mana recovery, Fernshade on the other hand can help replenish stamina. Which one do you think we should take? <br><span class=\"characterName\">Jasmin:</span> And we can't take both. I remember from my potion classes that these two don’t mix well -in fact, combined, they’re actually... poisonous.. <br><span class=\"characterName\">Mthi:</span> And we’ll need a good amount of one or the other to fully restore our mana or stamina.",
				"character1": "Images/healer.webp",
				"character2": "Images/eye.webp",
				"event": "none",
				"choices": []
			},
			{
				"branchId": "branch48",
				"text": "",
				"character1": "none",
				"character2": "none",
				"event": "visualChoices",
				"choices": [
					{
						"choiceId": "0",
						"imgSrc": "Images/moonshade.webp",
						"outcome": "Examining the plants in her hand, Jasmin frowns thoughtfully. <br><span class=\"characterName\">Jasmin:</span> We might need our magic more than anything else right now. Stamina’s good, but without mana, we’re defenseless.<br> Mthi nods in agreement, her gaze drifting over the glimmering blue ocean of the moonshade. <span class=\"characterName\">Mthi:</span> Mhm. And moonshade’s potency is just what we need to restore mana. If we bring enough of this back, it’ll give us an edge. <br><span class=\"characterName\">Jasmin:</span> Zanele’s probably expecting us to make the right call here. She looked ready to take on the world when we left. <br><span class=\"characterName\">Mthi:</span> I'm sure she’ll approve of this. Moonshade isn’t easy to find, but it’s worth it. <br> As they carefully gather the delicate, glowing leaves, the forest wraps them in a blanket of silence. The faint blue light of the moonshade reflects in their eyes, casting an fluorescent glow around them.",
						"option": "Moonshade",
						"character1": "Images/healer.webp",
						"character2": "Images/eye.webp",
						"gradient": " linear-gradient(90deg, hsla(159, 82%, 55%, 1) 0%, hsla(206, 98%, 48%, 1) 100%)",
						"event": "none"
					},
					{
						"choiceId": "1",
						"imgSrc": "Images/Fernshade.webp",
						"outcome": "<span class=\"characterName\">Mthi:</span> Hmmm, let's go with stamina.<br><span class=\"characterName\">Jasmin:</span> Agreed. It might not be as dazzling as moonshade, but it’s just as vital - especially if we need to keep our strength up. With Zanele putting us on herb duty, we’d better be ready for anything.<br><span class=\"characterName\">Mthi:</span> Exactly and if needed, atleast we will be able to run, although I would rather fight. <br><span class=\"characterName\">Jasmin:</span> You're always the first one to run, I will do it if push comes to shove but that's a last resort. <br> The two of them begin harvesting the Fernshade carefully, filling their pouches with the vibrant green leaves that seem to hum with earthy energy. <br><span class=\"characterName\">Mthi:</span> Speaking of running, race you to Zanele - <br> Mthi darts ahead with a burst of speed, her steps light and precise as she weaves through the underbrush. She nimbly dodges low-hanging branches and leaps over fallen logs with practiced grace, her movements so fluid it’s as though she’s gliding through the forest. Each stride is swift yet silent, her form barely a whisper. <br><span class=\"characterName\">Jasmin:</span>  Hey! ... wait Mthi, don't leave me here alone.",
						"option": "Fernshade",
						"character1": "Images/healer.webp",
						"character2": "Images/eye.webp",
						"gradient": "linear-gradient(90deg, hsla(0, 0%, 5%, 1) 0%, hsla(126, 82%, 33%, 1) 100%)",
						"event": "none"
					}
				]
			},
			{
				"branchId": "branch49",
				"text": "The forest hums with a quiet vigor, its massive trees stretching skyward, their silhouettes stretching long and dark under the pale moonlight. Tendrils of mist drift close to the ground, curling around knotted roots and thick ferns, obscuring the forest’s hidden mysteries. The silence is punctuated by soft rustling as nocturnal creatures move, their eyes catching light like tiny, scattered stars amid the foliage. Overhead, the leaves murmur in response to the light breeze, while the air hangs heavy with the rich, damp scent of moss and earth.",
				"character1": "none",
				"character2": "none",
				"event": "none",
				"choices": []
			},
			{
				"branchId": "branch50",
				"text": "",
				"character1": "none",
				"character2": "none",
				"event": "changeScene",
				"background": "fighting forest",
				"choices": []
			},
			{
				"branchId": "branch51",
				"text": "<span class=\"characterName\">Tino:</span> So then she says, <i>Only someone truly daring could handle this...</i> staring straight at me with those fiery eyes. <br><span class=\"characterName\">Llewellyn:</span> Sooo, did you handle it? <br><span class=\"characterName\">Tino:</span> It was such a mess, I got soaked.<br><span class=\"characterName\">Llewellyn:</span> Yea but Did you Handle it though ?<br><span class=\"characterName\">Tino:</span> The Basilisk? Nah, I left, not because I wasn’t up for it — but because... <i> He grabs a solid, rugged branch, its bark still fresh and damp from the night’s dew, perfect for stoking a strong fire.</i> <br><span class=\"characterName\">Llewellyn:</span> Because...? <br><span class=\"characterName\">Tino:</span> Because I was halfway across the kingdom on a very important errand, and the royal guard had already started to show up. No point in stepping into a mess like that. It's diffucult fighting a water type without a fire type. <br><span class=\"characterName\">Llewellyn:</span> Right and also it resembling a snake. I'm sure the guards had it all under control. <br>Llewellyn finishes chopping the branches and starts securing them to his back.<br><span class=\"characterName\">Tino:</span> That as well. <br> They both laugh then continue to gather materials throughout the forest's domain.",
				"character1": "Images/timekeeper.webp",
				"character2": "Images/titan.webp",
				"event": "none",
				"choices": []
			},
			{
				"branchId": "branch52",
				"text": "Under the cold moonlight, the clearing buzzed with tension. A black bear, its fur dark as night and eyes glowing a deep brown, stood its ground, claws scraping the earth. Its orange magic flickered around it, crackling with raw power. Across from it, a black wolf—sleek, agile, and with eyes gleaming green—shifted low to the ground, its fur shimmering with an ethereal green glow. The air hummed with their magic, the forest holding its breath. <br><span class=\"characterName\">Tino:</span> What do we have here? <br><span class=\"characterName\">Llewellyn:</span> Seems like we've got a show, you can have first pick. <br> Llewellyn looks at Tino awaiting his response to the bet. <br><span class=\"characterName\">Tino:</span> We both know what the obvious choice is here but just to be different I will go with...",
				"character1": "Images/Characters/Bear.webp",
				"character2": "Images/Characters/Wolf.webp",
				"event": "none",
				"choices": []
			},
			{
				"branchId": "branch53",
				"text": "",
				"character1": "none",
				"character2": "none",
				"event": "visualChoices",
				"choices": [
					{
						"choiceId": "0",
						"imgSrc": "Images/Characters/Bear.webp",
						"outcome": "<span class=\"characterName\">Tino:</span> I'm betting on the wolf, speed won't fail. <br><span class=\"characterName\">Llewellyn:</span> I wouldn’t be so sure. The bear’s got the power to crush anything in its path. The wolf leaps forward with a burst of green light, its speed like a blur as it hurls thorns towards the bear, a magical storm of green spikes. The bear grunts, its orange magic exploding around it as it slams into the ground, sending the thorns scattering. The bear’s eyes burn with rage, and it swipes out with massive claws, cutting through the air like deadly weapons. <br> The wolf dodges with grace, twisting in the air, but the bear follows, closing the distance with terrifying speed. It slams its paw down, sending shockwaves through the ground. The wolf, agile as ever, twists away just in time, but the bear’s magic surges with power, enveloping the wolf in a fiery embrace. <br><span class=\"characterName\">Tino:</span> Come on wolf... <br> The bear is relentless. Its claws tear through the air, striking with pinpoint precision. The wolf scrambles to keep up, using its green magic to deflect the bear’s strikes, but the power behind each blow from the bear sends shockwaves through the air. <br>The bear swipes again, catching the wolf off guard. With a final roar, the bear launches the wolf into the air with a massive burst of orange energy, sending the wolf crashing into the ground. The wolf groans, its green magic flickering weakly before finally fading. <br><span class=\"characterName\">Llewellyn:</span> Told you, strength wins everytime. <br><span class=\"characterName\">Tino:</span> No suprise to that in this case, next time, I'm betting on that bear. <br><span class=\"characterName\">Llewellyn:</span> That's more like it, now don't forget our bet. <br><span class=\"characterName\">Tino:</span> Yea yea, I'll do it, let's just take these back.",
						"option": "Bear",
						"character1": "Images/Characters/Bear.webp",
						"character2": "Images/Characters/Wolf.webp",
						"gradient": "linear-gradient(90deg, hsla(0, 0%, 0%, 1) 0%, hsla(11, 80%, 57%, 1) 100%)",
						"event": "none"
					},
					{
						"choiceId": "1",
						"imgSrc": "Images/Characters/Wolf.webp",
						"outcome": "<span class=\"characterName\">Tino:</span> I'm going with the wolf, something about speed that sits right with me. <br><span class=\"characterName\"> Llewellyn:</span> You don't say ? Well only makes sense I take strength then. <br> The wolf launches forward, a blur of green, and with a flash of magic, it summons a whirlwind of thorns, spiraling toward the bear. The bear counters with a shockwave of orange magic, slamming into the earth with explosive force, sending the thorns scattering. The wolf dodges, rolling under the bear’s swipe, its green magic pulsing as it creates a barrier of swirling energy to deflect the bear’s fiery assault. <br><span class=\"characterName\">Tino:</span> That's crazy speed right? <br><span class=\"characterName\">Llewellyn:</span> Yup but the fight has just begun. The bear roars, sending out a wave of fiery orange force, surging toward the wolf. But the wolf darts to the side, just out of reach, and strikes back with a devastating blast of green magic, freezing the air in front of it. The wolf’s jaws snap shut, aimed at the bear’s throat. For a moment, it looks like the wolf will win, but the bear, with a brutal swing, swipes the wolf’s magic aside and lands a crushing blow. The wolf staggers, but its pack emerges, shifting the momentum. With a final, explosive burst of green energy, the wolf forces the bear to retreat, its magic overwhelming the bear’s defenses. <br><span class=\"characterName\">Tino:</span> Interesting turn of events. <br><span class=\"characterName\">Llewellyn:</span> You got lucky. The wolf’s agility saved it this time. <i> Llewellyn chuckles </i>, Guess I'll have to do it then.<br><span class=\"characterName\">Tino:</span> Fear not your royal highess: You still remain the strongest in all the kingdoms.",
						"option": "Wolf",
						"character1": "Images/Characters/Bear.webp",
						"character2": "Images/Characters/Wolf.webp",
						"gradient": "linear-gradient(90deg, hsla(0, 0%, 5%, 1) 0%, hsla(126, 82%, 33%, 1) 100%)",
						"event": "none"
					}
				]
			},
			{
				"branchId": "branch54",
				"text": "To Resume here LATER",
				"character1": "Images/Characters/Bear.webp",
				"character2": "Images/Characters/Wolf.webp",
				"event": "none",
				"choices": []
			}
		]
	}
]
